TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Dec 12 17:41:46 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/CoP/mac_user_config.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\The_Wonderer\Google Drive\School\2018_3_Semester_Fa
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    5477                            .dwattr $C$DW$295, DW_AT_decl_file("..\Application\CoP\mac_user_config.h")
    5478                            .dwattr $C$DW$295, DW_AT_decl_line(0x11d)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  102

    5479                            .dwattr $C$DW$295, DW_AT_decl_column(0x05)
    5480                    
    5481                    $C$DW$296       .dwtag  DW_TAG_enumerator
    5482                            .dwattr $C$DW$296, DW_AT_name("MAC_RADIO_CC1352P")
    5483                            .dwattr $C$DW$296, DW_AT_const_value(0x02)
    5484                            .dwattr $C$DW$296, DW_AT_decl_file("..\Application\CoP\mac_user_config.h")
    5485                            .dwattr $C$DW$296, DW_AT_decl_line(0x11e)
    5486                            .dwattr $C$DW$296, DW_AT_decl_column(0x05)
    5487                    
    5488                    $C$DW$297       .dwtag  DW_TAG_enumerator
    5489                            .dwattr $C$DW$297, DW_AT_name("MAC_RADIO_CCXXX2")
    5490                            .dwattr $C$DW$297, DW_AT_const_value(0x00)
    5491                            .dwattr $C$DW$297, DW_AT_decl_file("..\Application\CoP\mac_user_config.h")
    5492                            .dwattr $C$DW$297, DW_AT_decl_line(0x11f)
    5493                            .dwattr $C$DW$297, DW_AT_decl_column(0x05)
    5494                    
    5495                            .dwattr $C$DW$T$547, DW_AT_decl_file("..\Application\CoP\mac_user_config.h")
    5496                            .dwattr $C$DW$T$547, DW_AT_decl_line(0x118)
    5497                            .dwattr $C$DW$T$547, DW_AT_decl_column(0x01)
    5498                            .dwendtag $C$DW$T$547
    5499                    
    5500                    $C$DW$T$548     .dwtag  DW_TAG_typedef
    5501                            .dwattr $C$DW$T$548, DW_AT_name("macChipType_t")
    5502                            .dwattr $C$DW$T$548, DW_AT_type(*$C$DW$T$547)
    5503                            .dwattr $C$DW$T$548, DW_AT_language(DW_LANG_C)
    5504                            .dwattr $C$DW$T$548, DW_AT_decl_file("..\Application\CoP\mac_user_config.h")
    5505                            .dwattr $C$DW$T$548, DW_AT_decl_line(0x120)
    5506                            .dwattr $C$DW$T$548, DW_AT_decl_column(0x03)
    5507                    
    5508                    
    5509                    $C$DW$T$549     .dwtag  DW_TAG_enumeration_type
    5510                            .dwattr $C$DW$T$549, DW_AT_byte_size(0x01)
    5511                    $C$DW$298       .dwtag  DW_TAG_enumerator
    5512                            .dwattr $C$DW$298, DW_AT_name("MAC_HW_REV_21")
    5513                            .dwattr $C$DW$298, DW_AT_const_value(0x00)
    5514                            .dwattr $C$DW$298, DW_AT_decl_file("..\Application\CoP\mac_user_config.h")
    5515                            .dwattr $C$DW$298, DW_AT_decl_line(0x125)
    5516                            .dwattr $C$DW$298, DW_AT_decl_column(0x05)
    5517                    
    5518                    $C$DW$299       .dwtag  DW_TAG_enumerator
    5519                            .dwattr $C$DW$299, DW_AT_name("MAC_HW_REV_20")
    5520                            .dwattr $C$DW$299, DW_AT_const_value(0x01)
    5521                            .dwattr $C$DW$299, DW_AT_decl_file("..\Application\CoP\mac_user_config.h")
    5522                            .dwattr $C$DW$299, DW_AT_decl_line(0x126)
    5523                            .dwattr $C$DW$299, DW_AT_decl_column(0x05)
    5524                    
    5525                    $C$DW$300       .dwtag  DW_TAG_enumerator
    5526                            .dwattr $C$DW$300, DW_AT_name("MAC_HW_MAX_REVS")
    5527                            .dwattr $C$DW$300, DW_AT_const_value(0x02)
    5528                            .dwattr $C$DW$300, DW_AT_decl_file("..\Application\CoP\mac_user_config.h")
    5529                            .dwattr $C$DW$300, DW_AT_decl_line(0x127)
    5530                            .dwattr $C$DW$300, DW_AT_decl_column(0x05)
    5531                    
    5532                            .dwattr $C$DW$T$549, DW_AT_decl_file("..\Application\CoP\mac_user_config.h")
    5533                            .dwattr $C$DW$T$549, DW_AT_decl_line(0x124)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  103

    5534                            .dwattr $C$DW$T$549, DW_AT_decl_column(0x01)
    5535                            .dwendtag $C$DW$T$549
    5536                    
    5537                    $C$DW$T$550     .dwtag  DW_TAG_typedef
    5538                            .dwattr $C$DW$T$550, DW_AT_name("macHwRevision_t")
    5539                            .dwattr $C$DW$T$550, DW_AT_type(*$C$DW$T$549)
    5540                            .dwattr $C$DW$T$550, DW_AT_language(DW_LANG_C)
    5541                            .dwattr $C$DW$T$550, DW_AT_decl_file("..\Application\CoP\mac_user_config.h")
    5542                            .dwattr $C$DW$T$550, DW_AT_decl_line(0x128)
    5543                            .dwattr $C$DW$T$550, DW_AT_decl_column(0x03)
    5544                    
    5545                    
    5546                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5547                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    5548                    $C$DW$301       .dwtag  DW_TAG_member
    5549                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$22)
    5550                            .dwattr $C$DW$301, DW_AT_name("rfMode")
    5551                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("rfMode")
    5552                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5553                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    5554                            .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5555                            .dwattr $C$DW$301, DW_AT_decl_line(0x421)
    5556                            .dwattr $C$DW$301, DW_AT_decl_column(0x0d)
    5557                    
    5558                    $C$DW$302       .dwtag  DW_TAG_member
    5559                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$24)
    5560                            .dwattr $C$DW$302, DW_AT_name("cpePatchFxn")
    5561                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("cpePatchFxn")
    5562                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5563                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    5564                            .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5565                            .dwattr $C$DW$302, DW_AT_decl_line(0x422)
    5566                            .dwattr $C$DW$302, DW_AT_decl_column(0x0c)
    5567                    
    5568                    $C$DW$303       .dwtag  DW_TAG_member
    5569                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$24)
    5570                            .dwattr $C$DW$303, DW_AT_name("mcePatchFxn")
    5571                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("mcePatchFxn")
    5572                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5573                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    5574                            .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5575                            .dwattr $C$DW$303, DW_AT_decl_line(0x423)
    5576                            .dwattr $C$DW$303, DW_AT_decl_column(0x0c)
    5577                    
    5578                    $C$DW$304       .dwtag  DW_TAG_member
    5579                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$24)
    5580                            .dwattr $C$DW$304, DW_AT_name("rfePatchFxn")
    5581                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("rfePatchFxn")
    5582                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5583                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    5584                            .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5585                            .dwattr $C$DW$304, DW_AT_decl_line(0x424)
    5586                            .dwattr $C$DW$304, DW_AT_decl_column(0x0c)
    5587                    
    5588                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  104

    5589                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x420)
    5590                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    5591                            .dwendtag $C$DW$T$25
    5592                    
    5593                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    5594                            .dwattr $C$DW$T$49, DW_AT_name("RF_Mode")
    5595                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
    5596                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    5597                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    5598                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x425)
    5599                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    5600                    
    5601                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    5602                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    5603                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    5604                    
    5605                    
    5606                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5607                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    5608                    $C$DW$305       .dwtag  DW_TAG_member
    5609                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$22)
    5610                            .dwattr $C$DW$305, DW_AT_name("triggerType")
    5611                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("triggerType")
    5612                            .dwattr $C$DW$305, DW_AT_bit_offset(0x04)
    5613                            .dwattr $C$DW$305, DW_AT_bit_size(0x04)
    5614                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5615                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    5616                            .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5617                            .dwattr $C$DW$305, DW_AT_decl_line(0x7d)
    5618                            .dwattr $C$DW$305, DW_AT_decl_column(0x0f)
    5619                    
    5620                    $C$DW$306       .dwtag  DW_TAG_member
    5621                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$22)
    5622                            .dwattr $C$DW$306, DW_AT_name("bEnaCmd")
    5623                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("bEnaCmd")
    5624                            .dwattr $C$DW$306, DW_AT_bit_offset(0x03)
    5625                            .dwattr $C$DW$306, DW_AT_bit_size(0x01)
    5626                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5627                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    5628                            .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5629                            .dwattr $C$DW$306, DW_AT_decl_line(0x7e)
    5630                            .dwattr $C$DW$306, DW_AT_decl_column(0x0f)
    5631                    
    5632                    $C$DW$307       .dwtag  DW_TAG_member
    5633                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$22)
    5634                            .dwattr $C$DW$307, DW_AT_name("triggerNo")
    5635                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("triggerNo")
    5636                            .dwattr $C$DW$307, DW_AT_bit_offset(0x01)
    5637                            .dwattr $C$DW$307, DW_AT_bit_size(0x02)
    5638                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5639                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    5640                            .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5641                            .dwattr $C$DW$307, DW_AT_decl_line(0x80)
    5642                            .dwattr $C$DW$307, DW_AT_decl_column(0x0f)
    5643                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  105

    5644                    $C$DW$308       .dwtag  DW_TAG_member
    5645                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$22)
    5646                            .dwattr $C$DW$308, DW_AT_name("pastTrig")
    5647                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("pastTrig")
    5648                            .dwattr $C$DW$308, DW_AT_bit_offset(0x00)
    5649                            .dwattr $C$DW$308, DW_AT_bit_size(0x01)
    5650                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5651                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    5652                            .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5653                            .dwattr $C$DW$308, DW_AT_decl_line(0x81)
    5654                            .dwattr $C$DW$308, DW_AT_decl_column(0x0f)
    5655                    
    5656                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5657                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x7c)
    5658                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    5659                            .dwendtag $C$DW$T$26
    5660                    
    5661                    
    5662                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5663                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    5664                    $C$DW$309       .dwtag  DW_TAG_member
    5665                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$22)
    5666                            .dwattr $C$DW$309, DW_AT_name("rule")
    5667                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("rule")
    5668                            .dwattr $C$DW$309, DW_AT_bit_offset(0x04)
    5669                            .dwattr $C$DW$309, DW_AT_bit_size(0x04)
    5670                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5671                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    5672                            .dwattr $C$DW$309, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5673                            .dwattr $C$DW$309, DW_AT_decl_line(0x85)
    5674                            .dwattr $C$DW$309, DW_AT_decl_column(0x0f)
    5675                    
    5676                    $C$DW$310       .dwtag  DW_TAG_member
    5677                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$22)
    5678                            .dwattr $C$DW$310, DW_AT_name("nSkip")
    5679                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("nSkip")
    5680                            .dwattr $C$DW$310, DW_AT_bit_offset(0x00)
    5681                            .dwattr $C$DW$310, DW_AT_bit_size(0x04)
    5682                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5683                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    5684                            .dwattr $C$DW$310, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5685                            .dwattr $C$DW$310, DW_AT_decl_line(0x86)
    5686                            .dwattr $C$DW$310, DW_AT_decl_column(0x0f)
    5687                    
    5688                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5689                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x84)
    5690                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    5691                            .dwendtag $C$DW$T$27
    5692                    
    5693                    
    5694                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5695                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    5696                    $C$DW$311       .dwtag  DW_TAG_member
    5697                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$22)
    5698                            .dwattr $C$DW$311, DW_AT_name("triggerType")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  106

    5699                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("triggerType")
    5700                            .dwattr $C$DW$311, DW_AT_bit_offset(0x04)
    5701                            .dwattr $C$DW$311, DW_AT_bit_size(0x04)
    5702                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5703                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    5704                            .dwattr $C$DW$311, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5705                            .dwattr $C$DW$311, DW_AT_decl_line(0xb3)
    5706                            .dwattr $C$DW$311, DW_AT_decl_column(0x0f)
    5707                    
    5708                    $C$DW$312       .dwtag  DW_TAG_member
    5709                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$22)
    5710                            .dwattr $C$DW$312, DW_AT_name("bEnaCmd")
    5711                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("bEnaCmd")
    5712                            .dwattr $C$DW$312, DW_AT_bit_offset(0x03)
    5713                            .dwattr $C$DW$312, DW_AT_bit_size(0x01)
    5714                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5715                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    5716                            .dwattr $C$DW$312, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5717                            .dwattr $C$DW$312, DW_AT_decl_line(0xb4)
    5718                            .dwattr $C$DW$312, DW_AT_decl_column(0x0f)
    5719                    
    5720                    $C$DW$313       .dwtag  DW_TAG_member
    5721                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$22)
    5722                            .dwattr $C$DW$313, DW_AT_name("triggerNo")
    5723                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("triggerNo")
    5724                            .dwattr $C$DW$313, DW_AT_bit_offset(0x01)
    5725                            .dwattr $C$DW$313, DW_AT_bit_size(0x02)
    5726                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5727                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    5728                            .dwattr $C$DW$313, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5729                            .dwattr $C$DW$313, DW_AT_decl_line(0xb6)
    5730                            .dwattr $C$DW$313, DW_AT_decl_column(0x0f)
    5731                    
    5732                    $C$DW$314       .dwtag  DW_TAG_member
    5733                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$22)
    5734                            .dwattr $C$DW$314, DW_AT_name("pastTrig")
    5735                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("pastTrig")
    5736                            .dwattr $C$DW$314, DW_AT_bit_offset(0x00)
    5737                            .dwattr $C$DW$314, DW_AT_bit_size(0x01)
    5738                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5739                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    5740                            .dwattr $C$DW$314, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5741                            .dwattr $C$DW$314, DW_AT_decl_line(0xb7)
    5742                            .dwattr $C$DW$314, DW_AT_decl_column(0x0f)
    5743                    
    5744                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5745                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xb2)
    5746                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    5747                            .dwendtag $C$DW$T$28
    5748                    
    5749                    
    5750                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5751                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    5752                    $C$DW$315       .dwtag  DW_TAG_member
    5753                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$22)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  107

    5754                            .dwattr $C$DW$315, DW_AT_name("rule")
    5755                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("rule")
    5756                            .dwattr $C$DW$315, DW_AT_bit_offset(0x04)
    5757                            .dwattr $C$DW$315, DW_AT_bit_size(0x04)
    5758                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5759                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    5760                            .dwattr $C$DW$315, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5761                            .dwattr $C$DW$315, DW_AT_decl_line(0xbb)
    5762                            .dwattr $C$DW$315, DW_AT_decl_column(0x0f)
    5763                    
    5764                    $C$DW$316       .dwtag  DW_TAG_member
    5765                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$22)
    5766                            .dwattr $C$DW$316, DW_AT_name("nSkip")
    5767                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("nSkip")
    5768                            .dwattr $C$DW$316, DW_AT_bit_offset(0x00)
    5769                            .dwattr $C$DW$316, DW_AT_bit_size(0x04)
    5770                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5771                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5772                            .dwattr $C$DW$316, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5773                            .dwattr $C$DW$316, DW_AT_decl_line(0xbc)
    5774                            .dwattr $C$DW$316, DW_AT_decl_column(0x0f)
    5775                    
    5776                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5777                            .dwattr $C$DW$T$29, DW_AT_decl_line(0xba)
    5778                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    5779                            .dwendtag $C$DW$T$29
    5780                    
    5781                    
    5782                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5783                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    5784                    $C$DW$317       .dwtag  DW_TAG_member
    5785                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$31)
    5786                            .dwattr $C$DW$317, DW_AT_name("frontEndMode")
    5787                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("frontEndMode")
    5788                            .dwattr $C$DW$317, DW_AT_bit_offset(0x0d)
    5789                            .dwattr $C$DW$317, DW_AT_bit_size(0x03)
    5790                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5791                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    5792                            .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5793                            .dwattr $C$DW$317, DW_AT_decl_line(0xc9)
    5794                            .dwattr $C$DW$317, DW_AT_decl_column(0x10)
    5795                    
    5796                    $C$DW$318       .dwtag  DW_TAG_member
    5797                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$31)
    5798                            .dwattr $C$DW$318, DW_AT_name("biasMode")
    5799                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("biasMode")
    5800                            .dwattr $C$DW$318, DW_AT_bit_offset(0x0c)
    5801                            .dwattr $C$DW$318, DW_AT_bit_size(0x01)
    5802                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5803                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5804                            .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5805                            .dwattr $C$DW$318, DW_AT_decl_line(0xcf)
    5806                            .dwattr $C$DW$318, DW_AT_decl_column(0x10)
    5807                    
    5808                    $C$DW$319       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  108

    5809                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$31)
    5810                            .dwattr $C$DW$319, DW_AT_name("analogCfgMode")
    5811                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("analogCfgMode")
    5812                            .dwattr $C$DW$319, DW_AT_bit_offset(0x06)
    5813                            .dwattr $C$DW$319, DW_AT_bit_size(0x06)
    5814                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5815                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5816                            .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5817                            .dwattr $C$DW$319, DW_AT_decl_line(0xd1)
    5818                            .dwattr $C$DW$319, DW_AT_decl_column(0x10)
    5819                    
    5820                    $C$DW$320       .dwtag  DW_TAG_member
    5821                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$31)
    5822                            .dwattr $C$DW$320, DW_AT_name("bNoFsPowerUp")
    5823                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("bNoFsPowerUp")
    5824                            .dwattr $C$DW$320, DW_AT_bit_offset(0x05)
    5825                            .dwattr $C$DW$320, DW_AT_bit_size(0x01)
    5826                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5827                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5828                            .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5829                            .dwattr $C$DW$320, DW_AT_decl_line(0xd8)
    5830                            .dwattr $C$DW$320, DW_AT_decl_column(0x10)
    5831                    
    5832                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5833                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xc8)
    5834                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    5835                            .dwendtag $C$DW$T$32
    5836                    
    5837                    
    5838                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5839                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    5840                    $C$DW$321       .dwtag  DW_TAG_member
    5841                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$22)
    5842                            .dwattr $C$DW$321, DW_AT_name("triggerType")
    5843                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("triggerType")
    5844                            .dwattr $C$DW$321, DW_AT_bit_offset(0x04)
    5845                            .dwattr $C$DW$321, DW_AT_bit_size(0x04)
    5846                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5847                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5848                            .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5849                            .dwattr $C$DW$321, DW_AT_decl_line(0x1cf)
    5850                            .dwattr $C$DW$321, DW_AT_decl_column(0x0f)
    5851                    
    5852                    $C$DW$322       .dwtag  DW_TAG_member
    5853                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$22)
    5854                            .dwattr $C$DW$322, DW_AT_name("bEnaCmd")
    5855                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("bEnaCmd")
    5856                            .dwattr $C$DW$322, DW_AT_bit_offset(0x03)
    5857                            .dwattr $C$DW$322, DW_AT_bit_size(0x01)
    5858                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5859                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5860                            .dwattr $C$DW$322, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5861                            .dwattr $C$DW$322, DW_AT_decl_line(0x1d0)
    5862                            .dwattr $C$DW$322, DW_AT_decl_column(0x0f)
    5863                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  109

    5864                    $C$DW$323       .dwtag  DW_TAG_member
    5865                            .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$22)
    5866                            .dwattr $C$DW$323, DW_AT_name("triggerNo")
    5867                            .dwattr $C$DW$323, DW_AT_TI_symbol_name("triggerNo")
    5868                            .dwattr $C$DW$323, DW_AT_bit_offset(0x01)
    5869                            .dwattr $C$DW$323, DW_AT_bit_size(0x02)
    5870                            .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5871                            .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5872                            .dwattr $C$DW$323, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5873                            .dwattr $C$DW$323, DW_AT_decl_line(0x1d2)
    5874                            .dwattr $C$DW$323, DW_AT_decl_column(0x0f)
    5875                    
    5876                    $C$DW$324       .dwtag  DW_TAG_member
    5877                            .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$22)
    5878                            .dwattr $C$DW$324, DW_AT_name("pastTrig")
    5879                            .dwattr $C$DW$324, DW_AT_TI_symbol_name("pastTrig")
    5880                            .dwattr $C$DW$324, DW_AT_bit_offset(0x00)
    5881                            .dwattr $C$DW$324, DW_AT_bit_size(0x01)
    5882                            .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5883                            .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5884                            .dwattr $C$DW$324, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5885                            .dwattr $C$DW$324, DW_AT_decl_line(0x1d3)
    5886                            .dwattr $C$DW$324, DW_AT_decl_column(0x0f)
    5887                    
    5888                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5889                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1ce)
    5890                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    5891                            .dwendtag $C$DW$T$33
    5892                    
    5893                    
    5894                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5895                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    5896                    $C$DW$325       .dwtag  DW_TAG_member
    5897                            .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$22)
    5898                            .dwattr $C$DW$325, DW_AT_name("rule")
    5899                            .dwattr $C$DW$325, DW_AT_TI_symbol_name("rule")
    5900                            .dwattr $C$DW$325, DW_AT_bit_offset(0x04)
    5901                            .dwattr $C$DW$325, DW_AT_bit_size(0x04)
    5902                            .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5903                            .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5904                            .dwattr $C$DW$325, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5905                            .dwattr $C$DW$325, DW_AT_decl_line(0x1d7)
    5906                            .dwattr $C$DW$325, DW_AT_decl_column(0x0f)
    5907                    
    5908                    $C$DW$326       .dwtag  DW_TAG_member
    5909                            .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$22)
    5910                            .dwattr $C$DW$326, DW_AT_name("nSkip")
    5911                            .dwattr $C$DW$326, DW_AT_TI_symbol_name("nSkip")
    5912                            .dwattr $C$DW$326, DW_AT_bit_offset(0x00)
    5913                            .dwattr $C$DW$326, DW_AT_bit_size(0x04)
    5914                            .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5915                            .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5916                            .dwattr $C$DW$326, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5917                            .dwattr $C$DW$326, DW_AT_decl_line(0x1d8)
    5918                            .dwattr $C$DW$326, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  110

    5919                    
    5920                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5921                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x1d6)
    5922                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    5923                            .dwendtag $C$DW$T$34
    5924                    
    5925                    
    5926                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5927                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    5928                    $C$DW$327       .dwtag  DW_TAG_member
    5929                            .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$31)
    5930                            .dwattr $C$DW$327, DW_AT_name("modType")
    5931                            .dwattr $C$DW$327, DW_AT_TI_symbol_name("modType")
    5932                            .dwattr $C$DW$327, DW_AT_bit_offset(0x0d)
    5933                            .dwattr $C$DW$327, DW_AT_bit_size(0x03)
    5934                            .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5935                            .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5936                            .dwattr $C$DW$327, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5937                            .dwattr $C$DW$327, DW_AT_decl_line(0x1db)
    5938                            .dwattr $C$DW$327, DW_AT_decl_column(0x10)
    5939                    
    5940                    $C$DW$328       .dwtag  DW_TAG_member
    5941                            .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$31)
    5942                            .dwattr $C$DW$328, DW_AT_name("deviation")
    5943                            .dwattr $C$DW$328, DW_AT_TI_symbol_name("deviation")
    5944                            .dwattr $C$DW$328, DW_AT_bit_offset(0x00)
    5945                            .dwattr $C$DW$328, DW_AT_bit_size(0x0d)
    5946                            .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5947                            .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5948                            .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5949                            .dwattr $C$DW$328, DW_AT_decl_line(0x1de)
    5950                            .dwattr $C$DW$328, DW_AT_decl_column(0x10)
    5951                    
    5952                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5953                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1da)
    5954                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    5955                            .dwendtag $C$DW$T$35
    5956                    
    5957                    
    5958                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5959                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    5960                    $C$DW$329       .dwtag  DW_TAG_member
    5961                            .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$37)
    5962                            .dwattr $C$DW$329, DW_AT_name("preScale")
    5963                            .dwattr $C$DW$329, DW_AT_TI_symbol_name("preScale")
    5964                            .dwattr $C$DW$329, DW_AT_bit_offset(0x1c)
    5965                            .dwattr $C$DW$329, DW_AT_bit_size(0x04)
    5966                            .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5967                            .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5968                            .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5969                            .dwattr $C$DW$329, DW_AT_decl_line(0x1e1)
    5970                            .dwattr $C$DW$329, DW_AT_decl_column(0x10)
    5971                    
    5972                    $C$DW$330       .dwtag  DW_TAG_member
    5973                            .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$37)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  111

    5974                            .dwattr $C$DW$330, DW_AT_name("rateWord")
    5975                            .dwattr $C$DW$330, DW_AT_TI_symbol_name("rateWord")
    5976                            .dwattr $C$DW$330, DW_AT_bit_offset(0x03)
    5977                            .dwattr $C$DW$330, DW_AT_bit_size(0x15)
    5978                            .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5979                            .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5980                            .dwattr $C$DW$330, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5981                            .dwattr $C$DW$330, DW_AT_decl_line(0x1e3)
    5982                            .dwattr $C$DW$330, DW_AT_decl_column(0x10)
    5983                    
    5984                    $C$DW$331       .dwtag  DW_TAG_member
    5985                            .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$37)
    5986                            .dwattr $C$DW$331, DW_AT_name("decimMode")
    5987                            .dwattr $C$DW$331, DW_AT_TI_symbol_name("decimMode")
    5988                            .dwattr $C$DW$331, DW_AT_bit_offset(0x00)
    5989                            .dwattr $C$DW$331, DW_AT_bit_size(0x03)
    5990                            .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5991                            .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5992                            .dwattr $C$DW$331, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5993                            .dwattr $C$DW$331, DW_AT_decl_line(0x1e4)
    5994                            .dwattr $C$DW$331, DW_AT_decl_column(0x10)
    5995                    
    5996                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5997                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x1e0)
    5998                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    5999                            .dwendtag $C$DW$T$38
    6000                    
    6001                    
    6002                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6003                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    6004                    $C$DW$332       .dwtag  DW_TAG_member
    6005                            .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$22)
    6006                            .dwattr $C$DW$332, DW_AT_name("nPreamBytes")
    6007                            .dwattr $C$DW$332, DW_AT_TI_symbol_name("nPreamBytes")
    6008                            .dwattr $C$DW$332, DW_AT_bit_offset(0x02)
    6009                            .dwattr $C$DW$332, DW_AT_bit_size(0x06)
    6010                            .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6011                            .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    6012                            .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6013                            .dwattr $C$DW$332, DW_AT_decl_line(0x1ec)
    6014                            .dwattr $C$DW$332, DW_AT_decl_column(0x0f)
    6015                    
    6016                    $C$DW$333       .dwtag  DW_TAG_member
    6017                            .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$22)
    6018                            .dwattr $C$DW$333, DW_AT_name("preamMode")
    6019                            .dwattr $C$DW$333, DW_AT_TI_symbol_name("preamMode")
    6020                            .dwattr $C$DW$333, DW_AT_bit_offset(0x00)
    6021                            .dwattr $C$DW$333, DW_AT_bit_size(0x02)
    6022                            .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6023                            .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    6024                            .dwattr $C$DW$333, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6025                            .dwattr $C$DW$333, DW_AT_decl_line(0x1f2)
    6026                            .dwattr $C$DW$333, DW_AT_decl_column(0x0f)
    6027                    
    6028                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  112

    6029                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x1eb)
    6030                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    6031                            .dwendtag $C$DW$T$39
    6032                    
    6033                    
    6034                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6035                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    6036                    $C$DW$334       .dwtag  DW_TAG_member
    6037                            .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$31)
    6038                            .dwattr $C$DW$334, DW_AT_name("nSwBits")
    6039                            .dwattr $C$DW$334, DW_AT_TI_symbol_name("nSwBits")
    6040                            .dwattr $C$DW$334, DW_AT_bit_offset(0x0a)
    6041                            .dwattr $C$DW$334, DW_AT_bit_size(0x06)
    6042                            .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6043                            .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    6044                            .dwattr $C$DW$334, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6045                            .dwattr $C$DW$334, DW_AT_decl_line(0x1f8)
    6046                            .dwattr $C$DW$334, DW_AT_decl_column(0x10)
    6047                    
    6048                    $C$DW$335       .dwtag  DW_TAG_member
    6049                            .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$31)
    6050                            .dwattr $C$DW$335, DW_AT_name("bBitReversal")
    6051                            .dwattr $C$DW$335, DW_AT_TI_symbol_name("bBitReversal")
    6052                            .dwattr $C$DW$335, DW_AT_bit_offset(0x09)
    6053                            .dwattr $C$DW$335, DW_AT_bit_size(0x01)
    6054                            .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6055                            .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    6056                            .dwattr $C$DW$335, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6057                            .dwattr $C$DW$335, DW_AT_decl_line(0x1f9)
    6058                            .dwattr $C$DW$335, DW_AT_decl_column(0x10)
    6059                    
    6060                    $C$DW$336       .dwtag  DW_TAG_member
    6061                            .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$31)
    6062                            .dwattr $C$DW$336, DW_AT_name("bMsbFirst")
    6063                            .dwattr $C$DW$336, DW_AT_TI_symbol_name("bMsbFirst")
    6064                            .dwattr $C$DW$336, DW_AT_bit_offset(0x08)
    6065                            .dwattr $C$DW$336, DW_AT_bit_size(0x01)
    6066                            .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6067                            .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    6068                            .dwattr $C$DW$336, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6069                            .dwattr $C$DW$336, DW_AT_decl_line(0x1fb)
    6070                            .dwattr $C$DW$336, DW_AT_decl_column(0x10)
    6071                    
    6072                    $C$DW$337       .dwtag  DW_TAG_member
    6073                            .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$31)
    6074                            .dwattr $C$DW$337, DW_AT_name("fecMode")
    6075                            .dwattr $C$DW$337, DW_AT_TI_symbol_name("fecMode")
    6076                            .dwattr $C$DW$337, DW_AT_bit_offset(0x04)
    6077                            .dwattr $C$DW$337, DW_AT_bit_size(0x04)
    6078                            .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6079                            .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    6080                            .dwattr $C$DW$337, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6081                            .dwattr $C$DW$337, DW_AT_decl_line(0x1fd)
    6082                            .dwattr $C$DW$337, DW_AT_decl_column(0x10)
    6083                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  113

    6084                    $C$DW$338       .dwtag  DW_TAG_member
    6085                            .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$31)
    6086                            .dwattr $C$DW$338, DW_AT_name("whitenMode")
    6087                            .dwattr $C$DW$338, DW_AT_TI_symbol_name("whitenMode")
    6088                            .dwattr $C$DW$338, DW_AT_bit_offset(0x00)
    6089                            .dwattr $C$DW$338, DW_AT_bit_size(0x03)
    6090                            .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6091                            .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    6092                            .dwattr $C$DW$338, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6093                            .dwattr $C$DW$338, DW_AT_decl_line(0x203)
    6094                            .dwattr $C$DW$338, DW_AT_decl_column(0x10)
    6095                    
    6096                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6097                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x1f7)
    6098                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    6099                            .dwendtag $C$DW$T$40
    6100                    
    6101                    
    6102                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6103                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    6104                    $C$DW$339       .dwtag  DW_TAG_member
    6105                            .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$31)
    6106                            .dwattr $C$DW$339, DW_AT_name("frontEndMode")
    6107                            .dwattr $C$DW$339, DW_AT_TI_symbol_name("frontEndMode")
    6108                            .dwattr $C$DW$339, DW_AT_bit_offset(0x0d)
    6109                            .dwattr $C$DW$339, DW_AT_bit_size(0x03)
    6110                            .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6111                            .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    6112                            .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6113                            .dwattr $C$DW$339, DW_AT_decl_line(0x20d)
    6114                            .dwattr $C$DW$339, DW_AT_decl_column(0x10)
    6115                    
    6116                    $C$DW$340       .dwtag  DW_TAG_member
    6117                            .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$31)
    6118                            .dwattr $C$DW$340, DW_AT_name("biasMode")
    6119                            .dwattr $C$DW$340, DW_AT_TI_symbol_name("biasMode")
    6120                            .dwattr $C$DW$340, DW_AT_bit_offset(0x0c)
    6121                            .dwattr $C$DW$340, DW_AT_bit_size(0x01)
    6122                            .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6123                            .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    6124                            .dwattr $C$DW$340, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6125                            .dwattr $C$DW$340, DW_AT_decl_line(0x213)
    6126                            .dwattr $C$DW$340, DW_AT_decl_column(0x10)
    6127                    
    6128                    $C$DW$341       .dwtag  DW_TAG_member
    6129                            .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$31)
    6130                            .dwattr $C$DW$341, DW_AT_name("analogCfgMode")
    6131                            .dwattr $C$DW$341, DW_AT_TI_symbol_name("analogCfgMode")
    6132                            .dwattr $C$DW$341, DW_AT_bit_offset(0x06)
    6133                            .dwattr $C$DW$341, DW_AT_bit_size(0x06)
    6134                            .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6135                            .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    6136                            .dwattr $C$DW$341, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6137                            .dwattr $C$DW$341, DW_AT_decl_line(0x215)
    6138                            .dwattr $C$DW$341, DW_AT_decl_column(0x10)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  114

    6139                    
    6140                    $C$DW$342       .dwtag  DW_TAG_member
    6141                            .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$31)
    6142                            .dwattr $C$DW$342, DW_AT_name("bNoFsPowerUp")
    6143                            .dwattr $C$DW$342, DW_AT_TI_symbol_name("bNoFsPowerUp")
    6144                            .dwattr $C$DW$342, DW_AT_bit_offset(0x05)
    6145                            .dwattr $C$DW$342, DW_AT_bit_size(0x01)
    6146                            .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6147                            .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    6148                            .dwattr $C$DW$342, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6149                            .dwattr $C$DW$342, DW_AT_decl_line(0x21c)
    6150                            .dwattr $C$DW$342, DW_AT_decl_column(0x10)
    6151                    
    6152                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6153                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x20c)
    6154                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    6155                            .dwendtag $C$DW$T$41
    6156                    
    6157                    
    6158                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6159                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    6160                    $C$DW$343       .dwtag  DW_TAG_member
    6161                            .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$22)
    6162                            .dwattr $C$DW$343, DW_AT_name("triggerType")
    6163                            .dwattr $C$DW$343, DW_AT_TI_symbol_name("triggerType")
    6164                            .dwattr $C$DW$343, DW_AT_bit_offset(0x04)
    6165                            .dwattr $C$DW$343, DW_AT_bit_size(0x04)
    6166                            .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6167                            .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    6168                            .dwattr $C$DW$343, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6169                            .dwattr $C$DW$343, DW_AT_decl_line(0x232)
    6170                            .dwattr $C$DW$343, DW_AT_decl_column(0x0f)
    6171                    
    6172                    $C$DW$344       .dwtag  DW_TAG_member
    6173                            .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$22)
    6174                            .dwattr $C$DW$344, DW_AT_name("bEnaCmd")
    6175                            .dwattr $C$DW$344, DW_AT_TI_symbol_name("bEnaCmd")
    6176                            .dwattr $C$DW$344, DW_AT_bit_offset(0x03)
    6177                            .dwattr $C$DW$344, DW_AT_bit_size(0x01)
    6178                            .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6179                            .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    6180                            .dwattr $C$DW$344, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6181                            .dwattr $C$DW$344, DW_AT_decl_line(0x233)
    6182                            .dwattr $C$DW$344, DW_AT_decl_column(0x0f)
    6183                    
    6184                    $C$DW$345       .dwtag  DW_TAG_member
    6185                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$22)
    6186                            .dwattr $C$DW$345, DW_AT_name("triggerNo")
    6187                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("triggerNo")
    6188                            .dwattr $C$DW$345, DW_AT_bit_offset(0x01)
    6189                            .dwattr $C$DW$345, DW_AT_bit_size(0x02)
    6190                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6191                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    6192                            .dwattr $C$DW$345, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6193                            .dwattr $C$DW$345, DW_AT_decl_line(0x235)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  115

    6194                            .dwattr $C$DW$345, DW_AT_decl_column(0x0f)
    6195                    
    6196                    $C$DW$346       .dwtag  DW_TAG_member
    6197                            .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$22)
    6198                            .dwattr $C$DW$346, DW_AT_name("pastTrig")
    6199                            .dwattr $C$DW$346, DW_AT_TI_symbol_name("pastTrig")
    6200                            .dwattr $C$DW$346, DW_AT_bit_offset(0x00)
    6201                            .dwattr $C$DW$346, DW_AT_bit_size(0x01)
    6202                            .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6203                            .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    6204                            .dwattr $C$DW$346, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6205                            .dwattr $C$DW$346, DW_AT_decl_line(0x236)
    6206                            .dwattr $C$DW$346, DW_AT_decl_column(0x0f)
    6207                    
    6208                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6209                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x231)
    6210                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    6211                            .dwendtag $C$DW$T$42
    6212                    
    6213                    
    6214                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6215                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    6216                    $C$DW$347       .dwtag  DW_TAG_member
    6217                            .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$22)
    6218                            .dwattr $C$DW$347, DW_AT_name("rule")
    6219                            .dwattr $C$DW$347, DW_AT_TI_symbol_name("rule")
    6220                            .dwattr $C$DW$347, DW_AT_bit_offset(0x04)
    6221                            .dwattr $C$DW$347, DW_AT_bit_size(0x04)
    6222                            .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6223                            .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    6224                            .dwattr $C$DW$347, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6225                            .dwattr $C$DW$347, DW_AT_decl_line(0x23a)
    6226                            .dwattr $C$DW$347, DW_AT_decl_column(0x0f)
    6227                    
    6228                    $C$DW$348       .dwtag  DW_TAG_member
    6229                            .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$22)
    6230                            .dwattr $C$DW$348, DW_AT_name("nSkip")
    6231                            .dwattr $C$DW$348, DW_AT_TI_symbol_name("nSkip")
    6232                            .dwattr $C$DW$348, DW_AT_bit_offset(0x00)
    6233                            .dwattr $C$DW$348, DW_AT_bit_size(0x04)
    6234                            .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6235                            .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    6236                            .dwattr $C$DW$348, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6237                            .dwattr $C$DW$348, DW_AT_decl_line(0x23b)
    6238                            .dwattr $C$DW$348, DW_AT_decl_column(0x0f)
    6239                    
    6240                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6241                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x239)
    6242                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    6243                            .dwendtag $C$DW$T$43
    6244                    
    6245                    
    6246                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6247                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    6248                    $C$DW$349       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  116

    6249                            .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$31)
    6250                            .dwattr $C$DW$349, DW_AT_name("modType")
    6251                            .dwattr $C$DW$349, DW_AT_TI_symbol_name("modType")
    6252                            .dwattr $C$DW$349, DW_AT_bit_offset(0x0d)
    6253                            .dwattr $C$DW$349, DW_AT_bit_size(0x03)
    6254                            .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6255                            .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    6256                            .dwattr $C$DW$349, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6257                            .dwattr $C$DW$349, DW_AT_decl_line(0x23e)
    6258                            .dwattr $C$DW$349, DW_AT_decl_column(0x10)
    6259                    
    6260                    $C$DW$350       .dwtag  DW_TAG_member
    6261                            .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$31)
    6262                            .dwattr $C$DW$350, DW_AT_name("deviation")
    6263                            .dwattr $C$DW$350, DW_AT_TI_symbol_name("deviation")
    6264                            .dwattr $C$DW$350, DW_AT_bit_offset(0x00)
    6265                            .dwattr $C$DW$350, DW_AT_bit_size(0x0d)
    6266                            .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6267                            .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    6268                            .dwattr $C$DW$350, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6269                            .dwattr $C$DW$350, DW_AT_decl_line(0x241)
    6270                            .dwattr $C$DW$350, DW_AT_decl_column(0x10)
    6271                    
    6272                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6273                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x23d)
    6274                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    6275                            .dwendtag $C$DW$T$44
    6276                    
    6277                    
    6278                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6279                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    6280                    $C$DW$351       .dwtag  DW_TAG_member
    6281                            .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$37)
    6282                            .dwattr $C$DW$351, DW_AT_name("preScale")
    6283                            .dwattr $C$DW$351, DW_AT_TI_symbol_name("preScale")
    6284                            .dwattr $C$DW$351, DW_AT_bit_offset(0x1c)
    6285                            .dwattr $C$DW$351, DW_AT_bit_size(0x04)
    6286                            .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6287                            .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    6288                            .dwattr $C$DW$351, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6289                            .dwattr $C$DW$351, DW_AT_decl_line(0x244)
    6290                            .dwattr $C$DW$351, DW_AT_decl_column(0x10)
    6291                    
    6292                    $C$DW$352       .dwtag  DW_TAG_member
    6293                            .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$37)
    6294                            .dwattr $C$DW$352, DW_AT_name("rateWord")
    6295                            .dwattr $C$DW$352, DW_AT_TI_symbol_name("rateWord")
    6296                            .dwattr $C$DW$352, DW_AT_bit_offset(0x03)
    6297                            .dwattr $C$DW$352, DW_AT_bit_size(0x15)
    6298                            .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6299                            .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    6300                            .dwattr $C$DW$352, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6301                            .dwattr $C$DW$352, DW_AT_decl_line(0x246)
    6302                            .dwattr $C$DW$352, DW_AT_decl_column(0x10)
    6303                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  117

    6304                    $C$DW$353       .dwtag  DW_TAG_member
    6305                            .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$37)
    6306                            .dwattr $C$DW$353, DW_AT_name("decimMode")
    6307                            .dwattr $C$DW$353, DW_AT_TI_symbol_name("decimMode")
    6308                            .dwattr $C$DW$353, DW_AT_bit_offset(0x00)
    6309                            .dwattr $C$DW$353, DW_AT_bit_size(0x03)
    6310                            .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6311                            .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    6312                            .dwattr $C$DW$353, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6313                            .dwattr $C$DW$353, DW_AT_decl_line(0x247)
    6314                            .dwattr $C$DW$353, DW_AT_decl_column(0x10)
    6315                    
    6316                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6317                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x243)
    6318                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    6319                            .dwendtag $C$DW$T$45
    6320                    
    6321                    
    6322                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    6323                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    6324                    $C$DW$354       .dwtag  DW_TAG_member
    6325                            .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$22)
    6326                            .dwattr $C$DW$354, DW_AT_name("nPreamBytes")
    6327                            .dwattr $C$DW$354, DW_AT_TI_symbol_name("nPreamBytes")
    6328                            .dwattr $C$DW$354, DW_AT_bit_offset(0x02)
    6329                            .dwattr $C$DW$354, DW_AT_bit_size(0x06)
    6330                            .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6331                            .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    6332                            .dwattr $C$DW$354, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6333                            .dwattr $C$DW$354, DW_AT_decl_line(0x24f)
    6334                            .dwattr $C$DW$354, DW_AT_decl_column(0x0f)
    6335                    
    6336                    $C$DW$355       .dwtag  DW_TAG_member
    6337                            .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$22)
    6338                            .dwattr $C$DW$355, DW_AT_name("preamMode")
    6339                            .dwattr $C$DW$355, DW_AT_TI_symbol_name("preamMode")
    6340                            .dwattr $C$DW$355, DW_AT_bit_offset(0x00)
    6341                            .dwattr $C$DW$355, DW_AT_bit_size(0x02)
    6342                            .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6343                            .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    6344                            .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6345                            .dwattr $C$DW$355, DW_AT_decl_line(0x255)
    6346                            .dwattr $C$DW$355, DW_AT_decl_column(0x0f)
    6347                    
    6348                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6349                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x24e)
    6350                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
    6351                            .dwendtag $C$DW$T$46
    6352                    
    6353                    
    6354                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    6355                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    6356                    $C$DW$356       .dwtag  DW_TAG_member
    6357                            .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$31)
    6358                            .dwattr $C$DW$356, DW_AT_name("nSwBits")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  118

    6359                            .dwattr $C$DW$356, DW_AT_TI_symbol_name("nSwBits")
    6360                            .dwattr $C$DW$356, DW_AT_bit_offset(0x0a)
    6361                            .dwattr $C$DW$356, DW_AT_bit_size(0x06)
    6362                            .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6363                            .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    6364                            .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6365                            .dwattr $C$DW$356, DW_AT_decl_line(0x25b)
    6366                            .dwattr $C$DW$356, DW_AT_decl_column(0x10)
    6367                    
    6368                    $C$DW$357       .dwtag  DW_TAG_member
    6369                            .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$31)
    6370                            .dwattr $C$DW$357, DW_AT_name("bBitReversal")
    6371                            .dwattr $C$DW$357, DW_AT_TI_symbol_name("bBitReversal")
    6372                            .dwattr $C$DW$357, DW_AT_bit_offset(0x09)
    6373                            .dwattr $C$DW$357, DW_AT_bit_size(0x01)
    6374                            .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6375                            .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    6376                            .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6377                            .dwattr $C$DW$357, DW_AT_decl_line(0x25c)
    6378                            .dwattr $C$DW$357, DW_AT_decl_column(0x10)
    6379                    
    6380                    $C$DW$358       .dwtag  DW_TAG_member
    6381                            .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$31)
    6382                            .dwattr $C$DW$358, DW_AT_name("bMsbFirst")
    6383                            .dwattr $C$DW$358, DW_AT_TI_symbol_name("bMsbFirst")
    6384                            .dwattr $C$DW$358, DW_AT_bit_offset(0x08)
    6385                            .dwattr $C$DW$358, DW_AT_bit_size(0x01)
    6386                            .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6387                            .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    6388                            .dwattr $C$DW$358, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6389                            .dwattr $C$DW$358, DW_AT_decl_line(0x25e)
    6390                            .dwattr $C$DW$358, DW_AT_decl_column(0x10)
    6391                    
    6392                    $C$DW$359       .dwtag  DW_TAG_member
    6393                            .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$31)
    6394                            .dwattr $C$DW$359, DW_AT_name("fecMode")
    6395                            .dwattr $C$DW$359, DW_AT_TI_symbol_name("fecMode")
    6396                            .dwattr $C$DW$359, DW_AT_bit_offset(0x04)
    6397                            .dwattr $C$DW$359, DW_AT_bit_size(0x04)
    6398                            .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6399                            .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    6400                            .dwattr $C$DW$359, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6401                            .dwattr $C$DW$359, DW_AT_decl_line(0x260)
    6402                            .dwattr $C$DW$359, DW_AT_decl_column(0x10)
    6403                    
    6404                    $C$DW$360       .dwtag  DW_TAG_member
    6405                            .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$31)
    6406                            .dwattr $C$DW$360, DW_AT_name("whitenMode")
    6407                            .dwattr $C$DW$360, DW_AT_TI_symbol_name("whitenMode")
    6408                            .dwattr $C$DW$360, DW_AT_bit_offset(0x00)
    6409                            .dwattr $C$DW$360, DW_AT_bit_size(0x03)
    6410                            .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6411                            .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    6412                            .dwattr $C$DW$360, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6413                            .dwattr $C$DW$360, DW_AT_decl_line(0x266)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  119

    6414                            .dwattr $C$DW$360, DW_AT_decl_column(0x10)
    6415                    
    6416                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6417                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x25a)
    6418                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x0b)
    6419                            .dwendtag $C$DW$T$47
    6420                    
    6421                    
    6422                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    6423                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    6424                    $C$DW$361       .dwtag  DW_TAG_member
    6425                            .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$31)
    6426                            .dwattr $C$DW$361, DW_AT_name("frontEndMode")
    6427                            .dwattr $C$DW$361, DW_AT_TI_symbol_name("frontEndMode")
    6428                            .dwattr $C$DW$361, DW_AT_bit_offset(0x0d)
    6429                            .dwattr $C$DW$361, DW_AT_bit_size(0x03)
    6430                            .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6431                            .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    6432                            .dwattr $C$DW$361, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6433                            .dwattr $C$DW$361, DW_AT_decl_line(0x270)
    6434                            .dwattr $C$DW$361, DW_AT_decl_column(0x10)
    6435                    
    6436                    $C$DW$362       .dwtag  DW_TAG_member
    6437                            .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$31)
    6438                            .dwattr $C$DW$362, DW_AT_name("biasMode")
    6439                            .dwattr $C$DW$362, DW_AT_TI_symbol_name("biasMode")
    6440                            .dwattr $C$DW$362, DW_AT_bit_offset(0x0c)
    6441                            .dwattr $C$DW$362, DW_AT_bit_size(0x01)
    6442                            .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6443                            .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    6444                            .dwattr $C$DW$362, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6445                            .dwattr $C$DW$362, DW_AT_decl_line(0x276)
    6446                            .dwattr $C$DW$362, DW_AT_decl_column(0x10)
    6447                    
    6448                    $C$DW$363       .dwtag  DW_TAG_member
    6449                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$31)
    6450                            .dwattr $C$DW$363, DW_AT_name("analogCfgMode")
    6451                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("analogCfgMode")
    6452                            .dwattr $C$DW$363, DW_AT_bit_offset(0x06)
    6453                            .dwattr $C$DW$363, DW_AT_bit_size(0x06)
    6454                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6455                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    6456                            .dwattr $C$DW$363, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6457                            .dwattr $C$DW$363, DW_AT_decl_line(0x278)
    6458                            .dwattr $C$DW$363, DW_AT_decl_column(0x10)
    6459                    
    6460                    $C$DW$364       .dwtag  DW_TAG_member
    6461                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$31)
    6462                            .dwattr $C$DW$364, DW_AT_name("bNoFsPowerUp")
    6463                            .dwattr $C$DW$364, DW_AT_TI_symbol_name("bNoFsPowerUp")
    6464                            .dwattr $C$DW$364, DW_AT_bit_offset(0x05)
    6465                            .dwattr $C$DW$364, DW_AT_bit_size(0x01)
    6466                            .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6467                            .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    6468                            .dwattr $C$DW$364, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  120

    6469                            .dwattr $C$DW$364, DW_AT_decl_line(0x27f)
    6470                            .dwattr $C$DW$364, DW_AT_decl_column(0x10)
    6471                    
    6472                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6473                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x26f)
    6474                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0b)
    6475                            .dwendtag $C$DW$T$48
    6476                    
    6477                    
    6478                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    6479                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x24)
    6480                    $C$DW$365       .dwtag  DW_TAG_member
    6481                            .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$37)
    6482                            .dwattr $C$DW$365, DW_AT_name("nInactivityTimeout")
    6483                            .dwattr $C$DW$365, DW_AT_TI_symbol_name("nInactivityTimeout")
    6484                            .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6485                            .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    6486                            .dwattr $C$DW$365, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6487                            .dwattr $C$DW$365, DW_AT_decl_line(0x515)
    6488                            .dwattr $C$DW$365, DW_AT_decl_column(0x1d)
    6489                    
    6490                    $C$DW$366       .dwtag  DW_TAG_member
    6491                            .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$50)
    6492                            .dwattr $C$DW$366, DW_AT_name("pRfMode")
    6493                            .dwattr $C$DW$366, DW_AT_TI_symbol_name("pRfMode")
    6494                            .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6495                            .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    6496                            .dwattr $C$DW$366, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6497                            .dwattr $C$DW$366, DW_AT_decl_line(0x516)
    6498                            .dwattr $C$DW$366, DW_AT_decl_column(0x1d)
    6499                    
    6500                    $C$DW$367       .dwtag  DW_TAG_member
    6501                            .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$52)
    6502                            .dwattr $C$DW$367, DW_AT_name("pRadioSetup")
    6503                            .dwattr $C$DW$367, DW_AT_TI_symbol_name("pRadioSetup")
    6504                            .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6505                            .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    6506                            .dwattr $C$DW$367, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6507                            .dwattr $C$DW$367, DW_AT_decl_line(0x517)
    6508                            .dwattr $C$DW$367, DW_AT_decl_column(0x1d)
    6509                    
    6510                    $C$DW$368       .dwtag  DW_TAG_member
    6511                            .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$37)
    6512                            .dwattr $C$DW$368, DW_AT_name("nPowerUpDuration")
    6513                            .dwattr $C$DW$368, DW_AT_TI_symbol_name("nPowerUpDuration")
    6514                            .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6515                            .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    6516                            .dwattr $C$DW$368, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6517                            .dwattr $C$DW$368, DW_AT_decl_line(0x518)
    6518                            .dwattr $C$DW$368, DW_AT_decl_column(0x1d)
    6519                    
    6520                    $C$DW$369       .dwtag  DW_TAG_member
    6521                            .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$53)
    6522                            .dwattr $C$DW$369, DW_AT_name("bMeasurePowerUpDuration")
    6523                            .dwattr $C$DW$369, DW_AT_TI_symbol_name("bMeasurePowerUpDuration")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  121

    6524                            .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6525                            .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    6526                            .dwattr $C$DW$369, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6527                            .dwattr $C$DW$369, DW_AT_decl_line(0x519)
    6528                            .dwattr $C$DW$369, DW_AT_decl_column(0x1d)
    6529                    
    6530                    $C$DW$370       .dwtag  DW_TAG_member
    6531                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$53)
    6532                            .dwattr $C$DW$370, DW_AT_name("bUpdateSetup")
    6533                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("bUpdateSetup")
    6534                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6535                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    6536                            .dwattr $C$DW$370, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6537                            .dwattr $C$DW$370, DW_AT_decl_line(0x51a)
    6538                            .dwattr $C$DW$370, DW_AT_decl_column(0x1d)
    6539                    
    6540                    $C$DW$371       .dwtag  DW_TAG_member
    6541                            .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$31)
    6542                            .dwattr $C$DW$371, DW_AT_name("nPowerUpDurationMargin")
    6543                            .dwattr $C$DW$371, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
    6544                            .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6545                            .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    6546                            .dwattr $C$DW$371, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6547                            .dwattr $C$DW$371, DW_AT_decl_line(0x51b)
    6548                            .dwattr $C$DW$371, DW_AT_decl_column(0x1d)
    6549                    
    6550                    $C$DW$372       .dwtag  DW_TAG_member
    6551                            .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$3)
    6552                            .dwattr $C$DW$372, DW_AT_name("pPowerCb")
    6553                            .dwattr $C$DW$372, DW_AT_TI_symbol_name("pPowerCb")
    6554                            .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6555                            .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    6556                            .dwattr $C$DW$372, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6557                            .dwattr $C$DW$372, DW_AT_decl_line(0x51c)
    6558                            .dwattr $C$DW$372, DW_AT_decl_column(0x1d)
    6559                    
    6560                    $C$DW$373       .dwtag  DW_TAG_member
    6561                            .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$3)
    6562                            .dwattr $C$DW$373, DW_AT_name("pErrCb")
    6563                            .dwattr $C$DW$373, DW_AT_TI_symbol_name("pErrCb")
    6564                            .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6565                            .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    6566                            .dwattr $C$DW$373, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6567                            .dwattr $C$DW$373, DW_AT_decl_line(0x51d)
    6568                            .dwattr $C$DW$373, DW_AT_decl_column(0x1d)
    6569                    
    6570                    $C$DW$374       .dwtag  DW_TAG_member
    6571                            .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$3)
    6572                            .dwattr $C$DW$374, DW_AT_name("pClientEventCb")
    6573                            .dwattr $C$DW$374, DW_AT_TI_symbol_name("pClientEventCb")
    6574                            .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6575                            .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    6576                            .dwattr $C$DW$374, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6577                            .dwattr $C$DW$374, DW_AT_decl_line(0x51e)
    6578                            .dwattr $C$DW$374, DW_AT_decl_column(0x1d)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  122

    6579                    
    6580                    $C$DW$375       .dwtag  DW_TAG_member
    6581                            .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$54)
    6582                            .dwattr $C$DW$375, DW_AT_name("nClientEventMask")
    6583                            .dwattr $C$DW$375, DW_AT_TI_symbol_name("nClientEventMask")
    6584                            .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6585                            .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    6586                            .dwattr $C$DW$375, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6587                            .dwattr $C$DW$375, DW_AT_decl_line(0x51f)
    6588                            .dwattr $C$DW$375, DW_AT_decl_column(0x1d)
    6589                    
    6590                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    6591                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x514)
    6592                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x0c)
    6593                            .dwendtag $C$DW$T$55
    6594                    
    6595                    
    6596                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    6597                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    6598                    $C$DW$376       .dwtag  DW_TAG_member
    6599                            .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$22)
    6600                            .dwattr $C$DW$376, DW_AT_name("triggerType")
    6601                            .dwattr $C$DW$376, DW_AT_TI_symbol_name("triggerType")
    6602                            .dwattr $C$DW$376, DW_AT_bit_offset(0x04)
    6603                            .dwattr $C$DW$376, DW_AT_bit_size(0x04)
    6604                            .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6605                            .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    6606                            .dwattr $C$DW$376, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6607                            .dwattr $C$DW$376, DW_AT_decl_line(0xee)
    6608                            .dwattr $C$DW$376, DW_AT_decl_column(0x0f)
    6609                    
    6610                    $C$DW$377       .dwtag  DW_TAG_member
    6611                            .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$22)
    6612                            .dwattr $C$DW$377, DW_AT_name("bEnaCmd")
    6613                            .dwattr $C$DW$377, DW_AT_TI_symbol_name("bEnaCmd")
    6614                            .dwattr $C$DW$377, DW_AT_bit_offset(0x03)
    6615                            .dwattr $C$DW$377, DW_AT_bit_size(0x01)
    6616                            .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6617                            .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    6618                            .dwattr $C$DW$377, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6619                            .dwattr $C$DW$377, DW_AT_decl_line(0xef)
    6620                            .dwattr $C$DW$377, DW_AT_decl_column(0x0f)
    6621                    
    6622                    $C$DW$378       .dwtag  DW_TAG_member
    6623                            .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$22)
    6624                            .dwattr $C$DW$378, DW_AT_name("triggerNo")
    6625                            .dwattr $C$DW$378, DW_AT_TI_symbol_name("triggerNo")
    6626                            .dwattr $C$DW$378, DW_AT_bit_offset(0x01)
    6627                            .dwattr $C$DW$378, DW_AT_bit_size(0x02)
    6628                            .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6629                            .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    6630                            .dwattr $C$DW$378, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6631                            .dwattr $C$DW$378, DW_AT_decl_line(0xf1)
    6632                            .dwattr $C$DW$378, DW_AT_decl_column(0x0f)
    6633                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EE682154-919C-4335-9B39-32BB038DB7B3} PAGE  123

    6634                    $C$DW$379       .dwtag  DW_TAG_member
    6635                            .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$22)
    6636                            .dwattr $C$DW$379, DW_AT_name("pastTrig")
    6637                            .dwattr $C$DW$379, DW_AT_TI_symbol_name("pastTrig")
    6638                            .dwattr $C$DW$379, DW_AT_bit_offset(0x00)
    6639                            .dwattr $C$DW$379, DW_AT_bit_size(0x01)
    6640                            .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6641                            .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    6642                            .dwattr $C$DW$379, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6643                            .dwattr $C$DW$379, DW_AT_decl_line(0xf2)
    6644                            .dwattr $C$DW$379, DW_AT_decl_column(0x0f)
    6645                    
    6646                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6647                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xed)
    6648                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x0b)
    6649                            .dwendtag $C$DW$T$56
    6650                    
    6651                    
    6652                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    6653                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
    6654                    $C$DW$380       .dwtag  DW_TAG_member
    6655                            .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$22)
    6656                            .dwattr $C$DW$380, DW_AT_name("rule")
    6657                            .dwattr $C$DW$380, DW_AT_TI_symbol_name("rule")
