TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Dec 12 17:41:47 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/CoP/main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\The_Wonderer\Google Drive\School\2018_3_Semester_Fa
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    5157                            .dwattr $C$DW$506, DW_AT_name("MAC_FH_SET_REQ")
    5158                            .dwattr $C$DW$506, DW_AT_const_value(0xf4)
    5159                            .dwattr $C$DW$506, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5160                            .dwattr $C$DW$506, DW_AT_decl_line(0x5e)
    5161                            .dwattr $C$DW$506, DW_AT_decl_column(0x03)
    5162                    
    5163                    $C$DW$507       .dwtag  DW_TAG_enumerator
    5164                            .dwattr $C$DW$507, DW_AT_name("MAC_FH_GET_REQ")
    5165                            .dwattr $C$DW$507, DW_AT_const_value(0xf5)
    5166                            .dwattr $C$DW$507, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5167                            .dwattr $C$DW$507, DW_AT_decl_line(0x5f)
    5168                            .dwattr $C$DW$507, DW_AT_decl_column(0x03)
    5169                    
    5170                    $C$DW$508       .dwtag  DW_TAG_enumerator
    5171                            .dwattr $C$DW$508, DW_AT_name("MAC_MLME_WS_ASYNC_REQ")
    5172                            .dwattr $C$DW$508, DW_AT_const_value(0xf6)
    5173                            .dwattr $C$DW$508, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5174                            .dwattr $C$DW$508, DW_AT_decl_line(0x60)
    5175                            .dwattr $C$DW$508, DW_AT_decl_column(0x03)
    5176                    
    5177                    $C$DW$509       .dwtag  DW_TAG_enumerator
    5178                            .dwattr $C$DW$509, DW_AT_name("MAC_SEC_ADD_DEVICE")
    5179                            .dwattr $C$DW$509, DW_AT_const_value(0xf7)
    5180                            .dwattr $C$DW$509, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5181                            .dwattr $C$DW$509, DW_AT_decl_line(0x61)
    5182                            .dwattr $C$DW$509, DW_AT_decl_column(0x03)
    5183                    
    5184                    $C$DW$510       .dwtag  DW_TAG_enumerator
    5185                            .dwattr $C$DW$510, DW_AT_name("MAC_SEC_DEL_DEVICE")
    5186                            .dwattr $C$DW$510, DW_AT_const_value(0xf8)
    5187                            .dwattr $C$DW$510, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5188                            .dwattr $C$DW$510, DW_AT_decl_line(0x62)
    5189                            .dwattr $C$DW$510, DW_AT_decl_column(0x03)
    5190                    
    5191                    $C$DW$511       .dwtag  DW_TAG_enumerator
    5192                            .dwattr $C$DW$511, DW_AT_name("MAC_SEC_DEL_KEY_AND_DEVICES")
    5193                            .dwattr $C$DW$511, DW_AT_const_value(0xf9)
    5194                            .dwattr $C$DW$511, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5195                            .dwattr $C$DW$511, DW_AT_decl_line(0x63)
    5196                            .dwattr $C$DW$511, DW_AT_decl_column(0x03)
    5197                    
    5198                    $C$DW$512       .dwtag  DW_TAG_enumerator
    5199                            .dwattr $C$DW$512, DW_AT_name("MAC_SEC_DEL_ALL_DEVICES")
    5200                            .dwattr $C$DW$512, DW_AT_const_value(0xfa)
    5201                            .dwattr $C$DW$512, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5202                            .dwattr $C$DW$512, DW_AT_decl_line(0x64)
    5203                            .dwattr $C$DW$512, DW_AT_decl_column(0x03)
    5204                    
    5205                    $C$DW$513       .dwtag  DW_TAG_enumerator
    5206                            .dwattr $C$DW$513, DW_AT_name("MAC_SEC_GET_DEFAULT_SOURCE_KEY")
    5207                            .dwattr $C$DW$513, DW_AT_const_value(0xfb)
    5208                            .dwattr $C$DW$513, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5209                            .dwattr $C$DW$513, DW_AT_decl_line(0x65)
    5210                            .dwattr $C$DW$513, DW_AT_decl_column(0x03)
    5211                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE   96

    5212                    $C$DW$514       .dwtag  DW_TAG_enumerator
    5213                            .dwattr $C$DW$514, DW_AT_name("MAC_SEC_ADD_KEY_INIT_FC")
    5214                            .dwattr $C$DW$514, DW_AT_const_value(0xfc)
    5215                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5216                            .dwattr $C$DW$514, DW_AT_decl_line(0x66)
    5217                            .dwattr $C$DW$514, DW_AT_decl_column(0x03)
    5218                    
    5219                            .dwattr $C$DW$T$1355, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    5220                            .dwattr $C$DW$T$1355, DW_AT_decl_line(0x39)
    5221                            .dwattr $C$DW$T$1355, DW_AT_decl_column(0x01)
    5222                            .dwendtag $C$DW$T$1355
    5223                    
    5224                    
    5225                    $C$DW$T$133     .dwtag  DW_TAG_structure_type
    5226                            .dwattr $C$DW$T$133, DW_AT_byte_size(0x58)
    5227                    $C$DW$515       .dwtag  DW_TAG_member
    5228                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$132)
    5229                            .dwattr $C$DW$515, DW_AT_name("CCFG_EXT_LF_CLK")
    5230                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("CCFG_EXT_LF_CLK")
    5231                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5232                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    5233                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5234                            .dwattr $C$DW$515, DW_AT_decl_line(0x31)
    5235                            .dwattr $C$DW$515, DW_AT_decl_column(0x10)
    5236                    
    5237                    $C$DW$516       .dwtag  DW_TAG_member
    5238                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$132)
    5239                            .dwattr $C$DW$516, DW_AT_name("CCFG_MODE_CONF_1")
    5240                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("CCFG_MODE_CONF_1")
    5241                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5242                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    5243                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5244                            .dwattr $C$DW$516, DW_AT_decl_line(0x32)
    5245                            .dwattr $C$DW$516, DW_AT_decl_column(0x10)
    5246                    
    5247                    $C$DW$517       .dwtag  DW_TAG_member
    5248                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$132)
    5249                            .dwattr $C$DW$517, DW_AT_name("CCFG_SIZE_AND_DIS_FLAGS")
    5250                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("CCFG_SIZE_AND_DIS_FLAGS")
    5251                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5252                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    5253                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5254                            .dwattr $C$DW$517, DW_AT_decl_line(0x33)
    5255                            .dwattr $C$DW$517, DW_AT_decl_column(0x10)
    5256                    
    5257                    $C$DW$518       .dwtag  DW_TAG_member
    5258                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$132)
    5259                            .dwattr $C$DW$518, DW_AT_name("CCFG_MODE_CONF")
    5260                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("CCFG_MODE_CONF")
    5261                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5262                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    5263                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5264                            .dwattr $C$DW$518, DW_AT_decl_line(0x34)
    5265                            .dwattr $C$DW$518, DW_AT_decl_column(0x10)
    5266                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE   97

    5267                    $C$DW$519       .dwtag  DW_TAG_member
    5268                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$132)
    5269                            .dwattr $C$DW$519, DW_AT_name("CCFG_VOLT_LOAD_0")
    5270                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("CCFG_VOLT_LOAD_0")
    5271                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5272                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    5273                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5274                            .dwattr $C$DW$519, DW_AT_decl_line(0x35)
    5275                            .dwattr $C$DW$519, DW_AT_decl_column(0x10)
    5276                    
    5277                    $C$DW$520       .dwtag  DW_TAG_member
    5278                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$132)
    5279                            .dwattr $C$DW$520, DW_AT_name("CCFG_VOLT_LOAD_1")
    5280                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("CCFG_VOLT_LOAD_1")
    5281                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5282                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    5283                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5284                            .dwattr $C$DW$520, DW_AT_decl_line(0x36)
    5285                            .dwattr $C$DW$520, DW_AT_decl_column(0x10)
    5286                    
    5287                    $C$DW$521       .dwtag  DW_TAG_member
    5288                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$132)
    5289                            .dwattr $C$DW$521, DW_AT_name("CCFG_RTC_OFFSET")
    5290                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("CCFG_RTC_OFFSET")
    5291                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5292                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    5293                            .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5294                            .dwattr $C$DW$521, DW_AT_decl_line(0x37)
    5295                            .dwattr $C$DW$521, DW_AT_decl_column(0x10)
    5296                    
    5297                    $C$DW$522       .dwtag  DW_TAG_member
    5298                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$132)
    5299                            .dwattr $C$DW$522, DW_AT_name("CCFG_FREQ_OFFSET")
    5300                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("CCFG_FREQ_OFFSET")
    5301                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5302                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    5303                            .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5304                            .dwattr $C$DW$522, DW_AT_decl_line(0x38)
    5305                            .dwattr $C$DW$522, DW_AT_decl_column(0x10)
    5306                    
    5307                    $C$DW$523       .dwtag  DW_TAG_member
    5308                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$132)
    5309                            .dwattr $C$DW$523, DW_AT_name("CCFG_IEEE_MAC_0")
    5310                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("CCFG_IEEE_MAC_0")
    5311                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5312                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    5313                            .dwattr $C$DW$523, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5314                            .dwattr $C$DW$523, DW_AT_decl_line(0x39)
    5315                            .dwattr $C$DW$523, DW_AT_decl_column(0x10)
    5316                    
    5317                    $C$DW$524       .dwtag  DW_TAG_member
    5318                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$132)
    5319                            .dwattr $C$DW$524, DW_AT_name("CCFG_IEEE_MAC_1")
    5320                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("CCFG_IEEE_MAC_1")
    5321                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE   98

    5322                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    5323                            .dwattr $C$DW$524, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5324                            .dwattr $C$DW$524, DW_AT_decl_line(0x3a)
    5325                            .dwattr $C$DW$524, DW_AT_decl_column(0x10)
    5326                    
    5327                    $C$DW$525       .dwtag  DW_TAG_member
    5328                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$132)
    5329                            .dwattr $C$DW$525, DW_AT_name("CCFG_IEEE_BLE_0")
    5330                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("CCFG_IEEE_BLE_0")
    5331                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5332                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    5333                            .dwattr $C$DW$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5334                            .dwattr $C$DW$525, DW_AT_decl_line(0x3b)
    5335                            .dwattr $C$DW$525, DW_AT_decl_column(0x10)
    5336                    
    5337                    $C$DW$526       .dwtag  DW_TAG_member
    5338                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$132)
    5339                            .dwattr $C$DW$526, DW_AT_name("CCFG_IEEE_BLE_1")
    5340                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("CCFG_IEEE_BLE_1")
    5341                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5342                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    5343                            .dwattr $C$DW$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5344                            .dwattr $C$DW$526, DW_AT_decl_line(0x3c)
    5345                            .dwattr $C$DW$526, DW_AT_decl_column(0x10)
    5346                    
    5347                    $C$DW$527       .dwtag  DW_TAG_member
    5348                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$132)
    5349                            .dwattr $C$DW$527, DW_AT_name("CCFG_BL_CONFIG")
    5350                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("CCFG_BL_CONFIG")
    5351                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5352                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    5353                            .dwattr $C$DW$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5354                            .dwattr $C$DW$527, DW_AT_decl_line(0x3d)
    5355                            .dwattr $C$DW$527, DW_AT_decl_column(0x10)
    5356                    
    5357                    $C$DW$528       .dwtag  DW_TAG_member
    5358                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$132)
    5359                            .dwattr $C$DW$528, DW_AT_name("CCFG_ERASE_CONF")
    5360                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("CCFG_ERASE_CONF")
    5361                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5362                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    5363                            .dwattr $C$DW$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5364                            .dwattr $C$DW$528, DW_AT_decl_line(0x3e)
    5365                            .dwattr $C$DW$528, DW_AT_decl_column(0x10)
    5366                    
    5367                    $C$DW$529       .dwtag  DW_TAG_member
    5368                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$132)
    5369                            .dwattr $C$DW$529, DW_AT_name("CCFG_CCFG_TI_OPTIONS")
    5370                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("CCFG_CCFG_TI_OPTIONS")
    5371                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5372                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    5373                            .dwattr $C$DW$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5374                            .dwattr $C$DW$529, DW_AT_decl_line(0x3f)
    5375                            .dwattr $C$DW$529, DW_AT_decl_column(0x10)
    5376                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE   99

    5377                    $C$DW$530       .dwtag  DW_TAG_member
    5378                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$132)
    5379                            .dwattr $C$DW$530, DW_AT_name("CCFG_CCFG_TAP_DAP_0")
    5380                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("CCFG_CCFG_TAP_DAP_0")
    5381                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5382                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    5383                            .dwattr $C$DW$530, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5384                            .dwattr $C$DW$530, DW_AT_decl_line(0x40)
    5385                            .dwattr $C$DW$530, DW_AT_decl_column(0x10)
    5386                    
    5387                    $C$DW$531       .dwtag  DW_TAG_member
    5388                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$132)
    5389                            .dwattr $C$DW$531, DW_AT_name("CCFG_CCFG_TAP_DAP_1")
    5390                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("CCFG_CCFG_TAP_DAP_1")
    5391                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5392                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    5393                            .dwattr $C$DW$531, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5394                            .dwattr $C$DW$531, DW_AT_decl_line(0x41)
    5395                            .dwattr $C$DW$531, DW_AT_decl_column(0x10)
    5396                    
    5397                    $C$DW$532       .dwtag  DW_TAG_member
    5398                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$132)
    5399                            .dwattr $C$DW$532, DW_AT_name("CCFG_IMAGE_VALID_CONF")
    5400                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("CCFG_IMAGE_VALID_CONF")
    5401                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5402                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    5403                            .dwattr $C$DW$532, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5404                            .dwattr $C$DW$532, DW_AT_decl_line(0x42)
    5405                            .dwattr $C$DW$532, DW_AT_decl_column(0x10)
    5406                    
    5407                    $C$DW$533       .dwtag  DW_TAG_member
    5408                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$132)
    5409                            .dwattr $C$DW$533, DW_AT_name("CCFG_CCFG_PROT_31_0")
    5410                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("CCFG_CCFG_PROT_31_0")
    5411                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5412                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    5413                            .dwattr $C$DW$533, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5414                            .dwattr $C$DW$533, DW_AT_decl_line(0x43)
    5415                            .dwattr $C$DW$533, DW_AT_decl_column(0x10)
    5416                    
    5417                    $C$DW$534       .dwtag  DW_TAG_member
    5418                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$132)
    5419                            .dwattr $C$DW$534, DW_AT_name("CCFG_CCFG_PROT_63_32")
    5420                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("CCFG_CCFG_PROT_63_32")
    5421                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    5422                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    5423                            .dwattr $C$DW$534, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5424                            .dwattr $C$DW$534, DW_AT_decl_line(0x44)
    5425                            .dwattr $C$DW$534, DW_AT_decl_column(0x10)
    5426                    
    5427                    $C$DW$535       .dwtag  DW_TAG_member
    5428                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$132)
    5429                            .dwattr $C$DW$535, DW_AT_name("CCFG_CCFG_PROT_95_64")
    5430                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("CCFG_CCFG_PROT_95_64")
    5431                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  100

    5432                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    5433                            .dwattr $C$DW$535, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5434                            .dwattr $C$DW$535, DW_AT_decl_line(0x45)
    5435                            .dwattr $C$DW$535, DW_AT_decl_column(0x10)
    5436                    
    5437                    $C$DW$536       .dwtag  DW_TAG_member
    5438                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$132)
    5439                            .dwattr $C$DW$536, DW_AT_name("CCFG_CCFG_PROT_127_96")
    5440                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("CCFG_CCFG_PROT_127_96")
    5441                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    5442                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    5443                            .dwattr $C$DW$536, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5444                            .dwattr $C$DW$536, DW_AT_decl_line(0x46)
    5445                            .dwattr $C$DW$536, DW_AT_decl_column(0x10)
    5446                    
    5447                            .dwattr $C$DW$T$133, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    5448                            .dwattr $C$DW$T$133, DW_AT_decl_line(0x30)
    5449                            .dwattr $C$DW$T$133, DW_AT_decl_column(0x01)
    5450                            .dwendtag $C$DW$T$133
    5451                    
    5452                    $C$DW$T$1358    .dwtag  DW_TAG_typedef
    5453                            .dwattr $C$DW$T$1358, DW_AT_name("ccfg_t")
    5454                            .dwattr $C$DW$T$1358, DW_AT_type(*$C$DW$T$133)
    5455                            .dwattr $C$DW$T$1358, DW_AT_language(DW_LANG_C)
    5456                            .dwattr $C$DW$T$1358, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/device
    5457                            .dwattr $C$DW$T$1358, DW_AT_decl_line(0x47)
    5458                            .dwattr $C$DW$T$1358, DW_AT_decl_column(0x03)
    5459                    
    5460                    $C$DW$T$1359    .dwtag  DW_TAG_const_type
    5461                            .dwattr $C$DW$T$1359, DW_AT_type(*$C$DW$T$1358)
    5462                    
    5463                    
    5464                    $C$DW$T$138     .dwtag  DW_TAG_structure_type
    5465                            .dwattr $C$DW$T$138, DW_AT_byte_size(0x10)
    5466                    $C$DW$537       .dwtag  DW_TAG_member
    5467                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$135)
    5468                            .dwattr $C$DW$537, DW_AT_name("rfMode")
    5469                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("rfMode")
    5470                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5471                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    5472                            .dwattr $C$DW$537, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5473                            .dwattr $C$DW$537, DW_AT_decl_line(0x421)
    5474                            .dwattr $C$DW$537, DW_AT_decl_column(0x0d)
    5475                    
    5476                    $C$DW$538       .dwtag  DW_TAG_member
    5477                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$137)
    5478                            .dwattr $C$DW$538, DW_AT_name("cpePatchFxn")
    5479                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("cpePatchFxn")
    5480                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5481                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    5482                            .dwattr $C$DW$538, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5483                            .dwattr $C$DW$538, DW_AT_decl_line(0x422)
    5484                            .dwattr $C$DW$538, DW_AT_decl_column(0x0c)
    5485                    
    5486                    $C$DW$539       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  101

    5487                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$137)
    5488                            .dwattr $C$DW$539, DW_AT_name("mcePatchFxn")
    5489                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("mcePatchFxn")
    5490                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5491                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    5492                            .dwattr $C$DW$539, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5493                            .dwattr $C$DW$539, DW_AT_decl_line(0x423)
    5494                            .dwattr $C$DW$539, DW_AT_decl_column(0x0c)
    5495                    
    5496                    $C$DW$540       .dwtag  DW_TAG_member
    5497                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$137)
    5498                            .dwattr $C$DW$540, DW_AT_name("rfePatchFxn")
    5499                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("rfePatchFxn")
    5500                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5501                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    5502                            .dwattr $C$DW$540, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5503                            .dwattr $C$DW$540, DW_AT_decl_line(0x424)
    5504                            .dwattr $C$DW$540, DW_AT_decl_column(0x0c)
    5505                    
    5506                            .dwattr $C$DW$T$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    5507                            .dwattr $C$DW$T$138, DW_AT_decl_line(0x420)
    5508                            .dwattr $C$DW$T$138, DW_AT_decl_column(0x10)
    5509                            .dwendtag $C$DW$T$138
    5510                    
    5511                    $C$DW$T$149     .dwtag  DW_TAG_typedef
    5512                            .dwattr $C$DW$T$149, DW_AT_name("RF_Mode")
    5513                            .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$138)
    5514                            .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    5515                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    5516                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x425)
    5517                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x03)
    5518                    
    5519                    $C$DW$T$150     .dwtag  DW_TAG_pointer_type
    5520                            .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$149)
    5521                            .dwattr $C$DW$T$150, DW_AT_address_class(0x20)
    5522                    
    5523                    
    5524                    $C$DW$T$139     .dwtag  DW_TAG_structure_type
    5525                            .dwattr $C$DW$T$139, DW_AT_byte_size(0x04)
    5526                    $C$DW$541       .dwtag  DW_TAG_member
    5527                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$132)
    5528                            .dwattr $C$DW$541, DW_AT_name("rawValue")
    5529                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("rawValue")
    5530                            .dwattr $C$DW$541, DW_AT_bit_offset(0x0a)
    5531                            .dwattr $C$DW$541, DW_AT_bit_size(0x16)
    5532                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5533                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    5534                            .dwattr $C$DW$541, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5535                            .dwattr $C$DW$541, DW_AT_decl_line(0x3d6)
    5536                            .dwattr $C$DW$541, DW_AT_decl_column(0x0e)
    5537                    
    5538                    $C$DW$542       .dwtag  DW_TAG_member
    5539                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$132)
    5540                            .dwattr $C$DW$542, DW_AT_name("__dummy")
    5541                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("__dummy")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  102

    5542                            .dwattr $C$DW$542, DW_AT_bit_offset(0x01)
    5543                            .dwattr $C$DW$542, DW_AT_bit_size(0x09)
    5544                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5545                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    5546                            .dwattr $C$DW$542, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5547                            .dwattr $C$DW$542, DW_AT_decl_line(0x3da)
    5548                            .dwattr $C$DW$542, DW_AT_decl_column(0x0e)
    5549                    
    5550                    $C$DW$543       .dwtag  DW_TAG_member
    5551                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$132)
    5552                            .dwattr $C$DW$543, DW_AT_name("paType")
    5553                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("paType")
    5554                            .dwattr $C$DW$543, DW_AT_bit_offset(0x00)
    5555                            .dwattr $C$DW$543, DW_AT_bit_size(0x01)
    5556                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5557                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    5558                            .dwattr $C$DW$543, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5559                            .dwattr $C$DW$543, DW_AT_decl_line(0x3db)
    5560                            .dwattr $C$DW$543, DW_AT_decl_column(0x0e)
    5561                    
    5562                            .dwattr $C$DW$T$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    5563                            .dwattr $C$DW$T$139, DW_AT_decl_line(0x3d5)
    5564                            .dwattr $C$DW$T$139, DW_AT_decl_column(0x10)
    5565                            .dwendtag $C$DW$T$139
    5566                    
    5567                    $C$DW$T$142     .dwtag  DW_TAG_typedef
    5568                            .dwattr $C$DW$T$142, DW_AT_name("RF_TxPowerTable_Value")
    5569                            .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$139)
    5570                            .dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
    5571                            .dwattr $C$DW$T$142, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    5572                            .dwattr $C$DW$T$142, DW_AT_decl_line(0x3df)
    5573                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x03)
    5574                    
    5575                    
    5576                    $C$DW$T$143     .dwtag  DW_TAG_structure_type
    5577                            .dwattr $C$DW$T$143, DW_AT_byte_size(0x05)
    5578                    $C$DW$544       .dwtag  DW_TAG_member
    5579                            .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$141)
    5580                            .dwattr $C$DW$544, DW_AT_name("power")
    5581                            .dwattr $C$DW$544, DW_AT_TI_symbol_name("power")
    5582                            .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5583                            .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    5584                            .dwattr $C$DW$544, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5585                            .dwattr $C$DW$544, DW_AT_decl_line(0x3f5)
    5586                            .dwattr $C$DW$544, DW_AT_decl_column(0x0c)
    5587                    
    5588                    $C$DW$545       .dwtag  DW_TAG_member
    5589                            .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$142)
    5590                            .dwattr $C$DW$545, DW_AT_name("value")
    5591                            .dwattr $C$DW$545, DW_AT_TI_symbol_name("value")
    5592                            .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5593                            .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    5594                            .dwattr $C$DW$545, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5595                            .dwattr $C$DW$545, DW_AT_decl_line(0x3f8)
    5596                            .dwattr $C$DW$545, DW_AT_decl_column(0x1b)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  103

    5597                    
    5598                            .dwattr $C$DW$T$143, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    5599                            .dwattr $C$DW$T$143, DW_AT_decl_line(0x3f4)
    5600                            .dwattr $C$DW$T$143, DW_AT_decl_column(0x01)
    5601                            .dwendtag $C$DW$T$143
    5602                    
    5603                    $C$DW$T$144     .dwtag  DW_TAG_typedef
    5604                            .dwattr $C$DW$T$144, DW_AT_name("RF_TxPowerTable_Entry")
    5605                            .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$143)
    5606                            .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    5607                            .dwattr $C$DW$T$144, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    5608                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x3f9)
    5609                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x1b)
    5610                    
    5611                    $C$DW$T$145     .dwtag  DW_TAG_const_type
    5612                            .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$144)
    5613                    
    5614                    $C$DW$T$146     .dwtag  DW_TAG_typedef
    5615                            .dwattr $C$DW$T$146, DW_AT_name("macTxPwrVal_t")
    5616                            .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$145)
    5617                            .dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
    5618                            .dwattr $C$DW$T$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    5619                            .dwattr $C$DW$T$146, DW_AT_decl_line(0x144)
    5620                            .dwattr $C$DW$T$146, DW_AT_decl_column(0x25)
    5621                    
    5622                    $C$DW$T$147     .dwtag  DW_TAG_pointer_type
    5623                            .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$146)
    5624                            .dwattr $C$DW$T$147, DW_AT_address_class(0x20)
    5625                    
    5626                    
    5627                    $C$DW$T$148     .dwtag  DW_TAG_structure_type
    5628                            .dwattr $C$DW$T$148, DW_AT_byte_size(0x04)
    5629                    $C$DW$546       .dwtag  DW_TAG_member
    5630                            .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$147)
    5631                            .dwattr $C$DW$546, DW_AT_name("pTxPwrVals")
    5632                            .dwattr $C$DW$546, DW_AT_TI_symbol_name("pTxPwrVals")
    5633                            .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5634                            .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    5635                            .dwattr $C$DW$546, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5636                            .dwattr $C$DW$546, DW_AT_decl_line(0x148)
    5637                            .dwattr $C$DW$546, DW_AT_decl_column(0x12)
    5638                    
    5639                            .dwattr $C$DW$T$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    5640                            .dwattr $C$DW$T$148, DW_AT_decl_line(0x147)
    5641                            .dwattr $C$DW$T$148, DW_AT_decl_column(0x01)
    5642                            .dwendtag $C$DW$T$148
    5643                    
    5644                    $C$DW$T$152     .dwtag  DW_TAG_const_type
    5645                            .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$148)
    5646                    
    5647                    $C$DW$T$153     .dwtag  DW_TAG_typedef
    5648                            .dwattr $C$DW$T$153, DW_AT_name("macTxPwrTbl_t")
    5649                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$152)
    5650                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    5651                            .dwattr $C$DW$T$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  104

    5652                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x149)
    5653                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x03)
    5654                    
    5655                    $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    5656                            .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$153)
    5657                            .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
    5658                    
    5659                    
    5660                    $C$DW$T$1360    .dwtag  DW_TAG_array_type
    5661                            .dwattr $C$DW$T$1360, DW_AT_type(*$C$DW$T$153)
    5662                            .dwattr $C$DW$T$1360, DW_AT_language(DW_LANG_C)
    5663                    $C$DW$547       .dwtag  DW_TAG_subrange_type
    5664                    
    5665                            .dwendtag $C$DW$T$1360
    5666                    
    5667                    
    5668                    $C$DW$T$165     .dwtag  DW_TAG_structure_type
    5669                            .dwattr $C$DW$T$165, DW_AT_byte_size(0x30)
    5670                    $C$DW$548       .dwtag  DW_TAG_member
    5671                            .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$132)
    5672                            .dwattr $C$DW$548, DW_AT_name("getHwRevision")
    5673                            .dwattr $C$DW$548, DW_AT_TI_symbol_name("getHwRevision")
    5674                            .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5675                            .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    5676                            .dwattr $C$DW$548, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5677                            .dwattr $C$DW$548, DW_AT_decl_line(0x155)
    5678                            .dwattr $C$DW$548, DW_AT_decl_column(0x1c)
    5679                    
    5680                    $C$DW$549       .dwtag  DW_TAG_member
    5681                            .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$150)
    5682                            .dwattr $C$DW$549, DW_AT_name("pRfPatchTable")
    5683                            .dwattr $C$DW$549, DW_AT_TI_symbol_name("pRfPatchTable")
    5684                            .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5685                            .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    5686                            .dwattr $C$DW$549, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5687                            .dwattr $C$DW$549, DW_AT_decl_line(0x156)
    5688                            .dwattr $C$DW$549, DW_AT_decl_column(0x1d)
    5689                    
    5690                    $C$DW$550       .dwtag  DW_TAG_member
    5691                            .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$151)
    5692                            .dwattr $C$DW$550, DW_AT_name("pRfDrvTblPtr")
    5693                            .dwattr $C$DW$550, DW_AT_TI_symbol_name("pRfDrvTblPtr")
    5694                            .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5695                            .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    5696                            .dwattr $C$DW$550, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5697                            .dwattr $C$DW$550, DW_AT_decl_line(0x157)
    5698                            .dwattr $C$DW$550, DW_AT_decl_column(0x1d)
    5699                    
    5700                    $C$DW$551       .dwtag  DW_TAG_member
    5701                            .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$151)
    5702                            .dwattr $C$DW$551, DW_AT_name("pCryptoDrvTblPtr")
    5703                            .dwattr $C$DW$551, DW_AT_TI_symbol_name("pCryptoDrvTblPtr")
    5704                            .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5705                            .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    5706                            .dwattr $C$DW$551, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  105

    5707                            .dwattr $C$DW$551, DW_AT_decl_line(0x158)
    5708                            .dwattr $C$DW$551, DW_AT_decl_column(0x1d)
    5709                    
    5710                    $C$DW$552       .dwtag  DW_TAG_member
    5711                            .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$154)
    5712                            .dwattr $C$DW$552, DW_AT_name("pTxPwrTbl")
    5713                            .dwattr $C$DW$552, DW_AT_TI_symbol_name("pTxPwrTbl")
    5714                            .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5715                            .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    5716                            .dwattr $C$DW$552, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5717                            .dwattr $C$DW$552, DW_AT_decl_line(0x159)
    5718                            .dwattr $C$DW$552, DW_AT_decl_column(0x20)
    5719                    
    5720                    $C$DW$553       .dwtag  DW_TAG_member
    5721                            .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$155)
    5722                            .dwattr $C$DW$553, DW_AT_name("pOverrides")
    5723                            .dwattr $C$DW$553, DW_AT_TI_symbol_name("pOverrides")
    5724                            .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5725                            .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    5726                            .dwattr $C$DW$553, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5727                            .dwattr $C$DW$553, DW_AT_decl_line(0x15a)
    5728                            .dwattr $C$DW$553, DW_AT_decl_column(0x1e)
    5729                    
    5730                    $C$DW$554       .dwtag  DW_TAG_member
    5731                            .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$156)
    5732                            .dwattr $C$DW$554, DW_AT_name("pLoDivider")
    5733                            .dwattr $C$DW$554, DW_AT_TI_symbol_name("pLoDivider")
    5734                            .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5735                            .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    5736                            .dwattr $C$DW$554, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5737                            .dwattr $C$DW$554, DW_AT_decl_line(0x15b)
    5738                            .dwattr $C$DW$554, DW_AT_decl_column(0x1d)
    5739                    
    5740                    $C$DW$555       .dwtag  DW_TAG_member
    5741                            .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$135)
    5742                            .dwattr $C$DW$555, DW_AT_name("rfFeModeBias")
    5743                            .dwattr $C$DW$555, DW_AT_TI_symbol_name("rfFeModeBias")
    5744                            .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5745                            .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    5746                            .dwattr $C$DW$555, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5747                            .dwattr $C$DW$555, DW_AT_decl_line(0x15c)
    5748                            .dwattr $C$DW$555, DW_AT_decl_column(0x1c)
    5749                    
    5750                    $C$DW$556       .dwtag  DW_TAG_member
    5751                            .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$135)
    5752                            .dwattr $C$DW$556, DW_AT_name("phyId")
    5753                            .dwattr $C$DW$556, DW_AT_TI_symbol_name("phyId")
    5754                            .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5755                            .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    5756                            .dwattr $C$DW$556, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5757                            .dwattr $C$DW$556, DW_AT_decl_line(0x15d)
    5758                            .dwattr $C$DW$556, DW_AT_decl_column(0x1c)
    5759                    
    5760                    $C$DW$557       .dwtag  DW_TAG_member
    5761                            .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$135)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  106

    5762                            .dwattr $C$DW$557, DW_AT_name("last")
    5763                            .dwattr $C$DW$557, DW_AT_TI_symbol_name("last")
    5764                            .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5765                            .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    5766                            .dwattr $C$DW$557, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5767                            .dwattr $C$DW$557, DW_AT_decl_line(0x15e)
    5768                            .dwattr $C$DW$557, DW_AT_decl_column(0x1c)
    5769                    
    5770                    $C$DW$558       .dwtag  DW_TAG_member
    5771                            .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$159)
    5772                            .dwattr $C$DW$558, DW_AT_name("pSetRE")
    5773                            .dwattr $C$DW$558, DW_AT_TI_symbol_name("pSetRE")
    5774                            .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5775                            .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    5776                            .dwattr $C$DW$558, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5777                            .dwattr $C$DW$558, DW_AT_decl_line(0x15f)
    5778                            .dwattr $C$DW$558, DW_AT_decl_column(0x1c)
    5779                    
    5780                    $C$DW$559       .dwtag  DW_TAG_member
    5781                            .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$160)
    5782                            .dwattr $C$DW$559, DW_AT_name("pAssertFP")
    5783                            .dwattr $C$DW$559, DW_AT_TI_symbol_name("pAssertFP")
    5784                            .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5785                            .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    5786                            .dwattr $C$DW$559, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5787                            .dwattr $C$DW$559, DW_AT_decl_line(0x160)
    5788                            .dwattr $C$DW$559, DW_AT_decl_column(0x1c)
    5789                    
    5790                    $C$DW$560       .dwtag  DW_TAG_member
    5791                            .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$163)
    5792                            .dwattr $C$DW$560, DW_AT_name("pAntSwitchFP")
    5793                            .dwattr $C$DW$560, DW_AT_TI_symbol_name("pAntSwitchFP")
    5794                            .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5795                            .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    5796                            .dwattr $C$DW$560, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5797                            .dwattr $C$DW$560, DW_AT_decl_line(0x161)
    5798                            .dwattr $C$DW$560, DW_AT_decl_column(0x1c)
    5799                    
    5800                    $C$DW$561       .dwtag  DW_TAG_member
    5801                            .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$164)
    5802                            .dwattr $C$DW$561, DW_AT_name("pAntPwrFP")
    5803                            .dwattr $C$DW$561, DW_AT_TI_symbol_name("pAntPwrFP")
    5804                            .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5805                            .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    5806                            .dwattr $C$DW$561, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5807                            .dwattr $C$DW$561, DW_AT_decl_line(0x162)
    5808                            .dwattr $C$DW$561, DW_AT_decl_column(0x1c)
    5809                    
    5810                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    5811                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x154)
    5812                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x01)
    5813                            .dwendtag $C$DW$T$165
    5814                    
    5815                    
    5816                    $C$DW$T$494     .dwtag  DW_TAG_array_type
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  107

    5817                            .dwattr $C$DW$T$494, DW_AT_type(*$C$DW$T$165)
    5818                            .dwattr $C$DW$T$494, DW_AT_language(DW_LANG_C)
    5819                            .dwattr $C$DW$T$494, DW_AT_byte_size(0x180)
    5820                    $C$DW$562       .dwtag  DW_TAG_subrange_type
    5821                            .dwattr $C$DW$562, DW_AT_upper_bound(0x07)
    5822                    
    5823                            .dwendtag $C$DW$T$494
    5824                    
    5825                    $C$DW$T$171     .dwtag  DW_TAG_typedef
    5826                            .dwattr $C$DW$T$171, DW_AT_name("macUserCfg_t")
    5827                            .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$165)
    5828                            .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    5829                            .dwattr $C$DW$T$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    5830                            .dwattr $C$DW$T$171, DW_AT_decl_line(0x163)
    5831                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x03)
    5832                    
    5833                    
    5834                    $C$DW$T$1363    .dwtag  DW_TAG_array_type
    5835                            .dwattr $C$DW$T$1363, DW_AT_type(*$C$DW$T$171)
    5836                            .dwattr $C$DW$T$1363, DW_AT_language(DW_LANG_C)
    5837                            .dwattr $C$DW$T$1363, DW_AT_byte_size(0x180)
    5838                    $C$DW$563       .dwtag  DW_TAG_subrange_type
    5839                            .dwattr $C$DW$563, DW_AT_upper_bound(0x07)
    5840                    
    5841                            .dwendtag $C$DW$T$1363
    5842                    
    5843                    
    5844                    $C$DW$T$172     .dwtag  DW_TAG_structure_type
    5845                            .dwattr $C$DW$T$172, DW_AT_byte_size(0x5c)
    5846                    $C$DW$564       .dwtag  DW_TAG_member
    5847                            .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$166)
    5848                            .dwattr $C$DW$564, DW_AT_name("extendedAddress")
    5849                            .dwattr $C$DW$564, DW_AT_TI_symbol_name("extendedAddress")
    5850                            .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5851                            .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    5852                            .dwattr $C$DW$564, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5853                            .dwattr $C$DW$564, DW_AT_decl_line(0x47)
    5854                            .dwattr $C$DW$564, DW_AT_decl_column(0x0d)
    5855                    
    5856                    $C$DW$565       .dwtag  DW_TAG_member
    5857                            .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$167)
    5858                            .dwattr $C$DW$565, DW_AT_name("nvFps")
    5859                            .dwattr $C$DW$565, DW_AT_TI_symbol_name("nvFps")
    5860                            .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5861                            .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    5862                            .dwattr $C$DW$565, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5863                            .dwattr $C$DW$565, DW_AT_decl_line(0x4a)
    5864                            .dwattr $C$DW$565, DW_AT_decl_column(0x17)
    5865                    
    5866                    $C$DW$566       .dwtag  DW_TAG_member
    5867                            .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$170)
    5868                            .dwattr $C$DW$566, DW_AT_name("applicationEntityID")
    5869                            .dwattr $C$DW$566, DW_AT_TI_symbol_name("applicationEntityID")
    5870                            .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5871                            .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  108

    5872                            .dwattr $C$DW$566, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5873                            .dwattr $C$DW$566, DW_AT_decl_line(0x4d)
    5874                            .dwattr $C$DW$566, DW_AT_decl_column(0x14)
    5875                    
    5876                    $C$DW$567       .dwtag  DW_TAG_member
    5877                            .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$135)
    5878                            .dwattr $C$DW$567, DW_AT_name("initFail")
    5879                            .dwattr $C$DW$567, DW_AT_TI_symbol_name("initFail")
    5880                            .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    5881                            .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    5882                            .dwattr $C$DW$567, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5883                            .dwattr $C$DW$567, DW_AT_decl_line(0x50)
    5884                            .dwattr $C$DW$567, DW_AT_decl_column(0x0d)
    5885                    
    5886                    $C$DW$568       .dwtag  DW_TAG_member
    5887                            .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$171)
    5888                            .dwattr $C$DW$568, DW_AT_name("macConfig")
    5889                            .dwattr $C$DW$568, DW_AT_TI_symbol_name("macConfig")
    5890                            .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5891                            .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    5892                            .dwattr $C$DW$568, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5893                            .dwattr $C$DW$568, DW_AT_decl_line(0x53)
    5894                            .dwattr $C$DW$568, DW_AT_decl_column(0x12)
    5895                    
    5896                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    5897                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x45)
    5898                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x01)
    5899                            .dwendtag $C$DW$T$172
    5900                    
    5901                    $C$DW$T$1365    .dwtag  DW_TAG_typedef
    5902                            .dwattr $C$DW$T$1365, DW_AT_name("mac_Config_t")
    5903                            .dwattr $C$DW$T$1365, DW_AT_type(*$C$DW$T$172)
    5904                            .dwattr $C$DW$T$1365, DW_AT_language(DW_LANG_C)
    5905                            .dwattr $C$DW$T$1365, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    5906                            .dwattr $C$DW$T$1365, DW_AT_decl_line(0x55)
    5907                            .dwattr $C$DW$T$1365, DW_AT_decl_column(0x03)
    5908                    
    5909                    
    5910                    $C$DW$T$173     .dwtag  DW_TAG_structure_type
    5911                            .dwattr $C$DW$T$173, DW_AT_byte_size(0x10)
    5912                    $C$DW$569       .dwtag  DW_TAG_member
    5913                            .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$14)
    5914                            .dwattr $C$DW$569, DW_AT_name("__max_align1")
    5915                            .dwattr $C$DW$569, DW_AT_TI_symbol_name("__max_align1")
    5916                            .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5917                            .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    5918                            .dwattr $C$DW$569, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    5919                            .dwattr $C$DW$569, DW_AT_decl_line(0x70)
    5920                            .dwattr $C$DW$569, DW_AT_decl_column(0x0c)
    5921                    
    5922                    $C$DW$570       .dwtag  DW_TAG_member
    5923                            .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$18)
    5924                            .dwattr $C$DW$570, DW_AT_name("__max_align2")
    5925                            .dwattr $C$DW$570, DW_AT_TI_symbol_name("__max_align2")
    5926                            .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  109

    5927                            .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    5928                            .dwattr $C$DW$570, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    5929                            .dwattr $C$DW$570, DW_AT_decl_line(0x71)
    5930                            .dwattr $C$DW$570, DW_AT_decl_column(0x0e)
    5931                    
    5932                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    5933                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x6f)
    5934                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x10)
    5935                            .dwendtag $C$DW$T$173
    5936                    
    5937                    $C$DW$T$1366    .dwtag  DW_TAG_typedef
    5938                            .dwattr $C$DW$T$1366, DW_AT_name("__max_align_t")
    5939                            .dwattr $C$DW$T$1366, DW_AT_type(*$C$DW$T$173)
    5940                            .dwattr $C$DW$T$1366, DW_AT_language(DW_LANG_C)
    5941                            .dwattr $C$DW$T$1366, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    5942                            .dwattr $C$DW$T$1366, DW_AT_decl_line(0x72)
    5943                            .dwattr $C$DW$T$1366, DW_AT_decl_column(0x03)
    5944                    
    5945                    
    5946                    $C$DW$T$176     .dwtag  DW_TAG_structure_type
    5947                            .dwattr $C$DW$T$176, DW_AT_byte_size(0x08)
    5948                    $C$DW$571       .dwtag  DW_TAG_member
    5949                            .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$10)
    5950                            .dwattr $C$DW$571, DW_AT_name("length")
    5951                            .dwattr $C$DW$571, DW_AT_TI_symbol_name("length")
    5952                            .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5953                            .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    5954                            .dwattr $C$DW$571, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    5955                            .dwattr $C$DW$571, DW_AT_decl_line(0x165)
    5956                            .dwattr $C$DW$571, DW_AT_decl_column(0x16)
    5957                    
    5958                    $C$DW$572       .dwtag  DW_TAG_member
    5959                            .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$175)
    5960                            .dwattr $C$DW$572, DW_AT_name("elem")
    5961                            .dwattr $C$DW$572, DW_AT_TI_symbol_name("elem")
    5962                            .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5963                            .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    5964                            .dwattr $C$DW$572, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    5965                            .dwattr $C$DW$572, DW_AT_decl_line(0x165)
    5966                            .dwattr $C$DW$572, DW_AT_decl_column(0x3a)
    5967                    
    5968                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    5969                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x165)
    5970                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x10)
    5971                            .dwendtag $C$DW$T$176
    5972                    
    5973                    $C$DW$T$1367    .dwtag  DW_TAG_typedef
    5974                            .dwattr $C$DW$T$1367, DW_AT_name("ARRAY1_ti_sysbios_knl_Swi_hooks")
    5975                            .dwattr $C$DW$T$1367, DW_AT_type(*$C$DW$T$176)
    5976                            .dwattr $C$DW$T$1367, DW_AT_language(DW_LANG_C)
    5977                            .dwattr $C$DW$T$1367, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pa
    5978                            .dwattr $C$DW$T$1367, DW_AT_decl_line(0x165)
    5979                            .dwattr $C$DW$T$1367, DW_AT_decl_column(0x42)
    5980                    
    5981                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  110

    5982                    $C$DW$T$179     .dwtag  DW_TAG_structure_type
    5983                            .dwattr $C$DW$T$179, DW_AT_byte_size(0x08)
    5984                    $C$DW$573       .dwtag  DW_TAG_member
    5985                            .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$10)
    5986                            .dwattr $C$DW$573, DW_AT_name("length")
    5987                            .dwattr $C$DW$573, DW_AT_TI_symbol_name("length")
    5988                            .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5989                            .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    5990                            .dwattr $C$DW$573, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    5991                            .dwattr $C$DW$573, DW_AT_decl_line(0x166)
    5992                            .dwattr $C$DW$573, DW_AT_decl_column(0x16)
    5993                    
    5994                    $C$DW$574       .dwtag  DW_TAG_member
    5995                            .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$178)
    5996                            .dwattr $C$DW$574, DW_AT_name("elem")
    5997                            .dwattr $C$DW$574, DW_AT_TI_symbol_name("elem")
    5998                            .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5999                            .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    6000                            .dwattr $C$DW$574, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6001                            .dwattr $C$DW$574, DW_AT_decl_line(0x166)
    6002                            .dwattr $C$DW$574, DW_AT_decl_column(0x40)
    6003                    
    6004                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6005                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x166)
    6006                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x10)
    6007                            .dwendtag $C$DW$T$179
    6008                    
    6009                    $C$DW$T$1368    .dwtag  DW_TAG_typedef
    6010                            .dwattr $C$DW$T$1368, DW_AT_name("CARRAY1_ti_sysbios_knl_Swi_hooks")
    6011                            .dwattr $C$DW$T$1368, DW_AT_type(*$C$DW$T$179)
    6012                            .dwattr $C$DW$T$1368, DW_AT_language(DW_LANG_C)
    6013                            .dwattr $C$DW$T$1368, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pa
    6014                            .dwattr $C$DW$T$1368, DW_AT_decl_line(0x166)
    6015                            .dwattr $C$DW$T$1368, DW_AT_decl_column(0x48)
    6016                    
    6017                    $C$DW$T$1369    .dwtag  DW_TAG_typedef
    6018                            .dwattr $C$DW$T$1369, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    6019                            .dwattr $C$DW$T$1369, DW_AT_type(*$C$DW$T$1368)
    6020                            .dwattr $C$DW$T$1369, DW_AT_language(DW_LANG_C)
    6021                            .dwattr $C$DW$T$1369, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pa
    6022                            .dwattr $C$DW$T$1369, DW_AT_decl_line(0x168)
    6023                            .dwattr $C$DW$T$1369, DW_AT_decl_column(0x2a)
    6024                    
    6025                    $C$DW$T$1370    .dwtag  DW_TAG_typedef
    6026                            .dwattr $C$DW$T$1370, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    6027                            .dwattr $C$DW$T$1370, DW_AT_type(*$C$DW$T$1368)
    6028                            .dwattr $C$DW$T$1370, DW_AT_language(DW_LANG_C)
    6029                            .dwattr $C$DW$T$1370, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pa
    6030                            .dwattr $C$DW$T$1370, DW_AT_decl_line(0x167)
    6031                            .dwattr $C$DW$T$1370, DW_AT_decl_column(0x2a)
    6032                    
    6033                    
    6034                    $C$DW$T$182     .dwtag  DW_TAG_structure_type
    6035                            .dwattr $C$DW$T$182, DW_AT_byte_size(0x08)
    6036                    $C$DW$575       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  111

    6037                            .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$10)
    6038                            .dwattr $C$DW$575, DW_AT_name("length")
    6039                            .dwattr $C$DW$575, DW_AT_TI_symbol_name("length")
    6040                            .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6041                            .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    6042                            .dwattr $C$DW$575, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6043                            .dwattr $C$DW$575, DW_AT_decl_line(0x29b)
    6044                            .dwattr $C$DW$575, DW_AT_decl_column(0x16)
    6045                    
    6046                    $C$DW$576       .dwtag  DW_TAG_member
    6047                            .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$181)
    6048                            .dwattr $C$DW$576, DW_AT_name("elem")
    6049                            .dwattr $C$DW$576, DW_AT_TI_symbol_name("elem")
    6050                            .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6051                            .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    6052                            .dwattr $C$DW$576, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6053                            .dwattr $C$DW$576, DW_AT_decl_line(0x29b)
    6054                            .dwattr $C$DW$576, DW_AT_decl_column(0x3b)
    6055                    
    6056                            .dwattr $C$DW$T$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6057                            .dwattr $C$DW$T$182, DW_AT_decl_line(0x29b)
    6058                            .dwattr $C$DW$T$182, DW_AT_decl_column(0x10)
    6059                            .dwendtag $C$DW$T$182
    6060                    
    6061                    $C$DW$T$1371    .dwtag  DW_TAG_typedef
    6062                            .dwattr $C$DW$T$1371, DW_AT_name("ARRAY1_ti_sysbios_knl_Task_hooks")
    6063                            .dwattr $C$DW$T$1371, DW_AT_type(*$C$DW$T$182)
    6064                            .dwattr $C$DW$T$1371, DW_AT_language(DW_LANG_C)
    6065                            .dwattr $C$DW$T$1371, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pa
    6066                            .dwattr $C$DW$T$1371, DW_AT_decl_line(0x29b)
    6067                            .dwattr $C$DW$T$1371, DW_AT_decl_column(0x43)
    6068                    
    6069                    
    6070                    $C$DW$T$185     .dwtag  DW_TAG_structure_type
    6071                            .dwattr $C$DW$T$185, DW_AT_byte_size(0x08)
    6072                    $C$DW$577       .dwtag  DW_TAG_member
    6073                            .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$10)
    6074                            .dwattr $C$DW$577, DW_AT_name("length")
    6075                            .dwattr $C$DW$577, DW_AT_TI_symbol_name("length")
    6076                            .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6077                            .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    6078                            .dwattr $C$DW$577, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6079                            .dwattr $C$DW$577, DW_AT_decl_line(0x29c)
    6080                            .dwattr $C$DW$577, DW_AT_decl_column(0x16)
    6081                    
    6082                    $C$DW$578       .dwtag  DW_TAG_member
    6083                            .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$184)
    6084                            .dwattr $C$DW$578, DW_AT_name("elem")
    6085                            .dwattr $C$DW$578, DW_AT_TI_symbol_name("elem")
    6086                            .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6087                            .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    6088                            .dwattr $C$DW$578, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6089                            .dwattr $C$DW$578, DW_AT_decl_line(0x29c)
    6090                            .dwattr $C$DW$578, DW_AT_decl_column(0x41)
    6091                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  112

    6092                            .dwattr $C$DW$T$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6093                            .dwattr $C$DW$T$185, DW_AT_decl_line(0x29c)
    6094                            .dwattr $C$DW$T$185, DW_AT_decl_column(0x10)
    6095                            .dwendtag $C$DW$T$185
    6096                    
    6097                    $C$DW$T$1372    .dwtag  DW_TAG_typedef
    6098                            .dwattr $C$DW$T$1372, DW_AT_name("CARRAY1_ti_sysbios_knl_Task_hooks")
    6099                            .dwattr $C$DW$T$1372, DW_AT_type(*$C$DW$T$185)
    6100                            .dwattr $C$DW$T$1372, DW_AT_language(DW_LANG_C)
    6101                            .dwattr $C$DW$T$1372, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pa
    6102                            .dwattr $C$DW$T$1372, DW_AT_decl_line(0x29c)
    6103                            .dwattr $C$DW$T$1372, DW_AT_decl_column(0x49)
    6104                    
    6105                    $C$DW$T$1373    .dwtag  DW_TAG_typedef
    6106                            .dwattr $C$DW$T$1373, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
    6107                            .dwattr $C$DW$T$1373, DW_AT_type(*$C$DW$T$1372)
    6108                            .dwattr $C$DW$T$1373, DW_AT_language(DW_LANG_C)
    6109                            .dwattr $C$DW$T$1373, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pa
    6110                            .dwattr $C$DW$T$1373, DW_AT_decl_line(0x29e)
    6111                            .dwattr $C$DW$T$1373, DW_AT_decl_column(0x2b)
    6112                    
    6113                    $C$DW$T$1374    .dwtag  DW_TAG_typedef
    6114                            .dwattr $C$DW$T$1374, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
    6115                            .dwattr $C$DW$T$1374, DW_AT_type(*$C$DW$T$1372)
    6116                            .dwattr $C$DW$T$1374, DW_AT_language(DW_LANG_C)
    6117                            .dwattr $C$DW$T$1374, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pa
    6118                            .dwattr $C$DW$T$1374, DW_AT_decl_line(0x29d)
    6119                            .dwattr $C$DW$T$1374, DW_AT_decl_column(0x2b)
    6120                    
    6121                    
    6122                    $C$DW$T$186     .dwtag  DW_TAG_structure_type
    6123                            .dwattr $C$DW$T$186, DW_AT_byte_size(0x08)
    6124                    $C$DW$579       .dwtag  DW_TAG_member
    6125                            .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$10)
    6126                            .dwattr $C$DW$579, DW_AT_name("quot")
    6127                            .dwattr $C$DW$579, DW_AT_TI_symbol_name("quot")
    6128                            .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6129                            .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    6130                            .dwattr $C$DW$579, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    6131                            .dwattr $C$DW$579, DW_AT_decl_line(0x49)
    6132                            .dwattr $C$DW$579, DW_AT_decl_column(0x16)
    6133                    
    6134                    $C$DW$580       .dwtag  DW_TAG_member
    6135                            .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$10)
    6136                            .dwattr $C$DW$580, DW_AT_name("rem")
    6137                            .dwattr $C$DW$580, DW_AT_TI_symbol_name("rem")
    6138                            .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6139                            .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    6140                            .dwattr $C$DW$580, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    6141                            .dwattr $C$DW$580, DW_AT_decl_line(0x49)
    6142                            .dwattr $C$DW$580, DW_AT_decl_column(0x1c)
    6143                    
    6144                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    6145                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x49)
    6146                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x10)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  113

    6147                            .dwendtag $C$DW$T$186
    6148                    
    6149                    $C$DW$T$1375    .dwtag  DW_TAG_typedef
    6150                            .dwattr $C$DW$T$1375, DW_AT_name("div_t")
    6151                            .dwattr $C$DW$T$1375, DW_AT_type(*$C$DW$T$186)
    6152                            .dwattr $C$DW$T$1375, DW_AT_language(DW_LANG_C)
    6153                            .dwattr $C$DW$T$1375, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    6154                            .dwattr $C$DW$T$1375, DW_AT_decl_line(0x49)
    6155                            .dwattr $C$DW$T$1375, DW_AT_decl_column(0x23)
    6156                    
    6157                    
    6158                    $C$DW$T$187     .dwtag  DW_TAG_structure_type
    6159                            .dwattr $C$DW$T$187, DW_AT_byte_size(0x08)
    6160                    $C$DW$581       .dwtag  DW_TAG_member
    6161                            .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$10)
    6162                            .dwattr $C$DW$581, DW_AT_name("quot")
    6163                            .dwattr $C$DW$581, DW_AT_TI_symbol_name("quot")
    6164                            .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6165                            .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    6166                            .dwattr $C$DW$581, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    6167                            .dwattr $C$DW$581, DW_AT_decl_line(0x4e)
    6168                            .dwattr $C$DW$581, DW_AT_decl_column(0x16)
    6169                    
    6170                    $C$DW$582       .dwtag  DW_TAG_member
    6171                            .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$10)
    6172                            .dwattr $C$DW$582, DW_AT_name("rem")
    6173                            .dwattr $C$DW$582, DW_AT_TI_symbol_name("rem")
    6174                            .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6175                            .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    6176                            .dwattr $C$DW$582, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    6177                            .dwattr $C$DW$582, DW_AT_decl_line(0x4e)
    6178                            .dwattr $C$DW$582, DW_AT_decl_column(0x1c)
    6179                    
    6180                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    6181                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x4e)
    6182                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x10)
    6183                            .dwendtag $C$DW$T$187
    6184                    
    6185                    $C$DW$T$1376    .dwtag  DW_TAG_typedef
    6186                            .dwattr $C$DW$T$1376, DW_AT_name("ldiv_t")
    6187                            .dwattr $C$DW$T$1376, DW_AT_type(*$C$DW$T$187)
    6188                            .dwattr $C$DW$T$1376, DW_AT_language(DW_LANG_C)
    6189                            .dwattr $C$DW$T$1376, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    6190                            .dwattr $C$DW$T$1376, DW_AT_decl_line(0x4e)
    6191                            .dwattr $C$DW$T$1376, DW_AT_decl_column(0x23)
    6192                    
    6193                    
    6194                    $C$DW$T$188     .dwtag  DW_TAG_structure_type
    6195                            .dwattr $C$DW$T$188, DW_AT_byte_size(0x10)
    6196                    $C$DW$583       .dwtag  DW_TAG_member
    6197                            .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$14)
    6198                            .dwattr $C$DW$583, DW_AT_name("quot")
    6199                            .dwattr $C$DW$583, DW_AT_TI_symbol_name("quot")
    6200                            .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6201                            .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  114

    6202                            .dwattr $C$DW$583, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    6203                            .dwattr $C$DW$583, DW_AT_decl_line(0x56)
    6204                            .dwattr $C$DW$583, DW_AT_decl_column(0x1c)
    6205                    
    6206                    $C$DW$584       .dwtag  DW_TAG_member
    6207                            .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$14)
    6208                            .dwattr $C$DW$584, DW_AT_name("rem")
    6209                            .dwattr $C$DW$584, DW_AT_TI_symbol_name("rem")
    6210                            .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6211                            .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    6212                            .dwattr $C$DW$584, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    6213                            .dwattr $C$DW$584, DW_AT_decl_line(0x56)
    6214                            .dwattr $C$DW$584, DW_AT_decl_column(0x22)
    6215                    
    6216                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    6217                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x56)
    6218                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x10)
    6219                            .dwendtag $C$DW$T$188
    6220                    
    6221                    $C$DW$T$1377    .dwtag  DW_TAG_typedef
    6222                            .dwattr $C$DW$T$1377, DW_AT_name("lldiv_t")
    6223                            .dwattr $C$DW$T$1377, DW_AT_type(*$C$DW$T$188)
    6224                            .dwattr $C$DW$T$1377, DW_AT_language(DW_LANG_C)
    6225                            .dwattr $C$DW$T$1377, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    6226                            .dwattr $C$DW$T$1377, DW_AT_decl_line(0x56)
    6227                            .dwattr $C$DW$T$1377, DW_AT_decl_column(0x29)
    6228                    
    6229                    
    6230                    $C$DW$T$193     .dwtag  DW_TAG_structure_type
    6231                            .dwattr $C$DW$T$193, DW_AT_byte_size(0x08)
    6232                    $C$DW$585       .dwtag  DW_TAG_member
    6233                            .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$191)
    6234                            .dwattr $C$DW$585, DW_AT_name("pointerStack")
    6235                            .dwattr $C$DW$585, DW_AT_TI_symbol_name("pointerStack")
    6236                            .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6237                            .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    6238                            .dwattr $C$DW$585, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6239                            .dwattr $C$DW$585, DW_AT_decl_line(0x3f5)
    6240                            .dwattr $C$DW$585, DW_AT_decl_column(0x16)
    6241                    
    6242                    $C$DW$586       .dwtag  DW_TAG_member
    6243                            .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$192)
    6244                            .dwattr $C$DW$586, DW_AT_name("directAPI")
    6245                            .dwattr $C$DW$586, DW_AT_TI_symbol_name("directAPI")
    6246                            .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6247                            .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    6248                            .dwattr $C$DW$586, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6249                            .dwattr $C$DW$586, DW_AT_decl_line(0x3f6)
    6250                            .dwattr $C$DW$586, DW_AT_decl_column(0x15)
    6251                    
    6252                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6253                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x3f4)
    6254                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x01)
    6255                            .dwendtag $C$DW$T$193
    6256                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  115

    6257                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    6258                            .dwattr $C$DW$T$195, DW_AT_name("icall_directAPIMsg_t")
    6259                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$193)
    6260                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    6261                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6262                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x3f7)
    6263                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x03)
    6264                    
    6265                    
    6266                    $C$DW$T$196     .dwtag  DW_TAG_structure_type
    6267                            .dwattr $C$DW$T$196, DW_AT_byte_size(0x14)
    6268                    $C$DW$587       .dwtag  DW_TAG_member
    6269                            .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$194)
    6270                            .dwattr $C$DW$587, DW_AT_name("hdr")
    6271                            .dwattr $C$DW$587, DW_AT_TI_symbol_name("hdr")
    6272                            .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6273                            .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    6274                            .dwattr $C$DW$587, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6275                            .dwattr $C$DW$587, DW_AT_decl_line(0x3fb)
    6276                            .dwattr $C$DW$587, DW_AT_decl_column(0x10)
    6277                    
    6278                    $C$DW$588       .dwtag  DW_TAG_member
    6279                            .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$195)
    6280                            .dwattr $C$DW$588, DW_AT_name("msg")
    6281                            .dwattr $C$DW$588, DW_AT_TI_symbol_name("msg")
    6282                            .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6283                            .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    6284                            .dwattr $C$DW$588, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6285                            .dwattr $C$DW$588, DW_AT_decl_line(0x3fc)
    6286                            .dwattr $C$DW$588, DW_AT_decl_column(0x1a)
    6287                    
    6288                            .dwattr $C$DW$T$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6289                            .dwattr $C$DW$T$196, DW_AT_decl_line(0x3fa)
    6290                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x01)
    6291                            .dwendtag $C$DW$T$196
    6292                    
    6293                    $C$DW$T$1378    .dwtag  DW_TAG_typedef
    6294                            .dwattr $C$DW$T$1378, DW_AT_name("icallLiteMsg_t")
    6295                            .dwattr $C$DW$T$1378, DW_AT_type(*$C$DW$T$196)
    6296                            .dwattr $C$DW$T$1378, DW_AT_language(DW_LANG_C)
    6297                            .dwattr $C$DW$T$1378, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    6298                            .dwattr $C$DW$T$1378, DW_AT_decl_line(0x3fd)
    6299                            .dwattr $C$DW$T$1378, DW_AT_decl_column(0x03)
    6300                    
    6301                    
    6302                    $C$DW$T$229     .dwtag  DW_TAG_structure_type
    6303                            .dwattr $C$DW$T$229, DW_AT_byte_size(0x4c)
    6304                    $C$DW$589       .dwtag  DW_TAG_member
    6305                            .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$199)
    6306                            .dwattr $C$DW$589, DW_AT_name("Crc32")
    6307                            .dwattr $C$DW$589, DW_AT_TI_symbol_name("Crc32")
    6308                            .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6309                            .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    6310                            .dwattr $C$DW$589, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6311                            .dwattr $C$DW$589, DW_AT_decl_line(0x76)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{AEEE976D-37BE-4249-ABF7-9A0B38A760C7} PAGE  116

    6312                            .dwattr $C$DW$589, DW_AT_decl_column(0x25)
    6313                    
    6314                    $C$DW$590       .dwtag  DW_TAG_member
    6315                            .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$202)
    6316                            .dwattr $C$DW$590, DW_AT_name("FlashGetSize")
    6317                            .dwattr $C$DW$590, DW_AT_TI_symbol_name("FlashGetSize")
    6318                            .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6319                            .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    6320                            .dwattr $C$DW$590, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6321                            .dwattr $C$DW$590, DW_AT_decl_line(0x77)
    6322                            .dwattr $C$DW$590, DW_AT_decl_column(0x25)
    6323                    
    6324                    $C$DW$591       .dwtag  DW_TAG_member
    6325                            .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$203)
    6326                            .dwattr $C$DW$591, DW_AT_name("GetChipId")
    6327                            .dwattr $C$DW$591, DW_AT_TI_symbol_name("GetChipId")
    6328                            .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6329                            .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    6330                            .dwattr $C$DW$591, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6331                            .dwattr $C$DW$591, DW_AT_decl_line(0x78)
