TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Dec 12 17:41:48 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/CoP/mcp.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\The_Wonderer\Google Drive\School\2018_3_Semester_Fa
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    3536                            .dwattr $C$DW$367, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    3537                            .dwattr $C$DW$367, DW_AT_decl_line(0x2cd)
    3538                            .dwattr $C$DW$367, DW_AT_decl_column(0x05)
    3539                    
    3540                    $C$DW$368       .dwtag  DW_TAG_enumerator
    3541                            .dwattr $C$DW$368, DW_AT_name("PIN_ALREADY_ALLOCATED")
    3542                            .dwattr $C$DW$368, DW_AT_const_value(0x01)
    3543                            .dwattr $C$DW$368, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    3544                            .dwattr $C$DW$368, DW_AT_decl_line(0x2ce)
    3545                            .dwattr $C$DW$368, DW_AT_decl_column(0x05)
    3546                    
    3547                    $C$DW$369       .dwtag  DW_TAG_enumerator
    3548                            .dwattr $C$DW$369, DW_AT_name("PIN_NO_ACCESS")
    3549                            .dwattr $C$DW$369, DW_AT_const_value(0x02)
    3550                            .dwattr $C$DW$369, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    3551                            .dwattr $C$DW$369, DW_AT_decl_line(0x2cf)
    3552                            .dwattr $C$DW$369, DW_AT_decl_column(0x05)
    3553                    
    3554                    $C$DW$370       .dwtag  DW_TAG_enumerator
    3555                            .dwattr $C$DW$370, DW_AT_name("PIN_UNSUPPORTED")
    3556                            .dwattr $C$DW$370, DW_AT_const_value(0x03)
    3557                            .dwattr $C$DW$370, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    3558                            .dwattr $C$DW$370, DW_AT_decl_line(0x2d0)
    3559                            .dwattr $C$DW$370, DW_AT_decl_column(0x05)
    3560                    
    3561                            .dwattr $C$DW$T$889, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    3562                            .dwattr $C$DW$T$889, DW_AT_decl_line(0x2cc)
    3563                            .dwattr $C$DW$T$889, DW_AT_decl_column(0x0e)
    3564                            .dwendtag $C$DW$T$889
    3565                    
    3566                    $C$DW$T$890     .dwtag  DW_TAG_typedef
    3567                            .dwattr $C$DW$T$890, DW_AT_name("PIN_Status")
    3568                            .dwattr $C$DW$T$890, DW_AT_type(*$C$DW$T$889)
    3569                            .dwattr $C$DW$T$890, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   66

    3570                            .dwattr $C$DW$T$890, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    3571                            .dwattr $C$DW$T$890, DW_AT_decl_line(0x2d1)
    3572                            .dwattr $C$DW$T$890, DW_AT_decl_column(0x03)
    3573                    
    3574                    
    3575                    $C$DW$T$891     .dwtag  DW_TAG_enumeration_type
    3576                            .dwattr $C$DW$T$891, DW_AT_byte_size(0x01)
    3577                    $C$DW$371       .dwtag  DW_TAG_enumerator
    3578                            .dwattr $C$DW$371, DW_AT_name("board_rfSwitch_select")
    3579                            .dwattr $C$DW$371, DW_AT_const_value(0x00)
    3580                            .dwattr $C$DW$371, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    3581                            .dwattr $C$DW$371, DW_AT_decl_line(0x51)
    3582                            .dwattr $C$DW$371, DW_AT_decl_column(0x05)
    3583                    
    3584                    $C$DW$372       .dwtag  DW_TAG_enumerator
    3585                            .dwattr $C$DW$372, DW_AT_name("NO_OF_GPIOS")
    3586                            .dwattr $C$DW$372, DW_AT_const_value(0x01)
    3587                            .dwattr $C$DW$372, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    3588                            .dwattr $C$DW$372, DW_AT_decl_line(0x58)
    3589                            .dwattr $C$DW$372, DW_AT_decl_column(0x05)
    3590                    
    3591                            .dwattr $C$DW$T$891, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    3592                            .dwattr $C$DW$T$891, DW_AT_decl_line(0x4f)
    3593                            .dwattr $C$DW$T$891, DW_AT_decl_column(0x01)
    3594                            .dwendtag $C$DW$T$891
    3595                    
    3596                    $C$DW$T$892     .dwtag  DW_TAG_typedef
    3597                            .dwattr $C$DW$T$892, DW_AT_name("board_gpio_type")
    3598                            .dwattr $C$DW$T$892, DW_AT_type(*$C$DW$T$891)
    3599                            .dwattr $C$DW$T$892, DW_AT_language(DW_LANG_C)
    3600                            .dwattr $C$DW$T$892, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    3601                            .dwattr $C$DW$T$892, DW_AT_decl_line(0x59)
    3602                            .dwattr $C$DW$T$892, DW_AT_decl_column(0x03)
    3603                    
    3604                    
    3605                    $C$DW$T$141     .dwtag  DW_TAG_structure_type
    3606                            .dwattr $C$DW$T$141, DW_AT_byte_size(0x0a)
    3607                    $C$DW$373       .dwtag  DW_TAG_member
    3608                            .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$213)
    3609                            .dwattr $C$DW$373, DW_AT_name("addr")
    3610                            .dwattr $C$DW$373, DW_AT_TI_symbol_name("addr")
    3611                            .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3612                            .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3613                            .dwattr $C$DW$373, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    3614                            .dwattr $C$DW$373, DW_AT_decl_line(0x4db)
    3615                            .dwattr $C$DW$373, DW_AT_decl_column(0x07)
    3616                    
    3617                    $C$DW$374       .dwtag  DW_TAG_member
    3618                            .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$140)
    3619                            .dwattr $C$DW$374, DW_AT_name("addrMode")
    3620                            .dwattr $C$DW$374, DW_AT_TI_symbol_name("addrMode")
    3621                            .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3622                            .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3623                            .dwattr $C$DW$374, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    3624                            .dwattr $C$DW$374, DW_AT_decl_line(0x4de)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   67

    3625                            .dwattr $C$DW$374, DW_AT_decl_column(0x17)
    3626                    
    3627                            .dwattr $C$DW$T$141, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    3628                            .dwattr $C$DW$T$141, DW_AT_decl_line(0x4d0)
    3629                            .dwattr $C$DW$T$141, DW_AT_decl_column(0x01)
    3630                            .dwendtag $C$DW$T$141
    3631                    
    3632                    $C$DW$T$431     .dwtag  DW_TAG_typedef
    3633                            .dwattr $C$DW$T$431, DW_AT_name("ApiMac_sAddr_t")
    3634                            .dwattr $C$DW$T$431, DW_AT_type(*$C$DW$T$141)
    3635                            .dwattr $C$DW$T$431, DW_AT_language(DW_LANG_C)
    3636                            .dwattr $C$DW$T$431, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    3637                            .dwattr $C$DW$T$431, DW_AT_decl_line(0x4df)
    3638                            .dwattr $C$DW$T$431, DW_AT_decl_column(0x03)
    3639                    
    3640                    
    3641                    $C$DW$T$147     .dwtag  DW_TAG_structure_type
    3642                            .dwattr $C$DW$T$147, DW_AT_byte_size(0x40)
    3643                    $C$DW$375       .dwtag  DW_TAG_member
    3644                            .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$143)
    3645                            .dwattr $C$DW$375, DW_AT_name("beaconType")
    3646                            .dwattr $C$DW$375, DW_AT_TI_symbol_name("beaconType")
    3647                            .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3648                            .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3649                            .dwattr $C$DW$375, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    3650                            .dwattr $C$DW$375, DW_AT_decl_line(0x886)
    3651                            .dwattr $C$DW$375, DW_AT_decl_column(0x19)
    3652                    
    3653                    $C$DW$376       .dwtag  DW_TAG_member
    3654                            .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$145)
    3655                            .dwattr $C$DW$376, DW_AT_name("bsn")
    3656                            .dwattr $C$DW$376, DW_AT_TI_symbol_name("bsn")
    3657                            .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3658                            .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3659                            .dwattr $C$DW$376, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    3660                            .dwattr $C$DW$376, DW_AT_decl_line(0x888)
    3661                            .dwattr $C$DW$376, DW_AT_decl_column(0x0d)
    3662                    
    3663                    $C$DW$377       .dwtag  DW_TAG_member
    3664                            .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$146)
    3665                            .dwattr $C$DW$377, DW_AT_name("panDesc")
    3666                            .dwattr $C$DW$377, DW_AT_TI_symbol_name("panDesc")
    3667                            .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3668                            .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3669                            .dwattr $C$DW$377, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    3670                            .dwattr $C$DW$377, DW_AT_decl_line(0x88a)
    3671                            .dwattr $C$DW$377, DW_AT_decl_column(0x16)
    3672                    
    3673                    $C$DW$378       .dwtag  DW_TAG_member
    3674                            .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$216)
    3675                            .dwattr $C$DW$378, DW_AT_name("beaconData")
    3676                            .dwattr $C$DW$378, DW_AT_TI_symbol_name("beaconData")
    3677                            .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3678                            .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3679                            .dwattr $C$DW$378, DW_AT_decl_file("..\Application\CoP\api_mac.h")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   68

    3680                            .dwattr $C$DW$378, DW_AT_decl_line(0x895)
    3681                            .dwattr $C$DW$378, DW_AT_decl_column(0x07)
    3682                    
    3683                            .dwattr $C$DW$T$147, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    3684                            .dwattr $C$DW$T$147, DW_AT_decl_line(0x884)
    3685                            .dwattr $C$DW$T$147, DW_AT_decl_column(0x01)
    3686                            .dwendtag $C$DW$T$147
    3687                    
    3688                    $C$DW$T$344     .dwtag  DW_TAG_typedef
    3689                            .dwattr $C$DW$T$344, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    3690                            .dwattr $C$DW$T$344, DW_AT_type(*$C$DW$T$147)
    3691                            .dwattr $C$DW$T$344, DW_AT_language(DW_LANG_C)
    3692                            .dwattr $C$DW$T$344, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    3693                            .dwattr $C$DW$T$344, DW_AT_decl_line(0x896)
    3694                            .dwattr $C$DW$T$344, DW_AT_decl_column(0x03)
    3695                    
    3696                    $C$DW$T$345     .dwtag  DW_TAG_pointer_type
    3697                            .dwattr $C$DW$T$345, DW_AT_type(*$C$DW$T$344)
    3698                            .dwattr $C$DW$T$345, DW_AT_address_class(0x20)
    3699                    
    3700                    
    3701                    $C$DW$T$148     .dwtag  DW_TAG_structure_type
    3702                            .dwattr $C$DW$T$148, DW_AT_byte_size(0x10)
    3703                    $C$DW$379       .dwtag  DW_TAG_member
    3704                            .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$14)
    3705                            .dwattr $C$DW$379, DW_AT_name("__max_align1")
    3706                            .dwattr $C$DW$379, DW_AT_TI_symbol_name("__max_align1")
    3707                            .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3708                            .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3709                            .dwattr $C$DW$379, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3710                            .dwattr $C$DW$379, DW_AT_decl_line(0x70)
    3711                            .dwattr $C$DW$379, DW_AT_decl_column(0x0c)
    3712                    
    3713                    $C$DW$380       .dwtag  DW_TAG_member
    3714                            .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$18)
    3715                            .dwattr $C$DW$380, DW_AT_name("__max_align2")
    3716                            .dwattr $C$DW$380, DW_AT_TI_symbol_name("__max_align2")
    3717                            .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3718                            .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3719                            .dwattr $C$DW$380, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3720                            .dwattr $C$DW$380, DW_AT_decl_line(0x71)
    3721                            .dwattr $C$DW$380, DW_AT_decl_column(0x0e)
    3722                    
    3723                            .dwattr $C$DW$T$148, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3724                            .dwattr $C$DW$T$148, DW_AT_decl_line(0x6f)
    3725                            .dwattr $C$DW$T$148, DW_AT_decl_column(0x10)
    3726                            .dwendtag $C$DW$T$148
    3727                    
    3728                    $C$DW$T$893     .dwtag  DW_TAG_typedef
    3729                            .dwattr $C$DW$T$893, DW_AT_name("__max_align_t")
    3730                            .dwattr $C$DW$T$893, DW_AT_type(*$C$DW$T$148)
    3731                            .dwattr $C$DW$T$893, DW_AT_language(DW_LANG_C)
    3732                            .dwattr $C$DW$T$893, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3733                            .dwattr $C$DW$T$893, DW_AT_decl_line(0x72)
    3734                            .dwattr $C$DW$T$893, DW_AT_decl_column(0x03)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   69

    3735                    
    3736                    
    3737                    $C$DW$T$149     .dwtag  DW_TAG_structure_type
    3738                            .dwattr $C$DW$T$149, DW_AT_byte_size(0x08)
    3739                    $C$DW$381       .dwtag  DW_TAG_member
    3740                            .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$10)
    3741                            .dwattr $C$DW$381, DW_AT_name("quot")
    3742                            .dwattr $C$DW$381, DW_AT_TI_symbol_name("quot")
    3743                            .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3744                            .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3745                            .dwattr $C$DW$381, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3746                            .dwattr $C$DW$381, DW_AT_decl_line(0x49)
    3747                            .dwattr $C$DW$381, DW_AT_decl_column(0x16)
    3748                    
    3749                    $C$DW$382       .dwtag  DW_TAG_member
    3750                            .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$10)
    3751                            .dwattr $C$DW$382, DW_AT_name("rem")
    3752                            .dwattr $C$DW$382, DW_AT_TI_symbol_name("rem")
    3753                            .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3754                            .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3755                            .dwattr $C$DW$382, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3756                            .dwattr $C$DW$382, DW_AT_decl_line(0x49)
    3757                            .dwattr $C$DW$382, DW_AT_decl_column(0x1c)
    3758                    
    3759                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3760                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x49)
    3761                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x10)
    3762                            .dwendtag $C$DW$T$149
    3763                    
    3764                    $C$DW$T$894     .dwtag  DW_TAG_typedef
    3765                            .dwattr $C$DW$T$894, DW_AT_name("div_t")
    3766                            .dwattr $C$DW$T$894, DW_AT_type(*$C$DW$T$149)
    3767                            .dwattr $C$DW$T$894, DW_AT_language(DW_LANG_C)
    3768                            .dwattr $C$DW$T$894, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3769                            .dwattr $C$DW$T$894, DW_AT_decl_line(0x49)
    3770                            .dwattr $C$DW$T$894, DW_AT_decl_column(0x23)
    3771                    
    3772                    
    3773                    $C$DW$T$150     .dwtag  DW_TAG_structure_type
    3774                            .dwattr $C$DW$T$150, DW_AT_byte_size(0x08)
    3775                    $C$DW$383       .dwtag  DW_TAG_member
    3776                            .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$10)
    3777                            .dwattr $C$DW$383, DW_AT_name("quot")
    3778                            .dwattr $C$DW$383, DW_AT_TI_symbol_name("quot")
    3779                            .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3780                            .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3781                            .dwattr $C$DW$383, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3782                            .dwattr $C$DW$383, DW_AT_decl_line(0x4e)
    3783                            .dwattr $C$DW$383, DW_AT_decl_column(0x16)
    3784                    
    3785                    $C$DW$384       .dwtag  DW_TAG_member
    3786                            .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$10)
    3787                            .dwattr $C$DW$384, DW_AT_name("rem")
    3788                            .dwattr $C$DW$384, DW_AT_TI_symbol_name("rem")
    3789                            .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   70

    3790                            .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3791                            .dwattr $C$DW$384, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3792                            .dwattr $C$DW$384, DW_AT_decl_line(0x4e)
    3793                            .dwattr $C$DW$384, DW_AT_decl_column(0x1c)
    3794                    
    3795                            .dwattr $C$DW$T$150, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3796                            .dwattr $C$DW$T$150, DW_AT_decl_line(0x4e)
    3797                            .dwattr $C$DW$T$150, DW_AT_decl_column(0x10)
    3798                            .dwendtag $C$DW$T$150
    3799                    
    3800                    $C$DW$T$895     .dwtag  DW_TAG_typedef
    3801                            .dwattr $C$DW$T$895, DW_AT_name("ldiv_t")
    3802                            .dwattr $C$DW$T$895, DW_AT_type(*$C$DW$T$150)
    3803                            .dwattr $C$DW$T$895, DW_AT_language(DW_LANG_C)
    3804                            .dwattr $C$DW$T$895, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3805                            .dwattr $C$DW$T$895, DW_AT_decl_line(0x4e)
    3806                            .dwattr $C$DW$T$895, DW_AT_decl_column(0x23)
    3807                    
    3808                    
    3809                    $C$DW$T$151     .dwtag  DW_TAG_structure_type
    3810                            .dwattr $C$DW$T$151, DW_AT_byte_size(0x10)
    3811                    $C$DW$385       .dwtag  DW_TAG_member
    3812                            .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$14)
    3813                            .dwattr $C$DW$385, DW_AT_name("quot")
    3814                            .dwattr $C$DW$385, DW_AT_TI_symbol_name("quot")
    3815                            .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3816                            .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3817                            .dwattr $C$DW$385, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3818                            .dwattr $C$DW$385, DW_AT_decl_line(0x56)
    3819                            .dwattr $C$DW$385, DW_AT_decl_column(0x1c)
    3820                    
    3821                    $C$DW$386       .dwtag  DW_TAG_member
    3822                            .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$14)
    3823                            .dwattr $C$DW$386, DW_AT_name("rem")
    3824                            .dwattr $C$DW$386, DW_AT_TI_symbol_name("rem")
    3825                            .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3826                            .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3827                            .dwattr $C$DW$386, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3828                            .dwattr $C$DW$386, DW_AT_decl_line(0x56)
    3829                            .dwattr $C$DW$386, DW_AT_decl_column(0x22)
    3830                    
    3831                            .dwattr $C$DW$T$151, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3832                            .dwattr $C$DW$T$151, DW_AT_decl_line(0x56)
    3833                            .dwattr $C$DW$T$151, DW_AT_decl_column(0x10)
    3834                            .dwendtag $C$DW$T$151
    3835                    
    3836                    $C$DW$T$896     .dwtag  DW_TAG_typedef
    3837                            .dwattr $C$DW$T$896, DW_AT_name("lldiv_t")
    3838                            .dwattr $C$DW$T$896, DW_AT_type(*$C$DW$T$151)
    3839                            .dwattr $C$DW$T$896, DW_AT_language(DW_LANG_C)
    3840                            .dwattr $C$DW$T$896, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3841                            .dwattr $C$DW$T$896, DW_AT_decl_line(0x56)
    3842                            .dwattr $C$DW$T$896, DW_AT_decl_column(0x29)
    3843                    
    3844                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   71

    3845                    $C$DW$T$157     .dwtag  DW_TAG_structure_type
    3846                            .dwattr $C$DW$T$157, DW_AT_byte_size(0x08)
    3847                    $C$DW$387       .dwtag  DW_TAG_member
    3848                            .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$155)
    3849                            .dwattr $C$DW$387, DW_AT_name("pointerStack")
    3850                            .dwattr $C$DW$387, DW_AT_TI_symbol_name("pointerStack")
    3851                            .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3852                            .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3853                            .dwattr $C$DW$387, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3854                            .dwattr $C$DW$387, DW_AT_decl_line(0x3f5)
    3855                            .dwattr $C$DW$387, DW_AT_decl_column(0x16)
    3856                    
    3857                    $C$DW$388       .dwtag  DW_TAG_member
    3858                            .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$156)
    3859                            .dwattr $C$DW$388, DW_AT_name("directAPI")
    3860                            .dwattr $C$DW$388, DW_AT_TI_symbol_name("directAPI")
    3861                            .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3862                            .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3863                            .dwattr $C$DW$388, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3864                            .dwattr $C$DW$388, DW_AT_decl_line(0x3f6)
    3865                            .dwattr $C$DW$388, DW_AT_decl_column(0x15)
    3866                    
    3867                            .dwattr $C$DW$T$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3868                            .dwattr $C$DW$T$157, DW_AT_decl_line(0x3f4)
    3869                            .dwattr $C$DW$T$157, DW_AT_decl_column(0x01)
    3870                            .dwendtag $C$DW$T$157
    3871                    
    3872                    $C$DW$T$159     .dwtag  DW_TAG_typedef
    3873                            .dwattr $C$DW$T$159, DW_AT_name("icall_directAPIMsg_t")
    3874                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$157)
    3875                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    3876                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3877                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x3f7)
    3878                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x03)
    3879                    
    3880                    
    3881                    $C$DW$T$160     .dwtag  DW_TAG_structure_type
    3882                            .dwattr $C$DW$T$160, DW_AT_byte_size(0x14)
    3883                    $C$DW$389       .dwtag  DW_TAG_member
    3884                            .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$158)
    3885                            .dwattr $C$DW$389, DW_AT_name("hdr")
    3886                            .dwattr $C$DW$389, DW_AT_TI_symbol_name("hdr")
    3887                            .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3888                            .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3889                            .dwattr $C$DW$389, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3890                            .dwattr $C$DW$389, DW_AT_decl_line(0x3fb)
    3891                            .dwattr $C$DW$389, DW_AT_decl_column(0x10)
    3892                    
    3893                    $C$DW$390       .dwtag  DW_TAG_member
    3894                            .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$159)
    3895                            .dwattr $C$DW$390, DW_AT_name("msg")
    3896                            .dwattr $C$DW$390, DW_AT_TI_symbol_name("msg")
    3897                            .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3898                            .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3899                            .dwattr $C$DW$390, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   72

    3900                            .dwattr $C$DW$390, DW_AT_decl_line(0x3fc)
    3901                            .dwattr $C$DW$390, DW_AT_decl_column(0x1a)
    3902                    
    3903                            .dwattr $C$DW$T$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3904                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x3fa)
    3905                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x01)
    3906                            .dwendtag $C$DW$T$160
    3907                    
    3908                    $C$DW$T$897     .dwtag  DW_TAG_typedef
    3909                            .dwattr $C$DW$T$897, DW_AT_name("icallLiteMsg_t")
    3910                            .dwattr $C$DW$T$897, DW_AT_type(*$C$DW$T$160)
    3911                            .dwattr $C$DW$T$897, DW_AT_language(DW_LANG_C)
    3912                            .dwattr $C$DW$T$897, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3913                            .dwattr $C$DW$T$897, DW_AT_decl_line(0x3fd)
    3914                            .dwattr $C$DW$T$897, DW_AT_decl_column(0x03)
    3915                    
    3916                    
    3917                    $C$DW$T$164     .dwtag  DW_TAG_structure_type
    3918                            .dwattr $C$DW$T$164, DW_AT_byte_size(0x08)
    3919                    $C$DW$391       .dwtag  DW_TAG_member
    3920                            .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$161)
    3921                            .dwattr $C$DW$391, DW_AT_name("frameCounter")
    3922                            .dwattr $C$DW$391, DW_AT_TI_symbol_name("frameCounter")
    3923                            .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3924                            .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3925                            .dwattr $C$DW$391, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    3926                            .dwattr $C$DW$391, DW_AT_decl_line(0x575)
    3927                            .dwattr $C$DW$391, DW_AT_decl_column(0x1a)
    3928                    
    3929                    $C$DW$392       .dwtag  DW_TAG_member
    3930                            .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$163)
    3931                            .dwattr $C$DW$392, DW_AT_name("keyIdx")
    3932                            .dwattr $C$DW$392, DW_AT_TI_symbol_name("keyIdx")
    3933                            .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3934                            .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3935                            .dwattr $C$DW$392, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    3936                            .dwattr $C$DW$392, DW_AT_decl_line(0x576)
    3937                            .dwattr $C$DW$392, DW_AT_decl_column(0x1a)
    3938                    
    3939                            .dwattr $C$DW$T$164, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    3940                            .dwattr $C$DW$T$164, DW_AT_decl_line(0x574)
    3941                            .dwattr $C$DW$T$164, DW_AT_decl_column(0x01)
    3942                            .dwendtag $C$DW$T$164
    3943                    
    3944                    $C$DW$T$493     .dwtag  DW_TAG_typedef
    3945                            .dwattr $C$DW$T$493, DW_AT_name("ApiMac_frameCntr_t")
    3946                            .dwattr $C$DW$T$493, DW_AT_type(*$C$DW$T$164)
    3947                            .dwattr $C$DW$T$493, DW_AT_language(DW_LANG_C)
    3948                            .dwattr $C$DW$T$493, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    3949                            .dwattr $C$DW$T$493, DW_AT_decl_line(0x577)
    3950                            .dwattr $C$DW$T$493, DW_AT_decl_column(0x03)
    3951                    
    3952                    $C$DW$T$494     .dwtag  DW_TAG_pointer_type
    3953                            .dwattr $C$DW$T$494, DW_AT_type(*$C$DW$T$493)
    3954                            .dwattr $C$DW$T$494, DW_AT_address_class(0x20)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   73

    3955                    
    3956                    
    3957                    $C$DW$T$165     .dwtag  DW_TAG_structure_type
    3958                            .dwattr $C$DW$T$165, DW_AT_byte_size(0x0c)
    3959                    $C$DW$393       .dwtag  DW_TAG_member
    3960                            .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$145)
    3961                            .dwattr $C$DW$393, DW_AT_name("cmd0")
    3962                            .dwattr $C$DW$393, DW_AT_TI_symbol_name("cmd0")
    3963                            .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3964                            .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3965                            .dwattr $C$DW$393, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    3966                            .dwattr $C$DW$393, DW_AT_decl_line(0x45)
    3967                            .dwattr $C$DW$393, DW_AT_decl_column(0x0d)
    3968                    
    3969                    $C$DW$394       .dwtag  DW_TAG_member
    3970                            .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$145)
    3971                            .dwattr $C$DW$394, DW_AT_name("cmd1")
    3972                            .dwattr $C$DW$394, DW_AT_TI_symbol_name("cmd1")
    3973                            .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3974                            .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3975                            .dwattr $C$DW$394, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    3976                            .dwattr $C$DW$394, DW_AT_decl_line(0x47)
    3977                            .dwattr $C$DW$394, DW_AT_decl_column(0x0d)
    3978                    
    3979                    $C$DW$395       .dwtag  DW_TAG_member
    3980                            .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$145)
    3981                            .dwattr $C$DW$395, DW_AT_name("block")
    3982                            .dwattr $C$DW$395, DW_AT_TI_symbol_name("block")
    3983                            .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3984                            .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3985                            .dwattr $C$DW$395, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    3986                            .dwattr $C$DW$395, DW_AT_decl_line(0x49)
    3987                            .dwattr $C$DW$395, DW_AT_decl_column(0x0d)
    3988                    
    3989                    $C$DW$396       .dwtag  DW_TAG_member
    3990                            .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$145)
    3991                            .dwattr $C$DW$396, DW_AT_name("verid")
    3992                            .dwattr $C$DW$396, DW_AT_TI_symbol_name("verid")
    3993                            .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3994                            .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3995                            .dwattr $C$DW$396, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    3996                            .dwattr $C$DW$396, DW_AT_decl_line(0x4b)
    3997                            .dwattr $C$DW$396, DW_AT_decl_column(0x0d)
    3998                    
    3999                    $C$DW$397       .dwtag  DW_TAG_member
    4000                            .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$163)
    4001                            .dwattr $C$DW$397, DW_AT_name("length")
    4002                            .dwattr $C$DW$397, DW_AT_TI_symbol_name("length")
    4003                            .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4004                            .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4005                            .dwattr $C$DW$397, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4006                            .dwattr $C$DW$397, DW_AT_decl_line(0x4d)
    4007                            .dwattr $C$DW$397, DW_AT_decl_column(0x0e)
    4008                    
    4009                    $C$DW$398       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   74

    4010                            .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$3)
    4011                            .dwattr $C$DW$398, DW_AT_name("pData")
    4012                            .dwattr $C$DW$398, DW_AT_TI_symbol_name("pData")
    4013                            .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4014                            .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4015                            .dwattr $C$DW$398, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4016                            .dwattr $C$DW$398, DW_AT_decl_line(0x4f)
    4017                            .dwattr $C$DW$398, DW_AT_decl_column(0x0b)
    4018                    
    4019                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    4020                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x43)
    4021                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x01)
    4022                            .dwendtag $C$DW$T$165
    4023                    
    4024                    $C$DW$T$898     .dwtag  DW_TAG_typedef
    4025                            .dwattr $C$DW$T$898, DW_AT_name("Mt_mpb_t")
    4026                            .dwattr $C$DW$T$898, DW_AT_type(*$C$DW$T$165)
    4027                            .dwattr $C$DW$T$898, DW_AT_language(DW_LANG_C)
    4028                            .dwattr $C$DW$T$898, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    4029                            .dwattr $C$DW$T$898, DW_AT_decl_line(0x50)
    4030                            .dwattr $C$DW$T$898, DW_AT_decl_column(0x03)
    4031                    
    4032                    
    4033                    $C$DW$T$204     .dwtag  DW_TAG_structure_type
    4034                            .dwattr $C$DW$T$204, DW_AT_byte_size(0x4c)
    4035                    $C$DW$399       .dwtag  DW_TAG_member
    4036                            .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$169)
    4037                            .dwattr $C$DW$399, DW_AT_name("Crc32")
    4038                            .dwattr $C$DW$399, DW_AT_TI_symbol_name("Crc32")
    4039                            .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4040                            .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4041                            .dwattr $C$DW$399, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4042                            .dwattr $C$DW$399, DW_AT_decl_line(0x76)
    4043                            .dwattr $C$DW$399, DW_AT_decl_column(0x25)
    4044                    
    4045                    $C$DW$400       .dwtag  DW_TAG_member
    4046                            .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$172)
    4047                            .dwattr $C$DW$400, DW_AT_name("FlashGetSize")
    4048                            .dwattr $C$DW$400, DW_AT_TI_symbol_name("FlashGetSize")
    4049                            .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4050                            .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4051                            .dwattr $C$DW$400, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4052                            .dwattr $C$DW$400, DW_AT_decl_line(0x77)
    4053                            .dwattr $C$DW$400, DW_AT_decl_column(0x25)
    4054                    
    4055                    $C$DW$401       .dwtag  DW_TAG_member
    4056                            .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$173)
    4057                            .dwattr $C$DW$401, DW_AT_name("GetChipId")
    4058                            .dwattr $C$DW$401, DW_AT_TI_symbol_name("GetChipId")
    4059                            .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4060                            .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4061                            .dwattr $C$DW$401, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4062                            .dwattr $C$DW$401, DW_AT_decl_line(0x78)
    4063                            .dwattr $C$DW$401, DW_AT_decl_column(0x25)
    4064                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   75

    4065                    $C$DW$402       .dwtag  DW_TAG_member
    4066                            .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$176)
    4067                            .dwattr $C$DW$402, DW_AT_name("ReservedLocation1")
    4068                            .dwattr $C$DW$402, DW_AT_TI_symbol_name("ReservedLocation1")
    4069                            .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4070                            .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4071                            .dwattr $C$DW$402, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4072                            .dwattr $C$DW$402, DW_AT_decl_line(0x79)
    4073                            .dwattr $C$DW$402, DW_AT_decl_column(0x25)
    4074                    
    4075                    $C$DW$403       .dwtag  DW_TAG_member
    4076                            .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$177)
    4077                            .dwattr $C$DW$403, DW_AT_name("ReservedLocation2")
    4078                            .dwattr $C$DW$403, DW_AT_TI_symbol_name("ReservedLocation2")
    4079                            .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4080                            .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4081                            .dwattr $C$DW$403, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4082                            .dwattr $C$DW$403, DW_AT_decl_line(0x7a)
    4083                            .dwattr $C$DW$403, DW_AT_decl_column(0x25)
    4084                    
    4085                    $C$DW$404       .dwtag  DW_TAG_member
    4086                            .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$178)
    4087                            .dwattr $C$DW$404, DW_AT_name("ReservedLocation3")
    4088                            .dwattr $C$DW$404, DW_AT_TI_symbol_name("ReservedLocation3")
    4089                            .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4090                            .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4091                            .dwattr $C$DW$404, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4092                            .dwattr $C$DW$404, DW_AT_decl_line(0x7b)
    4093                            .dwattr $C$DW$404, DW_AT_decl_column(0x25)
    4094                    
    4095                    $C$DW$405       .dwtag  DW_TAG_member
    4096                            .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$181)
    4097                            .dwattr $C$DW$405, DW_AT_name("ResetDevice")
    4098                            .dwattr $C$DW$405, DW_AT_TI_symbol_name("ResetDevice")
    4099                            .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4100                            .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4101                            .dwattr $C$DW$405, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4102                            .dwattr $C$DW$405, DW_AT_decl_line(0x7c)
    4103                            .dwattr $C$DW$405, DW_AT_decl_column(0x25)
    4104                    
    4105                    $C$DW$406       .dwtag  DW_TAG_member
    4106                            .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$185)
    4107                            .dwattr $C$DW$406, DW_AT_name("Fletcher32")
    4108                            .dwattr $C$DW$406, DW_AT_TI_symbol_name("Fletcher32")
    4109                            .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4110                            .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4111                            .dwattr $C$DW$406, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4112                            .dwattr $C$DW$406, DW_AT_decl_line(0x7d)
    4113                            .dwattr $C$DW$406, DW_AT_decl_column(0x25)
    4114                    
    4115                    $C$DW$407       .dwtag  DW_TAG_member
    4116                            .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$189)
    4117                            .dwattr $C$DW$407, DW_AT_name("MinValue")
    4118                            .dwattr $C$DW$407, DW_AT_TI_symbol_name("MinValue")
    4119                            .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   76

    4120                            .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4121                            .dwattr $C$DW$407, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4122                            .dwattr $C$DW$407, DW_AT_decl_line(0x7e)
    4123                            .dwattr $C$DW$407, DW_AT_decl_column(0x25)
    4124                    
    4125                    $C$DW$408       .dwtag  DW_TAG_member
    4126                            .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$190)
    4127                            .dwattr $C$DW$408, DW_AT_name("MaxValue")
    4128                            .dwattr $C$DW$408, DW_AT_TI_symbol_name("MaxValue")
    4129                            .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4130                            .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4131                            .dwattr $C$DW$408, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4132                            .dwattr $C$DW$408, DW_AT_decl_line(0x7f)
    4133                            .dwattr $C$DW$408, DW_AT_decl_column(0x25)
    4134                    
    4135                    $C$DW$409       .dwtag  DW_TAG_member
    4136                            .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$191)
    4137                            .dwattr $C$DW$409, DW_AT_name("MeanValue")
    4138                            .dwattr $C$DW$409, DW_AT_TI_symbol_name("MeanValue")
    4139                            .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4140                            .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4141                            .dwattr $C$DW$409, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4142                            .dwattr $C$DW$409, DW_AT_decl_line(0x80)
    4143                            .dwattr $C$DW$409, DW_AT_decl_column(0x25)
    4144                    
    4145                    $C$DW$410       .dwtag  DW_TAG_member
    4146                            .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$192)
    4147                            .dwattr $C$DW$410, DW_AT_name("StandDeviationValue")
    4148                            .dwattr $C$DW$410, DW_AT_TI_symbol_name("StandDeviationValue")
    4149                            .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4150                            .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4151                            .dwattr $C$DW$410, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4152                            .dwattr $C$DW$410, DW_AT_decl_line(0x81)
    4153                            .dwattr $C$DW$410, DW_AT_decl_column(0x25)
    4154                    
    4155                    $C$DW$411       .dwtag  DW_TAG_member
    4156                            .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$195)
    4157                            .dwattr $C$DW$411, DW_AT_name("ReservedLocation4")
    4158                            .dwattr $C$DW$411, DW_AT_TI_symbol_name("ReservedLocation4")
    4159                            .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4160                            .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4161                            .dwattr $C$DW$411, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4162                            .dwattr $C$DW$411, DW_AT_decl_line(0x82)
    4163                            .dwattr $C$DW$411, DW_AT_decl_column(0x25)
    4164                    
    4165                    $C$DW$412       .dwtag  DW_TAG_member
    4166                            .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$196)
    4167                            .dwattr $C$DW$412, DW_AT_name("ReservedLocation5")
    4168                            .dwattr $C$DW$412, DW_AT_TI_symbol_name("ReservedLocation5")
    4169                            .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4170                            .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4171                            .dwattr $C$DW$412, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4172                            .dwattr $C$DW$412, DW_AT_decl_line(0x83)
    4173                            .dwattr $C$DW$412, DW_AT_decl_column(0x25)
    4174                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   77

    4175                    $C$DW$413       .dwtag  DW_TAG_member
    4176                            .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$197)
    4177                            .dwattr $C$DW$413, DW_AT_name("HFSourceSafeSwitch")
    4178                            .dwattr $C$DW$413, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    4179                            .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4180                            .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4181                            .dwattr $C$DW$413, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4182                            .dwattr $C$DW$413, DW_AT_decl_line(0x84)
    4183                            .dwattr $C$DW$413, DW_AT_decl_column(0x25)
    4184                    
    4185                    $C$DW$414       .dwtag  DW_TAG_member
    4186                            .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$200)
    4187                            .dwattr $C$DW$414, DW_AT_name("SelectCompAInput")
    4188                            .dwattr $C$DW$414, DW_AT_TI_symbol_name("SelectCompAInput")
    4189                            .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4190                            .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4191                            .dwattr $C$DW$414, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4192                            .dwattr $C$DW$414, DW_AT_decl_line(0x85)
    4193                            .dwattr $C$DW$414, DW_AT_decl_column(0x25)
    4194                    
    4195                    $C$DW$415       .dwtag  DW_TAG_member
    4196                            .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$201)
    4197                            .dwattr $C$DW$415, DW_AT_name("SelectCompARef")
    4198                            .dwattr $C$DW$415, DW_AT_TI_symbol_name("SelectCompARef")
    4199                            .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4200                            .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4201                            .dwattr $C$DW$415, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4202                            .dwattr $C$DW$415, DW_AT_decl_line(0x86)
    4203                            .dwattr $C$DW$415, DW_AT_decl_column(0x25)
    4204                    
    4205                    $C$DW$416       .dwtag  DW_TAG_member
    4206                            .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$202)
    4207                            .dwattr $C$DW$416, DW_AT_name("SelectADCCompBInput")
    4208                            .dwattr $C$DW$416, DW_AT_TI_symbol_name("SelectADCCompBInput")
    4209                            .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4210                            .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4211                            .dwattr $C$DW$416, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4212                            .dwattr $C$DW$416, DW_AT_decl_line(0x87)
    4213                            .dwattr $C$DW$416, DW_AT_decl_column(0x25)
    4214                    
    4215                    $C$DW$417       .dwtag  DW_TAG_member
    4216                            .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$203)
    4217                            .dwattr $C$DW$417, DW_AT_name("SelectCompBRef")
    4218                            .dwattr $C$DW$417, DW_AT_TI_symbol_name("SelectCompBRef")
    4219                            .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4220                            .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4221                            .dwattr $C$DW$417, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4222                            .dwattr $C$DW$417, DW_AT_decl_line(0x88)
    4223                            .dwattr $C$DW$417, DW_AT_decl_column(0x25)
    4224                    
    4225                            .dwattr $C$DW$T$204, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    4226                            .dwattr $C$DW$T$204, DW_AT_decl_line(0x75)
    4227                            .dwattr $C$DW$T$204, DW_AT_decl_column(0x01)
    4228                            .dwendtag $C$DW$T$204
    4229                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   78

    4230                    $C$DW$T$899     .dwtag  DW_TAG_typedef
    4231                            .dwattr $C$DW$T$899, DW_AT_name("HARD_API_T")
    4232                            .dwattr $C$DW$T$899, DW_AT_type(*$C$DW$T$204)
    4233                            .dwattr $C$DW$T$899, DW_AT_language(DW_LANG_C)
    4234                            .dwattr $C$DW$T$899, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    4235                            .dwattr $C$DW$T$899, DW_AT_decl_line(0x89)
    4236                            .dwattr $C$DW$T$899, DW_AT_decl_column(0x03)
    4237                    
    4238                    
    4239                    $C$DW$T$207     .dwtag  DW_TAG_structure_type
    4240                            .dwattr $C$DW$T$207, DW_AT_byte_size(0x08)
    4241                    $C$DW$418       .dwtag  DW_TAG_member
    4242                            .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$10)
    4243                            .dwattr $C$DW$418, DW_AT_name("length")
    4244                            .dwattr $C$DW$418, DW_AT_TI_symbol_name("length")
    4245                            .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4246                            .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4247                            .dwattr $C$DW$418, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    4248                            .dwattr $C$DW$418, DW_AT_decl_line(0x165)
    4249                            .dwattr $C$DW$418, DW_AT_decl_column(0x16)
    4250                    
    4251                    $C$DW$419       .dwtag  DW_TAG_member
    4252                            .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$206)
    4253                            .dwattr $C$DW$419, DW_AT_name("elem")
    4254                            .dwattr $C$DW$419, DW_AT_TI_symbol_name("elem")
    4255                            .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4256                            .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4257                            .dwattr $C$DW$419, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    4258                            .dwattr $C$DW$419, DW_AT_decl_line(0x165)
    4259                            .dwattr $C$DW$419, DW_AT_decl_column(0x3a)
    4260                    
    4261                            .dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    4262                            .dwattr $C$DW$T$207, DW_AT_decl_line(0x165)
    4263                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x10)
    4264                            .dwendtag $C$DW$T$207
    4265                    
    4266                    $C$DW$T$900     .dwtag  DW_TAG_typedef
    4267                            .dwattr $C$DW$T$900, DW_AT_name("ARRAY1_ti_sysbios_knl_Swi_hooks")
    4268                            .dwattr $C$DW$T$900, DW_AT_type(*$C$DW$T$207)
    4269                            .dwattr $C$DW$T$900, DW_AT_language(DW_LANG_C)
    4270                            .dwattr $C$DW$T$900, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    4271                            .dwattr $C$DW$T$900, DW_AT_decl_line(0x165)
    4272                            .dwattr $C$DW$T$900, DW_AT_decl_column(0x42)
    4273                    
    4274                    
    4275                    $C$DW$T$210     .dwtag  DW_TAG_structure_type
    4276                            .dwattr $C$DW$T$210, DW_AT_byte_size(0x08)
    4277                    $C$DW$420       .dwtag  DW_TAG_member
    4278                            .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$10)
    4279                            .dwattr $C$DW$420, DW_AT_name("length")
    4280                            .dwattr $C$DW$420, DW_AT_TI_symbol_name("length")
    4281                            .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4282                            .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4283                            .dwattr $C$DW$420, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    4284                            .dwattr $C$DW$420, DW_AT_decl_line(0x166)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   79

    4285                            .dwattr $C$DW$420, DW_AT_decl_column(0x16)
    4286                    
    4287                    $C$DW$421       .dwtag  DW_TAG_member
    4288                            .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$209)
    4289                            .dwattr $C$DW$421, DW_AT_name("elem")
    4290                            .dwattr $C$DW$421, DW_AT_TI_symbol_name("elem")
    4291                            .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4292                            .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4293                            .dwattr $C$DW$421, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    4294                            .dwattr $C$DW$421, DW_AT_decl_line(0x166)
    4295                            .dwattr $C$DW$421, DW_AT_decl_column(0x40)
    4296                    
    4297                            .dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    4298                            .dwattr $C$DW$T$210, DW_AT_decl_line(0x166)
    4299                            .dwattr $C$DW$T$210, DW_AT_decl_column(0x10)
    4300                            .dwendtag $C$DW$T$210
    4301                    
    4302                    $C$DW$T$901     .dwtag  DW_TAG_typedef
    4303                            .dwattr $C$DW$T$901, DW_AT_name("CARRAY1_ti_sysbios_knl_Swi_hooks")
    4304                            .dwattr $C$DW$T$901, DW_AT_type(*$C$DW$T$210)
    4305                            .dwattr $C$DW$T$901, DW_AT_language(DW_LANG_C)
    4306                            .dwattr $C$DW$T$901, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    4307                            .dwattr $C$DW$T$901, DW_AT_decl_line(0x166)
    4308                            .dwattr $C$DW$T$901, DW_AT_decl_column(0x48)
    4309                    
    4310                    $C$DW$T$902     .dwtag  DW_TAG_typedef
    4311                            .dwattr $C$DW$T$902, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    4312                            .dwattr $C$DW$T$902, DW_AT_type(*$C$DW$T$901)
    4313                            .dwattr $C$DW$T$902, DW_AT_language(DW_LANG_C)
    4314                            .dwattr $C$DW$T$902, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    4315                            .dwattr $C$DW$T$902, DW_AT_decl_line(0x168)
    4316                            .dwattr $C$DW$T$902, DW_AT_decl_column(0x2a)
    4317                    
    4318                    $C$DW$T$903     .dwtag  DW_TAG_typedef
    4319                            .dwattr $C$DW$T$903, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    4320                            .dwattr $C$DW$T$903, DW_AT_type(*$C$DW$T$901)
    4321                            .dwattr $C$DW$T$903, DW_AT_language(DW_LANG_C)
    4322                            .dwattr $C$DW$T$903, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    4323                            .dwattr $C$DW$T$903, DW_AT_decl_line(0x167)
    4324                            .dwattr $C$DW$T$903, DW_AT_decl_column(0x2a)
    4325                    
    4326                    
    4327                    $C$DW$T$213     .dwtag  DW_TAG_union_type
    4328                            .dwattr $C$DW$T$213, DW_AT_byte_size(0x08)
    4329                    $C$DW$422       .dwtag  DW_TAG_member
    4330                            .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$163)
    4331                            .dwattr $C$DW$422, DW_AT_name("shortAddr")
    4332                            .dwattr $C$DW$422, DW_AT_TI_symbol_name("shortAddr")
    4333                            .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4334                            .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4335                            .dwattr $C$DW$422, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    4336                            .dwattr $C$DW$422, DW_AT_decl_line(0x4d8)
    4337                            .dwattr $C$DW$422, DW_AT_decl_column(0x12)
    4338                    
    4339                    $C$DW$423       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   80

    4340                            .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$212)
    4341                            .dwattr $C$DW$423, DW_AT_name("extAddr")
    4342                            .dwattr $C$DW$423, DW_AT_TI_symbol_name("extAddr")
    4343                            .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4344                            .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4345                            .dwattr $C$DW$423, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    4346                            .dwattr $C$DW$423, DW_AT_decl_line(0x4da)
    4347                            .dwattr $C$DW$423, DW_AT_decl_column(0x1b)
    4348                    
    4349                            .dwattr $C$DW$T$213, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    4350                            .dwattr $C$DW$T$213, DW_AT_decl_line(0x4d6)
    4351                            .dwattr $C$DW$T$213, DW_AT_decl_column(0x05)
    4352                            .dwendtag $C$DW$T$213
    4353                    
    4354                    
    4355                    $C$DW$T$216     .dwtag  DW_TAG_union_type
    4356                            .dwattr $C$DW$T$216, DW_AT_byte_size(0x18)
    4357                    $C$DW$424       .dwtag  DW_TAG_member
    4358                            .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$214)
    4359                            .dwattr $C$DW$424, DW_AT_name("beacon")
    4360                            .dwattr $C$DW$424, DW_AT_TI_symbol_name("beacon")
    4361                            .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4362                            .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4363                            .dwattr $C$DW$424, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    4364                            .dwattr $C$DW$424, DW_AT_decl_line(0x892)
    4365                            .dwattr $C$DW$424, DW_AT_decl_column(0x1d)
    4366                    
    4367                    $C$DW$425       .dwtag  DW_TAG_member
    4368                            .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$215)
    4369                            .dwattr $C$DW$425, DW_AT_name("eBeacon")
    4370                            .dwattr $C$DW$425, DW_AT_TI_symbol_name("eBeacon")
    4371                            .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4372                            .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4373                            .dwattr $C$DW$425, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    4374                            .dwattr $C$DW$425, DW_AT_decl_line(0x894)
    4375                            .dwattr $C$DW$425, DW_AT_decl_column(0x1e)
    4376                    
    4377                            .dwattr $C$DW$T$216, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    4378                            .dwattr $C$DW$T$216, DW_AT_decl_line(0x890)
    4379                            .dwattr $C$DW$T$216, DW_AT_decl_column(0x05)
    4380                            .dwendtag $C$DW$T$216
    4381                    
    4382                    
    4383                    $C$DW$T$218     .dwtag  DW_TAG_union_type
    4384                            .dwattr $C$DW$T$218, DW_AT_byte_size(0x04)
    4385                    $C$DW$426       .dwtag  DW_TAG_member
    4386                            .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$166)
    4387                            .dwattr $C$DW$426, DW_AT_name("pEnergyDetect")
    4388                            .dwattr $C$DW$426, DW_AT_TI_symbol_name("pEnergyDetect")
    4389                            .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4390                            .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4391                            .dwattr $C$DW$426, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    4392                            .dwattr $C$DW$426, DW_AT_decl_line(0x8b4)
    4393                            .dwattr $C$DW$426, DW_AT_decl_column(0x12)
    4394                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   81

    4395                    $C$DW$427       .dwtag  DW_TAG_member
    4396                            .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$217)
    4397                            .dwattr $C$DW$427, DW_AT_name("pPanDescriptor")
    4398                            .dwattr $C$DW$427, DW_AT_TI_symbol_name("pPanDescriptor")
    4399                            .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4400                            .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4401                            .dwattr $C$DW$427, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    4402                            .dwattr $C$DW$427, DW_AT_decl_line(0x8b6)
    4403                            .dwattr $C$DW$427, DW_AT_decl_column(0x1b)
    4404                    
    4405                            .dwattr $C$DW$T$218, DW_AT_decl_file("..\Application\CoP\api_mac.h")
    4406                            .dwattr $C$DW$T$218, DW_AT_decl_line(0x8b2)
    4407                            .dwattr $C$DW$T$218, DW_AT_decl_column(0x05)
    4408                            .dwendtag $C$DW$T$218
    4409                    
    4410                    
    4411                    $C$DW$T$225     .dwtag  DW_TAG_union_type
    4412                            .dwattr $C$DW$T$225, DW_AT_byte_size(0x02)
    4413                    $C$DW$428       .dwtag  DW_TAG_member
    4414                            .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$221)
    4415                            .dwattr $C$DW$428, DW_AT_name("entityId")
    4416                            .dwattr $C$DW$428, DW_AT_TI_symbol_name("entityId")
    4417                            .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4418                            .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4419                            .dwattr $C$DW$428, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4420                            .dwattr $C$DW$428, DW_AT_decl_line(0x1fe)
    4421                            .dwattr $C$DW$428, DW_AT_decl_column(0x14)
    4422                    
    4423                    $C$DW$429       .dwtag  DW_TAG_member
    4424                            .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$224)
    4425                            .dwattr $C$DW$429, DW_AT_name("servId")
    4426                            .dwattr $C$DW$429, DW_AT_TI_symbol_name("servId")
    4427                            .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4428                            .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4429                            .dwattr $C$DW$429, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4430                            .dwattr $C$DW$429, DW_AT_decl_line(0x200)
    4431                            .dwattr $C$DW$429, DW_AT_decl_column(0x17)
    4432                    
    4433                            .dwattr $C$DW$T$225, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    4434                            .dwattr $C$DW$T$225, DW_AT_decl_line(0x1fc)
    4435                            .dwattr $C$DW$T$225, DW_AT_decl_column(0x03)
    4436                            .dwendtag $C$DW$T$225
    4437                    
    4438                    
    4439                    $C$DW$T$226     .dwtag  DW_TAG_union_type
    4440                            .dwattr $C$DW$T$226, DW_AT_byte_size(0x02)
    4441                    $C$DW$430       .dwtag  DW_TAG_member
    4442                            .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$224)
    4443                            .dwattr $C$DW$430, DW_AT_name("servId")
    4444                            .dwattr $C$DW$430, DW_AT_TI_symbol_name("servId")
    4445                            .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4446                            .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4447                            .dwattr $C$DW$430, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4448                            .dwattr $C$DW$430, DW_AT_decl_line(0x211)
    4449                            .dwattr $C$DW$430, DW_AT_decl_column(0x17)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   82

    4450                    
    4451                    $C$DW$431       .dwtag  DW_TAG_member
    4452                            .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$221)
    4453                            .dwattr $C$DW$431, DW_AT_name("entityId")
    4454                            .dwattr $C$DW$431, DW_AT_TI_symbol_name("entityId")
    4455                            .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4456                            .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4457                            .dwattr $C$DW$431, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4458                            .dwattr $C$DW$431, DW_AT_decl_line(0x213)
    4459                            .dwattr $C$DW$431, DW_AT_decl_column(0x14)
    4460                    
    4461                            .dwattr $C$DW$T$226, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    4462                            .dwattr $C$DW$T$226, DW_AT_decl_line(0x20f)
    4463                            .dwattr $C$DW$T$226, DW_AT_decl_column(0x03)
    4464                            .dwendtag $C$DW$T$226
    4465                    
    4466                    
    4467                    $C$DW$T$232     .dwtag  DW_TAG_union_type
    4468                            .dwattr $C$DW$T$232, DW_AT_byte_size(0x04)
    4469                    $C$DW$432       .dwtag  DW_TAG_member
    4470                            .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$227)
    4471                            .dwattr $C$DW$432, DW_AT_name("f")
    4472                            .dwattr $C$DW$432, DW_AT_TI_symbol_name("f")
    4473                            .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4474                            .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4475                            .dwattr $C$DW$432, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    4476                            .dwattr $C$DW$432, DW_AT_decl_line(0xb7)
    4477                            .dwattr $C$DW$432, DW_AT_decl_column(0x0f)
    4478                    
    4479                    $C$DW$433       .dwtag  DW_TAG_member
    4480                            .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$231)
    4481                            .dwattr $C$DW$433, DW_AT_name("a")
    4482                            .dwattr $C$DW$433, DW_AT_TI_symbol_name("a")
    4483                            .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4484                            .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4485                            .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    4486                            .dwattr $C$DW$433, DW_AT_decl_line(0xb8)
    4487                            .dwattr $C$DW$433, DW_AT_decl_column(0x0f)
    4488                    
    4489                            .dwattr $C$DW$T$232, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    4490                            .dwattr $C$DW$T$232, DW_AT_decl_line(0xb6)
    4491                            .dwattr $C$DW$T$232, DW_AT_decl_column(0x0f)
    4492                            .dwendtag $C$DW$T$232
    4493                    
    4494                    $C$DW$T$904     .dwtag  DW_TAG_typedef
    4495                            .dwattr $C$DW$T$904, DW_AT_name("xdc_FloatData")
    4496                            .dwattr $C$DW$T$904, DW_AT_type(*$C$DW$T$232)
    4497                            .dwattr $C$DW$T$904, DW_AT_language(DW_LANG_C)
    4498                            .dwattr $C$DW$T$904, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    4499                            .dwattr $C$DW$T$904, DW_AT_decl_line(0xb9)
    4500                            .dwattr $C$DW$T$904, DW_AT_decl_column(0x03)
    4501                    
    4502                    
    4503                    $C$DW$T$233     .dwtag  DW_TAG_structure_type
    4504                            .dwattr $C$DW$T$233, DW_AT_name(".ggroup1")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   83

    4505                            .dwattr $C$DW$T$233, DW_AT_byte_size(0x4c)
    4506                    $C$DW$434       .dwtag  DW_TAG_member
    4507                            .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$9)
    4508                            .dwattr $C$DW$434, DW_AT_name("numRxMsgs")
    4509                            .dwattr $C$DW$434, DW_AT_TI_symbol_name("numRxMsgs")
    4510                            .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4511                            .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4512                    
    4513                    $C$DW$435       .dwtag  DW_TAG_member
    4514                            .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$9)
    4515                            .dwattr $C$DW$435, DW_AT_name("numTxMsgs")
    4516                            .dwattr $C$DW$435, DW_AT_TI_symbol_name("numTxMsgs")
    4517                            .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4518                            .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4519                    
    4520                    $C$DW$436       .dwtag  DW_TAG_member
    4521                            .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$412)
    4522                            .dwattr $C$DW$436, DW_AT_name("macCallbacks")
    4523                            .dwattr $C$DW$436, DW_AT_TI_symbol_name("macCallbacks")
    4524                            .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4525                            .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4526                    
    4527                            .dwendtag $C$DW$T$233
    4528                    
    4529                    
    4530                    $C$DW$T$906     .dwtag  DW_TAG_enumeration_type
    4531                            .dwattr $C$DW$T$906, DW_AT_name("CC1350_LAUNCHXL_ADCBuf0ChannelName")
    4532                            .dwattr $C$DW$T$906, DW_AT_byte_size(0x01)
    4533                    $C$DW$437       .dwtag  DW_TAG_enumerator
    4534                            .dwattr $C$DW$437, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL0")
    4535                            .dwattr $C$DW$437, DW_AT_const_value(0x00)
    4536                            .dwattr $C$DW$437, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4537                            .dwattr $C$DW$437, DW_AT_decl_line(0xba)
    4538                            .dwattr $C$DW$437, DW_AT_decl_column(0x05)
    4539                    
    4540                    $C$DW$438       .dwtag  DW_TAG_enumerator
    4541                            .dwattr $C$DW$438, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL1")
    4542                            .dwattr $C$DW$438, DW_AT_const_value(0x01)
    4543                            .dwattr $C$DW$438, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4544                            .dwattr $C$DW$438, DW_AT_decl_line(0xbb)
    4545                            .dwattr $C$DW$438, DW_AT_decl_column(0x05)
    4546                    
    4547                    $C$DW$439       .dwtag  DW_TAG_enumerator
    4548                            .dwattr $C$DW$439, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL2")
    4549                            .dwattr $C$DW$439, DW_AT_const_value(0x02)
    4550                            .dwattr $C$DW$439, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4551                            .dwattr $C$DW$439, DW_AT_decl_line(0xbc)
    4552                            .dwattr $C$DW$439, DW_AT_decl_column(0x05)
    4553                    
    4554                    $C$DW$440       .dwtag  DW_TAG_enumerator
    4555                            .dwattr $C$DW$440, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL3")
    4556                            .dwattr $C$DW$440, DW_AT_const_value(0x03)
    4557                            .dwattr $C$DW$440, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4558                            .dwattr $C$DW$440, DW_AT_decl_line(0xbd)
    4559                            .dwattr $C$DW$440, DW_AT_decl_column(0x05)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   84

    4560                    
    4561                    $C$DW$441       .dwtag  DW_TAG_enumerator
    4562                            .dwattr $C$DW$441, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL4")
    4563                            .dwattr $C$DW$441, DW_AT_const_value(0x04)
    4564                            .dwattr $C$DW$441, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4565                            .dwattr $C$DW$441, DW_AT_decl_line(0xbe)
    4566                            .dwattr $C$DW$441, DW_AT_decl_column(0x05)
    4567                    
    4568                    $C$DW$442       .dwtag  DW_TAG_enumerator
    4569                            .dwattr $C$DW$442, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL5")
    4570                            .dwattr $C$DW$442, DW_AT_const_value(0x05)
    4571                            .dwattr $C$DW$442, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4572                            .dwattr $C$DW$442, DW_AT_decl_line(0xbf)
    4573                            .dwattr $C$DW$442, DW_AT_decl_column(0x05)
    4574                    
    4575                    $C$DW$443       .dwtag  DW_TAG_enumerator
    4576                            .dwattr $C$DW$443, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL6")
    4577                            .dwattr $C$DW$443, DW_AT_const_value(0x06)
    4578                            .dwattr $C$DW$443, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4579                            .dwattr $C$DW$443, DW_AT_decl_line(0xc0)
    4580                            .dwattr $C$DW$443, DW_AT_decl_column(0x05)
    4581                    
    4582                    $C$DW$444       .dwtag  DW_TAG_enumerator
    4583                            .dwattr $C$DW$444, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL7")
    4584                            .dwattr $C$DW$444, DW_AT_const_value(0x07)
    4585                            .dwattr $C$DW$444, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4586                            .dwattr $C$DW$444, DW_AT_decl_line(0xc1)
    4587                            .dwattr $C$DW$444, DW_AT_decl_column(0x05)
    4588                    
    4589                    $C$DW$445       .dwtag  DW_TAG_enumerator
    4590                            .dwattr $C$DW$445, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELVDDS")
    4591                            .dwattr $C$DW$445, DW_AT_const_value(0x08)
    4592                            .dwattr $C$DW$445, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4593                            .dwattr $C$DW$445, DW_AT_decl_line(0xc2)
    4594                            .dwattr $C$DW$445, DW_AT_decl_column(0x05)
    4595                    
    4596                    $C$DW$446       .dwtag  DW_TAG_enumerator
    4597                            .dwattr $C$DW$446, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELDCOUPL")
    4598                            .dwattr $C$DW$446, DW_AT_const_value(0x09)
    4599                            .dwattr $C$DW$446, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4600                            .dwattr $C$DW$446, DW_AT_decl_line(0xc3)
    4601                            .dwattr $C$DW$446, DW_AT_decl_column(0x05)
    4602                    
    4603                    $C$DW$447       .dwtag  DW_TAG_enumerator
    4604                            .dwattr $C$DW$447, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELVSS")
    4605                            .dwattr $C$DW$447, DW_AT_const_value(0x0a)
    4606                            .dwattr $C$DW$447, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4607                            .dwattr $C$DW$447, DW_AT_decl_line(0xc4)
    4608                            .dwattr $C$DW$447, DW_AT_decl_column(0x05)
    4609                    
    4610                    $C$DW$448       .dwtag  DW_TAG_enumerator
    4611                            .dwattr $C$DW$448, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELCOUNT")
    4612                            .dwattr $C$DW$448, DW_AT_const_value(0x0b)
    4613                            .dwattr $C$DW$448, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4614                            .dwattr $C$DW$448, DW_AT_decl_line(0xc6)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   85

    4615                            .dwattr $C$DW$448, DW_AT_decl_column(0x05)
    4616                    
    4617                            .dwattr $C$DW$T$906, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    4618                            .dwattr $C$DW$T$906, DW_AT_decl_line(0xb9)
    4619                            .dwattr $C$DW$T$906, DW_AT_decl_column(0x0e)
    4620                            .dwendtag $C$DW$T$906
    4621                    
    4622                    $C$DW$T$907     .dwtag  DW_TAG_typedef
    4623                            .dwattr $C$DW$T$907, DW_AT_name("CC1350_LAUNCHXL_ADCBuf0ChannelName")
    4624                            .dwattr $C$DW$T$907, DW_AT_type(*$C$DW$T$906)
    4625                            .dwattr $C$DW$T$907, DW_AT_language(DW_LANG_C)
    4626                            .dwattr $C$DW$T$907, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    4627                            .dwattr $C$DW$T$907, DW_AT_decl_line(0xc7)
    4628                            .dwattr $C$DW$T$907, DW_AT_decl_column(0x03)
    4629                    
    4630                    
    4631                    $C$DW$T$908     .dwtag  DW_TAG_enumeration_type
    4632                            .dwattr $C$DW$T$908, DW_AT_name("CC1350_LAUNCHXL_ADCBufName")
    4633                            .dwattr $C$DW$T$908, DW_AT_byte_size(0x01)
    4634                    $C$DW$449       .dwtag  DW_TAG_enumerator
    4635                            .dwattr $C$DW$449, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0")
    4636                            .dwattr $C$DW$449, DW_AT_const_value(0x00)
    4637                            .dwattr $C$DW$449, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4638                            .dwattr $C$DW$449, DW_AT_decl_line(0xb0)
    4639                            .dwattr $C$DW$449, DW_AT_decl_column(0x05)
    4640                    
    4641                    $C$DW$450       .dwtag  DW_TAG_enumerator
    4642                            .dwattr $C$DW$450, DW_AT_name("CC1350_LAUNCHXL_ADCBUFCOUNT")
    4643                            .dwattr $C$DW$450, DW_AT_const_value(0x01)
    4644                            .dwattr $C$DW$450, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4645                            .dwattr $C$DW$450, DW_AT_decl_line(0xb2)
    4646                            .dwattr $C$DW$450, DW_AT_decl_column(0x05)
    4647                    
    4648                            .dwattr $C$DW$T$908, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    4649                            .dwattr $C$DW$T$908, DW_AT_decl_line(0xaf)
    4650                            .dwattr $C$DW$T$908, DW_AT_decl_column(0x0e)
    4651                            .dwendtag $C$DW$T$908
    4652                    
    4653                    $C$DW$T$909     .dwtag  DW_TAG_typedef
    4654                            .dwattr $C$DW$T$909, DW_AT_name("CC1350_LAUNCHXL_ADCBufName")
    4655                            .dwattr $C$DW$T$909, DW_AT_type(*$C$DW$T$908)
    4656                            .dwattr $C$DW$T$909, DW_AT_language(DW_LANG_C)
    4657                            .dwattr $C$DW$T$909, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    4658                            .dwattr $C$DW$T$909, DW_AT_decl_line(0xb3)
    4659                            .dwattr $C$DW$T$909, DW_AT_decl_column(0x03)
    4660                    
    4661                    
    4662                    $C$DW$T$910     .dwtag  DW_TAG_enumeration_type
    4663                            .dwattr $C$DW$T$910, DW_AT_name("CC1350_LAUNCHXL_ADCName")
    4664                            .dwattr $C$DW$T$910, DW_AT_byte_size(0x01)
    4665                    $C$DW$451       .dwtag  DW_TAG_enumerator
    4666                            .dwattr $C$DW$451, DW_AT_name("CC1350_LAUNCHXL_ADC0")
    4667                            .dwattr $C$DW$451, DW_AT_const_value(0x00)
    4668                            .dwattr $C$DW$451, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4669                            .dwattr $C$DW$451, DW_AT_decl_line(0xce)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{6AE17F5A-20F2-4645-B7A4-1AB2ADD132C7} PAGE   86

    4670                            .dwattr $C$DW$451, DW_AT_decl_column(0x05)
    4671                    
    4672                    $C$DW$452       .dwtag  DW_TAG_enumerator
    4673                            .dwattr $C$DW$452, DW_AT_name("CC1350_LAUNCHXL_ADC1")
    4674                            .dwattr $C$DW$452, DW_AT_const_value(0x01)
    4675                            .dwattr $C$DW$452, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4676                            .dwattr $C$DW$452, DW_AT_decl_line(0xcf)
    4677                            .dwattr $C$DW$452, DW_AT_decl_column(0x05)
    4678                    
    4679                    $C$DW$453       .dwtag  DW_TAG_enumerator
    4680                            .dwattr $C$DW$453, DW_AT_name("CC1350_LAUNCHXL_ADC2")
    4681                            .dwattr $C$DW$453, DW_AT_const_value(0x02)
    4682                            .dwattr $C$DW$453, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4683                            .dwattr $C$DW$453, DW_AT_decl_line(0xd0)
    4684                            .dwattr $C$DW$453, DW_AT_decl_column(0x05)
    4685                    
    4686                    $C$DW$454       .dwtag  DW_TAG_enumerator
    4687                            .dwattr $C$DW$454, DW_AT_name("CC1350_LAUNCHXL_ADC3")
    4688                            .dwattr $C$DW$454, DW_AT_const_value(0x03)
    4689                            .dwattr $C$DW$454, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4690                            .dwattr $C$DW$454, DW_AT_decl_line(0xd1)
    4691                            .dwattr $C$DW$454, DW_AT_decl_column(0x05)
    4692                    
    4693                    $C$DW$455       .dwtag  DW_TAG_enumerator
    4694                            .dwattr $C$DW$455, DW_AT_name("CC1350_LAUNCHXL_ADC4")
    4695                            .dwattr $C$DW$455, DW_AT_const_value(0x04)
    4696                            .dwattr $C$DW$455, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4697                            .dwattr $C$DW$455, DW_AT_decl_line(0xd2)
    4698                            .dwattr $C$DW$455, DW_AT_decl_column(0x05)
    4699                    
    4700                    $C$DW$456       .dwtag  DW_TAG_enumerator
    4701                            .dwattr $C$DW$456, DW_AT_name("CC1350_LAUNCHXL_ADC5")
    4702                            .dwattr $C$DW$456, DW_AT_const_value(0x05)
    4703                            .dwattr $C$DW$456, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4704                            .dwattr $C$DW$456, DW_AT_decl_line(0xd3)
    4705                            .dwattr $C$DW$456, DW_AT_decl_column(0x05)
    4706                    
    4707                    $C$DW$457       .dwtag  DW_TAG_enumerator
    4708                            .dwattr $C$DW$457, DW_AT_name("CC1350_LAUNCHXL_ADC6")
    4709                            .dwattr $C$DW$457, DW_AT_const_value(0x06)
    4710                            .dwattr $C$DW$457, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4711                            .dwattr $C$DW$457, DW_AT_decl_line(0xd4)
    4712                            .dwattr $C$DW$457, DW_AT_decl_column(0x05)
    4713                    
    4714                    $C$DW$458       .dwtag  DW_TAG_enumerator
    4715                            .dwattr $C$DW$458, DW_AT_name("CC1350_LAUNCHXL_ADC7")
    4716                            .dwattr $C$DW$458, DW_AT_const_value(0x07)
    4717                            .dwattr $C$DW$458, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4718                            .dwattr $C$DW$458, DW_AT_decl_line(0xd5)
    4719                            .dwattr $C$DW$458, DW_AT_decl_column(0x05)
    4720                    
    4721                    $C$DW$459       .dwtag  DW_TAG_enumerator
    4722                            .dwattr $C$DW$459, DW_AT_name("CC1350_LAUNCHXL_ADCDCOUPL")
    4723                            .dwattr $C$DW$459, DW_AT_const_value(0x08)
    4724                            .dwattr $C$DW$459, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
