TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Dec 12 17:41:34 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/CoP/MT/mt_sys.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\The_Wonderer\Google Drive\School\2018_3_Semester_Fa
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    5346                    $C$DW$489       .dwtag  DW_TAG_enumerator
    5347                            .dwattr $C$DW$489, DW_AT_name("MTRPC_SYS_MAX")
    5348                            .dwattr $C$DW$489, DW_AT_const_value(0x0a)
    5349                            .dwattr $C$DW$489, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    5350                            .dwattr $C$DW$489, DW_AT_decl_line(0xdc)
    5351                            .dwattr $C$DW$489, DW_AT_decl_column(0x05)
    5352                    
    5353                            .dwattr $C$DW$T$987, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    5354                            .dwattr $C$DW$T$987, DW_AT_decl_line(0xc6)
    5355                            .dwattr $C$DW$T$987, DW_AT_decl_column(0x01)
    5356                            .dwendtag $C$DW$T$987
    5357                    
    5358                    $C$DW$T$988     .dwtag  DW_TAG_typedef
    5359                            .dwattr $C$DW$T$988, DW_AT_name("MtRpc_SysType_t")
    5360                            .dwattr $C$DW$T$988, DW_AT_type(*$C$DW$T$987)
    5361                            .dwattr $C$DW$T$988, DW_AT_language(DW_LANG_C)
    5362                            .dwattr $C$DW$T$988, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    5363                            .dwattr $C$DW$T$988, DW_AT_decl_line(0xdd)
    5364                            .dwattr $C$DW$T$988, DW_AT_decl_column(0x03)
    5365                    
    5366                    
    5367                    $C$DW$T$989     .dwtag  DW_TAG_enumeration_type
    5368                            .dwattr $C$DW$T$989, DW_AT_byte_size(0x01)
    5369                    $C$DW$490       .dwtag  DW_TAG_enumerator
    5370                            .dwattr $C$DW$490, DW_AT_name("MTRPC_EXT_NOTUSED")
    5371                            .dwattr $C$DW$490, DW_AT_const_value(0x00)
    5372                            .dwattr $C$DW$490, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    5373                            .dwattr $C$DW$490, DW_AT_decl_line(0xe3)
    5374                            .dwattr $C$DW$490, DW_AT_decl_column(0x05)
    5375                    
    5376                    $C$DW$491       .dwtag  DW_TAG_enumerator
    5377                            .dwattr $C$DW$491, DW_AT_name("MTRPC_EXT_STACKID")
    5378                            .dwattr $C$DW$491, DW_AT_const_value(0x08)
    5379                            .dwattr $C$DW$491, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    5380                            .dwattr $C$DW$491, DW_AT_decl_line(0xe5)
    5381                            .dwattr $C$DW$491, DW_AT_decl_column(0x05)
    5382                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE   99

    5383                    $C$DW$492       .dwtag  DW_TAG_enumerator
    5384                            .dwattr $C$DW$492, DW_AT_name("MTRPC_EXT_FRAGBLK")
    5385                            .dwattr $C$DW$492, DW_AT_const_value(0x10)
    5386                            .dwattr $C$DW$492, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    5387                            .dwattr $C$DW$492, DW_AT_decl_line(0xe7)
    5388                            .dwattr $C$DW$492, DW_AT_decl_column(0x05)
    5389                    
    5390                    $C$DW$493       .dwtag  DW_TAG_enumerator
    5391                            .dwattr $C$DW$493, DW_AT_name("MTRPC_EXT_FRAGACK")
    5392                            .dwattr $C$DW$493, DW_AT_const_value(0x18)
    5393                            .dwattr $C$DW$493, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    5394                            .dwattr $C$DW$493, DW_AT_decl_line(0xe9)
    5395                            .dwattr $C$DW$493, DW_AT_decl_column(0x05)
    5396                    
    5397                    $C$DW$494       .dwtag  DW_TAG_enumerator
    5398                            .dwattr $C$DW$494, DW_AT_name("MTRPC_EXT_FRAGSTS")
    5399                            .dwattr $C$DW$494, DW_AT_const_value(0x20)
    5400                            .dwattr $C$DW$494, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    5401                            .dwattr $C$DW$494, DW_AT_decl_line(0xeb)
    5402                            .dwattr $C$DW$494, DW_AT_decl_column(0x05)
    5403                    
    5404                            .dwattr $C$DW$T$989, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    5405                            .dwattr $C$DW$T$989, DW_AT_decl_line(0xe1)
    5406                            .dwattr $C$DW$T$989, DW_AT_decl_column(0x01)
    5407                            .dwendtag $C$DW$T$989
    5408                    
    5409                    $C$DW$T$990     .dwtag  DW_TAG_typedef
    5410                            .dwattr $C$DW$T$990, DW_AT_name("MtRpc_ExtType_t")
    5411                            .dwattr $C$DW$T$990, DW_AT_type(*$C$DW$T$989)
    5412                            .dwattr $C$DW$T$990, DW_AT_language(DW_LANG_C)
    5413                            .dwattr $C$DW$T$990, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    5414                            .dwattr $C$DW$T$990, DW_AT_decl_line(0xec)
    5415                            .dwattr $C$DW$T$990, DW_AT_decl_column(0x03)
    5416                    
    5417                    
    5418                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5419                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x0c)
    5420                    $C$DW$495       .dwtag  DW_TAG_member
    5421                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$23)
    5422                            .dwattr $C$DW$495, DW_AT_name("cmd0")
    5423                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("cmd0")
    5424                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5425                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5426                            .dwattr $C$DW$495, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    5427                            .dwattr $C$DW$495, DW_AT_decl_line(0x45)
    5428                            .dwattr $C$DW$495, DW_AT_decl_column(0x0d)
    5429                    
    5430                    $C$DW$496       .dwtag  DW_TAG_member
    5431                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$23)
    5432                            .dwattr $C$DW$496, DW_AT_name("cmd1")
    5433                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("cmd1")
    5434                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5435                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5436                            .dwattr $C$DW$496, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    5437                            .dwattr $C$DW$496, DW_AT_decl_line(0x47)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  100

    5438                            .dwattr $C$DW$496, DW_AT_decl_column(0x0d)
    5439                    
    5440                    $C$DW$497       .dwtag  DW_TAG_member
    5441                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$23)
    5442                            .dwattr $C$DW$497, DW_AT_name("block")
    5443                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("block")
    5444                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5445                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5446                            .dwattr $C$DW$497, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    5447                            .dwattr $C$DW$497, DW_AT_decl_line(0x49)
    5448                            .dwattr $C$DW$497, DW_AT_decl_column(0x0d)
    5449                    
    5450                    $C$DW$498       .dwtag  DW_TAG_member
    5451                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$23)
    5452                            .dwattr $C$DW$498, DW_AT_name("verid")
    5453                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("verid")
    5454                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5455                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5456                            .dwattr $C$DW$498, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    5457                            .dwattr $C$DW$498, DW_AT_decl_line(0x4b)
    5458                            .dwattr $C$DW$498, DW_AT_decl_column(0x0d)
    5459                    
    5460                    $C$DW$499       .dwtag  DW_TAG_member
    5461                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$25)
    5462                            .dwattr $C$DW$499, DW_AT_name("length")
    5463                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("length")
    5464                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5465                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5466                            .dwattr $C$DW$499, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    5467                            .dwattr $C$DW$499, DW_AT_decl_line(0x4d)
    5468                            .dwattr $C$DW$499, DW_AT_decl_column(0x0e)
    5469                    
    5470                    $C$DW$500       .dwtag  DW_TAG_member
    5471                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$3)
    5472                            .dwattr $C$DW$500, DW_AT_name("pData")
    5473                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("pData")
    5474                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5475                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5476                            .dwattr $C$DW$500, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    5477                            .dwattr $C$DW$500, DW_AT_decl_line(0x4f)
    5478                            .dwattr $C$DW$500, DW_AT_decl_column(0x0b)
    5479                    
    5480                            .dwattr $C$DW$T$26, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    5481                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x43)
    5482                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    5483                            .dwendtag $C$DW$T$26
    5484                    
    5485                    $C$DW$T$991     .dwtag  DW_TAG_typedef
    5486                            .dwattr $C$DW$T$991, DW_AT_name("Mt_mpb_t")
    5487                            .dwattr $C$DW$T$991, DW_AT_type(*$C$DW$T$26)
    5488                            .dwattr $C$DW$T$991, DW_AT_language(DW_LANG_C)
    5489                            .dwattr $C$DW$T$991, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    5490                            .dwattr $C$DW$T$991, DW_AT_decl_line(0x50)
    5491                            .dwattr $C$DW$T$991, DW_AT_decl_column(0x03)
    5492                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  101

    5493                    $C$DW$T$992     .dwtag  DW_TAG_pointer_type
    5494                            .dwattr $C$DW$T$992, DW_AT_type(*$C$DW$T$991)
    5495                            .dwattr $C$DW$T$992, DW_AT_address_class(0x20)
    5496                    
    5497                    $C$DW$T$993     .dwtag  DW_TAG_const_type
    5498                            .dwattr $C$DW$T$993, DW_AT_type(*$C$DW$T$992)
    5499                    
    5500                    
    5501                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5502                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    5503                    $C$DW$501       .dwtag  DW_TAG_member
    5504                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$23)
    5505                            .dwattr $C$DW$501, DW_AT_name("rfMode")
    5506                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("rfMode")
    5507                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5508                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5509                            .dwattr $C$DW$501, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5510                            .dwattr $C$DW$501, DW_AT_decl_line(0x421)
    5511                            .dwattr $C$DW$501, DW_AT_decl_column(0x0d)
    5512                    
    5513                    $C$DW$502       .dwtag  DW_TAG_member
    5514                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$28)
    5515                            .dwattr $C$DW$502, DW_AT_name("cpePatchFxn")
    5516                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("cpePatchFxn")
    5517                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5518                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5519                            .dwattr $C$DW$502, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5520                            .dwattr $C$DW$502, DW_AT_decl_line(0x422)
    5521                            .dwattr $C$DW$502, DW_AT_decl_column(0x0c)
    5522                    
    5523                    $C$DW$503       .dwtag  DW_TAG_member
    5524                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$28)
    5525                            .dwattr $C$DW$503, DW_AT_name("mcePatchFxn")
    5526                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("mcePatchFxn")
    5527                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5528                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5529                            .dwattr $C$DW$503, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5530                            .dwattr $C$DW$503, DW_AT_decl_line(0x423)
    5531                            .dwattr $C$DW$503, DW_AT_decl_column(0x0c)
    5532                    
    5533                    $C$DW$504       .dwtag  DW_TAG_member
    5534                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$28)
    5535                            .dwattr $C$DW$504, DW_AT_name("rfePatchFxn")
    5536                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("rfePatchFxn")
    5537                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5538                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5539                            .dwattr $C$DW$504, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5540                            .dwattr $C$DW$504, DW_AT_decl_line(0x424)
    5541                            .dwattr $C$DW$504, DW_AT_decl_column(0x0c)
    5542                    
    5543                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    5544                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x420)
    5545                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    5546                            .dwendtag $C$DW$T$29
    5547                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  102

    5548                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    5549                            .dwattr $C$DW$T$42, DW_AT_name("RF_Mode")
    5550                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$29)
    5551                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    5552                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    5553                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x425)
    5554                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    5555                    
    5556                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    5557                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    5558                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    5559                    
    5560                    
    5561                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5562                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
    5563                    $C$DW$505       .dwtag  DW_TAG_member
    5564                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$31)
    5565                            .dwattr $C$DW$505, DW_AT_name("rawValue")
    5566                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("rawValue")
    5567                            .dwattr $C$DW$505, DW_AT_bit_offset(0x0a)
    5568                            .dwattr $C$DW$505, DW_AT_bit_size(0x16)
    5569                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5570                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5571                            .dwattr $C$DW$505, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5572                            .dwattr $C$DW$505, DW_AT_decl_line(0x3d6)
    5573                            .dwattr $C$DW$505, DW_AT_decl_column(0x0e)
    5574                    
    5575                    $C$DW$506       .dwtag  DW_TAG_member
    5576                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$31)
    5577                            .dwattr $C$DW$506, DW_AT_name("__dummy")
    5578                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("__dummy")
    5579                            .dwattr $C$DW$506, DW_AT_bit_offset(0x01)
    5580                            .dwattr $C$DW$506, DW_AT_bit_size(0x09)
    5581                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5582                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5583                            .dwattr $C$DW$506, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5584                            .dwattr $C$DW$506, DW_AT_decl_line(0x3da)
    5585                            .dwattr $C$DW$506, DW_AT_decl_column(0x0e)
    5586                    
    5587                    $C$DW$507       .dwtag  DW_TAG_member
    5588                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$31)
    5589                            .dwattr $C$DW$507, DW_AT_name("paType")
    5590                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("paType")
    5591                            .dwattr $C$DW$507, DW_AT_bit_offset(0x00)
    5592                            .dwattr $C$DW$507, DW_AT_bit_size(0x01)
    5593                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5594                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5595                            .dwattr $C$DW$507, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5596                            .dwattr $C$DW$507, DW_AT_decl_line(0x3db)
    5597                            .dwattr $C$DW$507, DW_AT_decl_column(0x0e)
    5598                    
    5599                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    5600                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x3d5)
    5601                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    5602                            .dwendtag $C$DW$T$32
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  103

    5603                    
    5604                    $C$DW$T$35      .dwtag  DW_TAG_typedef
    5605                            .dwattr $C$DW$T$35, DW_AT_name("RF_TxPowerTable_Value")
    5606                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$32)
    5607                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    5608                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    5609                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x3df)
    5610                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    5611                    
    5612                    
    5613                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5614                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x05)
    5615                    $C$DW$508       .dwtag  DW_TAG_member
    5616                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$34)
    5617                            .dwattr $C$DW$508, DW_AT_name("power")
    5618                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("power")
    5619                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5620                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5621                            .dwattr $C$DW$508, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5622                            .dwattr $C$DW$508, DW_AT_decl_line(0x3f5)
    5623                            .dwattr $C$DW$508, DW_AT_decl_column(0x0c)
    5624                    
    5625                    $C$DW$509       .dwtag  DW_TAG_member
    5626                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$35)
    5627                            .dwattr $C$DW$509, DW_AT_name("value")
    5628                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("value")
    5629                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5630                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5631                            .dwattr $C$DW$509, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5632                            .dwattr $C$DW$509, DW_AT_decl_line(0x3f8)
    5633                            .dwattr $C$DW$509, DW_AT_decl_column(0x1b)
    5634                    
    5635                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    5636                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x3f4)
    5637                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    5638                            .dwendtag $C$DW$T$36
    5639                    
    5640                    $C$DW$T$37      .dwtag  DW_TAG_typedef
    5641                            .dwattr $C$DW$T$37, DW_AT_name("RF_TxPowerTable_Entry")
    5642                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    5643                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    5644                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    5645                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x3f9)
    5646                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x1b)
    5647                    
    5648                    $C$DW$T$38      .dwtag  DW_TAG_const_type
    5649                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    5650                    
    5651                    $C$DW$T$39      .dwtag  DW_TAG_typedef
    5652                            .dwattr $C$DW$T$39, DW_AT_name("macTxPwrVal_t")
    5653                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    5654                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    5655                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    5656                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x144)
    5657                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x25)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  104

    5658                    
    5659                    $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    5660                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    5661                            .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    5662                    
    5663                    
    5664                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5665                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    5666                    $C$DW$510       .dwtag  DW_TAG_member
    5667                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$40)
    5668                            .dwattr $C$DW$510, DW_AT_name("pTxPwrVals")
    5669                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("pTxPwrVals")
    5670                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5671                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5672                            .dwattr $C$DW$510, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5673                            .dwattr $C$DW$510, DW_AT_decl_line(0x148)
    5674                            .dwattr $C$DW$510, DW_AT_decl_column(0x12)
    5675                    
    5676                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    5677                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x147)
    5678                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    5679                            .dwendtag $C$DW$T$41
    5680                    
    5681                    $C$DW$T$45      .dwtag  DW_TAG_const_type
    5682                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$41)
    5683                    
    5684                    $C$DW$T$46      .dwtag  DW_TAG_typedef
    5685                            .dwattr $C$DW$T$46, DW_AT_name("macTxPwrTbl_t")
    5686                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    5687                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    5688                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    5689                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x149)
    5690                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    5691                    
    5692                    $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    5693                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    5694                            .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    5695                    
    5696                    
    5697                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    5698                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x30)
    5699                    $C$DW$511       .dwtag  DW_TAG_member
    5700                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$31)
    5701                            .dwattr $C$DW$511, DW_AT_name("getHwRevision")
    5702                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("getHwRevision")
    5703                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5704                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5705                            .dwattr $C$DW$511, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5706                            .dwattr $C$DW$511, DW_AT_decl_line(0x155)
    5707                            .dwattr $C$DW$511, DW_AT_decl_column(0x1c)
    5708                    
    5709                    $C$DW$512       .dwtag  DW_TAG_member
    5710                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$43)
    5711                            .dwattr $C$DW$512, DW_AT_name("pRfPatchTable")
    5712                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("pRfPatchTable")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  105

    5713                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5714                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5715                            .dwattr $C$DW$512, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5716                            .dwattr $C$DW$512, DW_AT_decl_line(0x156)
    5717                            .dwattr $C$DW$512, DW_AT_decl_column(0x1d)
    5718                    
    5719                    $C$DW$513       .dwtag  DW_TAG_member
    5720                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$44)
    5721                            .dwattr $C$DW$513, DW_AT_name("pRfDrvTblPtr")
    5722                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("pRfDrvTblPtr")
    5723                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5724                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    5725                            .dwattr $C$DW$513, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5726                            .dwattr $C$DW$513, DW_AT_decl_line(0x157)
    5727                            .dwattr $C$DW$513, DW_AT_decl_column(0x1d)
    5728                    
    5729                    $C$DW$514       .dwtag  DW_TAG_member
    5730                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$44)
    5731                            .dwattr $C$DW$514, DW_AT_name("pCryptoDrvTblPtr")
    5732                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("pCryptoDrvTblPtr")
    5733                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5734                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    5735                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5736                            .dwattr $C$DW$514, DW_AT_decl_line(0x158)
    5737                            .dwattr $C$DW$514, DW_AT_decl_column(0x1d)
    5738                    
    5739                    $C$DW$515       .dwtag  DW_TAG_member
    5740                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$47)
    5741                            .dwattr $C$DW$515, DW_AT_name("pTxPwrTbl")
    5742                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("pTxPwrTbl")
    5743                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5744                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    5745                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5746                            .dwattr $C$DW$515, DW_AT_decl_line(0x159)
    5747                            .dwattr $C$DW$515, DW_AT_decl_column(0x20)
    5748                    
    5749                    $C$DW$516       .dwtag  DW_TAG_member
    5750                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$48)
    5751                            .dwattr $C$DW$516, DW_AT_name("pOverrides")
    5752                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("pOverrides")
    5753                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5754                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    5755                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5756                            .dwattr $C$DW$516, DW_AT_decl_line(0x15a)
    5757                            .dwattr $C$DW$516, DW_AT_decl_column(0x1e)
    5758                    
    5759                    $C$DW$517       .dwtag  DW_TAG_member
    5760                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$49)
    5761                            .dwattr $C$DW$517, DW_AT_name("pLoDivider")
    5762                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("pLoDivider")
    5763                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5764                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    5765                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5766                            .dwattr $C$DW$517, DW_AT_decl_line(0x15b)
    5767                            .dwattr $C$DW$517, DW_AT_decl_column(0x1d)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  106

    5768                    
    5769                    $C$DW$518       .dwtag  DW_TAG_member
    5770                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$23)
    5771                            .dwattr $C$DW$518, DW_AT_name("rfFeModeBias")
    5772                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("rfFeModeBias")
    5773                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5774                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    5775                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5776                            .dwattr $C$DW$518, DW_AT_decl_line(0x15c)
    5777                            .dwattr $C$DW$518, DW_AT_decl_column(0x1c)
    5778                    
    5779                    $C$DW$519       .dwtag  DW_TAG_member
    5780                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$23)
    5781                            .dwattr $C$DW$519, DW_AT_name("phyId")
    5782                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("phyId")
    5783                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5784                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    5785                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5786                            .dwattr $C$DW$519, DW_AT_decl_line(0x15d)
    5787                            .dwattr $C$DW$519, DW_AT_decl_column(0x1c)
    5788                    
    5789                    $C$DW$520       .dwtag  DW_TAG_member
    5790                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$23)
    5791                            .dwattr $C$DW$520, DW_AT_name("last")
    5792                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("last")
    5793                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5794                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    5795                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5796                            .dwattr $C$DW$520, DW_AT_decl_line(0x15e)
    5797                            .dwattr $C$DW$520, DW_AT_decl_column(0x1c)
    5798                    
    5799                    $C$DW$521       .dwtag  DW_TAG_member
    5800                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$52)
    5801                            .dwattr $C$DW$521, DW_AT_name("pSetRE")
    5802                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("pSetRE")
    5803                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5804                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    5805                            .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5806                            .dwattr $C$DW$521, DW_AT_decl_line(0x15f)
    5807                            .dwattr $C$DW$521, DW_AT_decl_column(0x1c)
    5808                    
    5809                    $C$DW$522       .dwtag  DW_TAG_member
    5810                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$53)
    5811                            .dwattr $C$DW$522, DW_AT_name("pAssertFP")
    5812                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("pAssertFP")
    5813                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5814                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    5815                            .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5816                            .dwattr $C$DW$522, DW_AT_decl_line(0x160)
    5817                            .dwattr $C$DW$522, DW_AT_decl_column(0x1c)
    5818                    
    5819                    $C$DW$523       .dwtag  DW_TAG_member
    5820                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$56)
    5821                            .dwattr $C$DW$523, DW_AT_name("pAntSwitchFP")
    5822                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("pAntSwitchFP")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  107

    5823                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5824                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    5825                            .dwattr $C$DW$523, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5826                            .dwattr $C$DW$523, DW_AT_decl_line(0x161)
    5827                            .dwattr $C$DW$523, DW_AT_decl_column(0x1c)
    5828                    
    5829                    $C$DW$524       .dwtag  DW_TAG_member
    5830                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$57)
    5831                            .dwattr $C$DW$524, DW_AT_name("pAntPwrFP")
    5832                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("pAntPwrFP")
    5833                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5834                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    5835                            .dwattr $C$DW$524, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    5836                            .dwattr $C$DW$524, DW_AT_decl_line(0x162)
    5837                            .dwattr $C$DW$524, DW_AT_decl_column(0x1c)
    5838                    
    5839                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    5840                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x154)
    5841                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    5842                            .dwendtag $C$DW$T$58
    5843                    
    5844                    $C$DW$T$64      .dwtag  DW_TAG_typedef
    5845                            .dwattr $C$DW$T$64, DW_AT_name("macUserCfg_t")
    5846                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$58)
    5847                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    5848                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    5849                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x163)
    5850                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    5851                    
    5852                    
    5853                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
    5854                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x5c)
    5855                    $C$DW$525       .dwtag  DW_TAG_member
    5856                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$59)
    5857                            .dwattr $C$DW$525, DW_AT_name("extendedAddress")
    5858                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("extendedAddress")
    5859                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5860                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    5861                            .dwattr $C$DW$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5862                            .dwattr $C$DW$525, DW_AT_decl_line(0x47)
    5863                            .dwattr $C$DW$525, DW_AT_decl_column(0x0d)
    5864                    
    5865                    $C$DW$526       .dwtag  DW_TAG_member
    5866                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$60)
    5867                            .dwattr $C$DW$526, DW_AT_name("nvFps")
    5868                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("nvFps")
    5869                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5870                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    5871                            .dwattr $C$DW$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5872                            .dwattr $C$DW$526, DW_AT_decl_line(0x4a)
    5873                            .dwattr $C$DW$526, DW_AT_decl_column(0x17)
    5874                    
    5875                    $C$DW$527       .dwtag  DW_TAG_member
    5876                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$63)
    5877                            .dwattr $C$DW$527, DW_AT_name("applicationEntityID")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  108

    5878                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("applicationEntityID")
    5879                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5880                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    5881                            .dwattr $C$DW$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5882                            .dwattr $C$DW$527, DW_AT_decl_line(0x4d)
    5883                            .dwattr $C$DW$527, DW_AT_decl_column(0x14)
    5884                    
    5885                    $C$DW$528       .dwtag  DW_TAG_member
    5886                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$23)
    5887                            .dwattr $C$DW$528, DW_AT_name("initFail")
    5888                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("initFail")
    5889                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    5890                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    5891                            .dwattr $C$DW$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5892                            .dwattr $C$DW$528, DW_AT_decl_line(0x50)
    5893                            .dwattr $C$DW$528, DW_AT_decl_column(0x0d)
    5894                    
    5895                    $C$DW$529       .dwtag  DW_TAG_member
    5896                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$64)
    5897                            .dwattr $C$DW$529, DW_AT_name("macConfig")
    5898                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("macConfig")
    5899                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5900                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    5901                            .dwattr $C$DW$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5902                            .dwattr $C$DW$529, DW_AT_decl_line(0x53)
    5903                            .dwattr $C$DW$529, DW_AT_decl_column(0x12)
    5904                    
    5905                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    5906                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x45)
    5907                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
    5908                            .dwendtag $C$DW$T$65
    5909                    
    5910                    $C$DW$T$997     .dwtag  DW_TAG_typedef
    5911                            .dwattr $C$DW$T$997, DW_AT_name("mac_Config_t")
    5912                            .dwattr $C$DW$T$997, DW_AT_type(*$C$DW$T$65)
    5913                            .dwattr $C$DW$T$997, DW_AT_language(DW_LANG_C)
    5914                            .dwattr $C$DW$T$997, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    5915                            .dwattr $C$DW$T$997, DW_AT_decl_line(0x55)
    5916                            .dwattr $C$DW$T$997, DW_AT_decl_column(0x03)
    5917                    
    5918                    
    5919                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    5920                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x10)
    5921                    $C$DW$530       .dwtag  DW_TAG_member
    5922                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$14)
    5923                            .dwattr $C$DW$530, DW_AT_name("__max_align1")
    5924                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("__max_align1")
    5925                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5926                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    5927                            .dwattr $C$DW$530, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    5928                            .dwattr $C$DW$530, DW_AT_decl_line(0x70)
    5929                            .dwattr $C$DW$530, DW_AT_decl_column(0x0c)
    5930                    
    5931                    $C$DW$531       .dwtag  DW_TAG_member
    5932                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$18)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  109

    5933                            .dwattr $C$DW$531, DW_AT_name("__max_align2")
    5934                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("__max_align2")
    5935                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5936                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    5937                            .dwattr $C$DW$531, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    5938                            .dwattr $C$DW$531, DW_AT_decl_line(0x71)
    5939                            .dwattr $C$DW$531, DW_AT_decl_column(0x0e)
    5940                    
    5941                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    5942                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x6f)
    5943                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x10)
    5944                            .dwendtag $C$DW$T$66
    5945                    
    5946                    $C$DW$T$999     .dwtag  DW_TAG_typedef
    5947                            .dwattr $C$DW$T$999, DW_AT_name("__max_align_t")
    5948                            .dwattr $C$DW$T$999, DW_AT_type(*$C$DW$T$66)
    5949                            .dwattr $C$DW$T$999, DW_AT_language(DW_LANG_C)
    5950                            .dwattr $C$DW$T$999, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    5951                            .dwattr $C$DW$T$999, DW_AT_decl_line(0x72)
    5952                            .dwattr $C$DW$T$999, DW_AT_decl_column(0x03)
    5953                    
    5954                    
    5955                    $C$DW$T$97      .dwtag  DW_TAG_structure_type
    5956                            .dwattr $C$DW$T$97, DW_AT_byte_size(0x4c)
    5957                    $C$DW$532       .dwtag  DW_TAG_member
    5958                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$69)
    5959                            .dwattr $C$DW$532, DW_AT_name("Crc32")
    5960                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("Crc32")
    5961                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5962                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    5963                            .dwattr $C$DW$532, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5964                            .dwattr $C$DW$532, DW_AT_decl_line(0x76)
    5965                            .dwattr $C$DW$532, DW_AT_decl_column(0x25)
    5966                    
    5967                    $C$DW$533       .dwtag  DW_TAG_member
    5968                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$72)
    5969                            .dwattr $C$DW$533, DW_AT_name("FlashGetSize")
    5970                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("FlashGetSize")
    5971                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5972                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    5973                            .dwattr $C$DW$533, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5974                            .dwattr $C$DW$533, DW_AT_decl_line(0x77)
    5975                            .dwattr $C$DW$533, DW_AT_decl_column(0x25)
    5976                    
    5977                    $C$DW$534       .dwtag  DW_TAG_member
    5978                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$73)
    5979                            .dwattr $C$DW$534, DW_AT_name("GetChipId")
    5980                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("GetChipId")
    5981                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5982                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    5983                            .dwattr $C$DW$534, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5984                            .dwattr $C$DW$534, DW_AT_decl_line(0x78)
    5985                            .dwattr $C$DW$534, DW_AT_decl_column(0x25)
    5986                    
    5987                    $C$DW$535       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  110

    5988                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$76)
    5989                            .dwattr $C$DW$535, DW_AT_name("ReservedLocation1")
    5990                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("ReservedLocation1")
    5991                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5992                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    5993                            .dwattr $C$DW$535, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5994                            .dwattr $C$DW$535, DW_AT_decl_line(0x79)
    5995                            .dwattr $C$DW$535, DW_AT_decl_column(0x25)
    5996                    
    5997                    $C$DW$536       .dwtag  DW_TAG_member
    5998                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$77)
    5999                            .dwattr $C$DW$536, DW_AT_name("ReservedLocation2")
    6000                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("ReservedLocation2")
    6001                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6002                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    6003                            .dwattr $C$DW$536, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6004                            .dwattr $C$DW$536, DW_AT_decl_line(0x7a)
    6005                            .dwattr $C$DW$536, DW_AT_decl_column(0x25)
    6006                    
    6007                    $C$DW$537       .dwtag  DW_TAG_member
    6008                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$78)
    6009                            .dwattr $C$DW$537, DW_AT_name("ReservedLocation3")
    6010                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("ReservedLocation3")
    6011                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6012                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6013                            .dwattr $C$DW$537, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6014                            .dwattr $C$DW$537, DW_AT_decl_line(0x7b)
    6015                            .dwattr $C$DW$537, DW_AT_decl_column(0x25)
    6016                    
    6017                    $C$DW$538       .dwtag  DW_TAG_member
    6018                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$79)
    6019                            .dwattr $C$DW$538, DW_AT_name("ResetDevice")
    6020                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("ResetDevice")
    6021                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6022                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6023                            .dwattr $C$DW$538, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6024                            .dwattr $C$DW$538, DW_AT_decl_line(0x7c)
    6025                            .dwattr $C$DW$538, DW_AT_decl_column(0x25)
    6026                    
    6027                    $C$DW$539       .dwtag  DW_TAG_member
    6028                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$83)
    6029                            .dwattr $C$DW$539, DW_AT_name("Fletcher32")
    6030                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("Fletcher32")
    6031                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6032                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6033                            .dwattr $C$DW$539, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6034                            .dwattr $C$DW$539, DW_AT_decl_line(0x7d)
    6035                            .dwattr $C$DW$539, DW_AT_decl_column(0x25)
    6036                    
    6037                    $C$DW$540       .dwtag  DW_TAG_member
    6038                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$86)
    6039                            .dwattr $C$DW$540, DW_AT_name("MinValue")
    6040                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("MinValue")
    6041                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6042                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  111

    6043                            .dwattr $C$DW$540, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6044                            .dwattr $C$DW$540, DW_AT_decl_line(0x7e)
    6045                            .dwattr $C$DW$540, DW_AT_decl_column(0x25)
    6046                    
    6047                    $C$DW$541       .dwtag  DW_TAG_member
    6048                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$87)
    6049                            .dwattr $C$DW$541, DW_AT_name("MaxValue")
    6050                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("MaxValue")
    6051                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6052                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6053                            .dwattr $C$DW$541, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6054                            .dwattr $C$DW$541, DW_AT_decl_line(0x7f)
    6055                            .dwattr $C$DW$541, DW_AT_decl_column(0x25)
    6056                    
    6057                    $C$DW$542       .dwtag  DW_TAG_member
    6058                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$88)
    6059                            .dwattr $C$DW$542, DW_AT_name("MeanValue")
    6060                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("MeanValue")
    6061                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6062                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6063                            .dwattr $C$DW$542, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6064                            .dwattr $C$DW$542, DW_AT_decl_line(0x80)
    6065                            .dwattr $C$DW$542, DW_AT_decl_column(0x25)
    6066                    
    6067                    $C$DW$543       .dwtag  DW_TAG_member
    6068                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$89)
    6069                            .dwattr $C$DW$543, DW_AT_name("StandDeviationValue")
    6070                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("StandDeviationValue")
    6071                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6072                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6073                            .dwattr $C$DW$543, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6074                            .dwattr $C$DW$543, DW_AT_decl_line(0x81)
    6075                            .dwattr $C$DW$543, DW_AT_decl_column(0x25)
    6076                    
    6077                    $C$DW$544       .dwtag  DW_TAG_member
    6078                            .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$90)
    6079                            .dwattr $C$DW$544, DW_AT_name("ReservedLocation4")
    6080                            .dwattr $C$DW$544, DW_AT_TI_symbol_name("ReservedLocation4")
    6081                            .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6082                            .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    6083                            .dwattr $C$DW$544, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6084                            .dwattr $C$DW$544, DW_AT_decl_line(0x82)
    6085                            .dwattr $C$DW$544, DW_AT_decl_column(0x25)
    6086                    
    6087                    $C$DW$545       .dwtag  DW_TAG_member
    6088                            .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$91)
    6089                            .dwattr $C$DW$545, DW_AT_name("ReservedLocation5")
    6090                            .dwattr $C$DW$545, DW_AT_TI_symbol_name("ReservedLocation5")
    6091                            .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6092                            .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    6093                            .dwattr $C$DW$545, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6094                            .dwattr $C$DW$545, DW_AT_decl_line(0x83)
    6095                            .dwattr $C$DW$545, DW_AT_decl_column(0x25)
    6096                    
    6097                    $C$DW$546       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  112

    6098                            .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$92)
    6099                            .dwattr $C$DW$546, DW_AT_name("HFSourceSafeSwitch")
    6100                            .dwattr $C$DW$546, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    6101                            .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6102                            .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    6103                            .dwattr $C$DW$546, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6104                            .dwattr $C$DW$546, DW_AT_decl_line(0x84)
    6105                            .dwattr $C$DW$546, DW_AT_decl_column(0x25)
    6106                    
    6107                    $C$DW$547       .dwtag  DW_TAG_member
    6108                            .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$93)
    6109                            .dwattr $C$DW$547, DW_AT_name("SelectCompAInput")
    6110                            .dwattr $C$DW$547, DW_AT_TI_symbol_name("SelectCompAInput")
    6111                            .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6112                            .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    6113                            .dwattr $C$DW$547, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6114                            .dwattr $C$DW$547, DW_AT_decl_line(0x85)
    6115                            .dwattr $C$DW$547, DW_AT_decl_column(0x25)
    6116                    
    6117                    $C$DW$548       .dwtag  DW_TAG_member
    6118                            .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$94)
    6119                            .dwattr $C$DW$548, DW_AT_name("SelectCompARef")
    6120                            .dwattr $C$DW$548, DW_AT_TI_symbol_name("SelectCompARef")
    6121                            .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6122                            .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    6123                            .dwattr $C$DW$548, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6124                            .dwattr $C$DW$548, DW_AT_decl_line(0x86)
    6125                            .dwattr $C$DW$548, DW_AT_decl_column(0x25)
    6126                    
    6127                    $C$DW$549       .dwtag  DW_TAG_member
    6128                            .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$95)
    6129                            .dwattr $C$DW$549, DW_AT_name("SelectADCCompBInput")
    6130                            .dwattr $C$DW$549, DW_AT_TI_symbol_name("SelectADCCompBInput")
    6131                            .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6132                            .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    6133                            .dwattr $C$DW$549, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6134                            .dwattr $C$DW$549, DW_AT_decl_line(0x87)
    6135                            .dwattr $C$DW$549, DW_AT_decl_column(0x25)
    6136                    
    6137                    $C$DW$550       .dwtag  DW_TAG_member
    6138                            .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$96)
    6139                            .dwattr $C$DW$550, DW_AT_name("SelectCompBRef")
    6140                            .dwattr $C$DW$550, DW_AT_TI_symbol_name("SelectCompBRef")
    6141                            .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6142                            .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    6143                            .dwattr $C$DW$550, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6144                            .dwattr $C$DW$550, DW_AT_decl_line(0x88)
    6145                            .dwattr $C$DW$550, DW_AT_decl_column(0x25)
    6146                    
    6147                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    6148                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x75)
    6149                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x01)
    6150                            .dwendtag $C$DW$T$97
    6151                    
    6152                    $C$DW$T$1000    .dwtag  DW_TAG_typedef
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  113

    6153                            .dwattr $C$DW$T$1000, DW_AT_name("HARD_API_T")
    6154                            .dwattr $C$DW$T$1000, DW_AT_type(*$C$DW$T$97)
    6155                            .dwattr $C$DW$T$1000, DW_AT_language(DW_LANG_C)
    6156                            .dwattr $C$DW$T$1000, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\device
    6157                            .dwattr $C$DW$T$1000, DW_AT_decl_line(0x89)
    6158                            .dwattr $C$DW$T$1000, DW_AT_decl_column(0x03)
    6159                    
    6160                    
    6161                    $C$DW$T$100     .dwtag  DW_TAG_structure_type
    6162                            .dwattr $C$DW$T$100, DW_AT_byte_size(0x0a)
    6163                    $C$DW$551       .dwtag  DW_TAG_member
    6164                            .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$416)
    6165                            .dwattr $C$DW$551, DW_AT_name("addr")
    6166                            .dwattr $C$DW$551, DW_AT_TI_symbol_name("addr")
    6167                            .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6168                            .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    6169                            .dwattr $C$DW$551, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    6170                            .dwattr $C$DW$551, DW_AT_decl_line(0x4db)
    6171                            .dwattr $C$DW$551, DW_AT_decl_column(0x07)
    6172                    
    6173                    $C$DW$552       .dwtag  DW_TAG_member
    6174                            .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$99)
    6175                            .dwattr $C$DW$552, DW_AT_name("addrMode")
    6176                            .dwattr $C$DW$552, DW_AT_TI_symbol_name("addrMode")
    6177                            .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6178                            .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    6179                            .dwattr $C$DW$552, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    6180                            .dwattr $C$DW$552, DW_AT_decl_line(0x4de)
    6181                            .dwattr $C$DW$552, DW_AT_decl_column(0x17)
    6182                    
    6183                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    6184                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x4d0)
    6185                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x01)
    6186                            .dwendtag $C$DW$T$100
    6187                    
    6188                    $C$DW$T$631     .dwtag  DW_TAG_typedef
    6189                            .dwattr $C$DW$T$631, DW_AT_name("ApiMac_sAddr_t")
    6190                            .dwattr $C$DW$T$631, DW_AT_type(*$C$DW$T$100)
    6191                            .dwattr $C$DW$T$631, DW_AT_language(DW_LANG_C)
    6192                            .dwattr $C$DW$T$631, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    6193                            .dwattr $C$DW$T$631, DW_AT_decl_line(0x4df)
    6194                            .dwattr $C$DW$T$631, DW_AT_decl_column(0x03)
    6195                    
    6196                    
    6197                    $C$DW$T$101     .dwtag  DW_TAG_structure_type
    6198                            .dwattr $C$DW$T$101, DW_AT_byte_size(0x08)
    6199                    $C$DW$553       .dwtag  DW_TAG_member
    6200                            .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$31)
    6201                            .dwattr $C$DW$553, DW_AT_name("frameCounter")
    6202                            .dwattr $C$DW$553, DW_AT_TI_symbol_name("frameCounter")
    6203                            .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6204                            .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    6205                            .dwattr $C$DW$553, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    6206                            .dwattr $C$DW$553, DW_AT_decl_line(0x575)
    6207                            .dwattr $C$DW$553, DW_AT_decl_column(0x1a)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  114

    6208                    
    6209                    $C$DW$554       .dwtag  DW_TAG_member
    6210                            .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$25)
    6211                            .dwattr $C$DW$554, DW_AT_name("keyIdx")
    6212                            .dwattr $C$DW$554, DW_AT_TI_symbol_name("keyIdx")
    6213                            .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6214                            .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    6215                            .dwattr $C$DW$554, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    6216                            .dwattr $C$DW$554, DW_AT_decl_line(0x576)
    6217                            .dwattr $C$DW$554, DW_AT_decl_column(0x1a)
    6218                    
    6219                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    6220                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x574)
    6221                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x01)
    6222                            .dwendtag $C$DW$T$101
    6223                    
    6224                    $C$DW$T$690     .dwtag  DW_TAG_typedef
    6225                            .dwattr $C$DW$T$690, DW_AT_name("ApiMac_frameCntr_t")
    6226                            .dwattr $C$DW$T$690, DW_AT_type(*$C$DW$T$101)
    6227                            .dwattr $C$DW$T$690, DW_AT_language(DW_LANG_C)
    6228                            .dwattr $C$DW$T$690, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    6229                            .dwattr $C$DW$T$690, DW_AT_decl_line(0x577)
    6230                            .dwattr $C$DW$T$690, DW_AT_decl_column(0x03)
    6231                    
    6232                    $C$DW$T$691     .dwtag  DW_TAG_pointer_type
    6233                            .dwattr $C$DW$T$691, DW_AT_type(*$C$DW$T$690)
    6234                            .dwattr $C$DW$T$691, DW_AT_address_class(0x20)
    6235                    
    6236                    
    6237                    $C$DW$T$105     .dwtag  DW_TAG_structure_type
    6238                            .dwattr $C$DW$T$105, DW_AT_byte_size(0x40)
    6239                    $C$DW$555       .dwtag  DW_TAG_member
    6240                            .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$103)
    6241                            .dwattr $C$DW$555, DW_AT_name("beaconType")
    6242                            .dwattr $C$DW$555, DW_AT_TI_symbol_name("beaconType")
    6243                            .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6244                            .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    6245                            .dwattr $C$DW$555, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    6246                            .dwattr $C$DW$555, DW_AT_decl_line(0x886)
    6247                            .dwattr $C$DW$555, DW_AT_decl_column(0x19)
    6248                    
    6249                    $C$DW$556       .dwtag  DW_TAG_member
    6250                            .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$23)
    6251                            .dwattr $C$DW$556, DW_AT_name("bsn")
    6252                            .dwattr $C$DW$556, DW_AT_TI_symbol_name("bsn")
    6253                            .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6254                            .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    6255                            .dwattr $C$DW$556, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    6256                            .dwattr $C$DW$556, DW_AT_decl_line(0x888)
    6257                            .dwattr $C$DW$556, DW_AT_decl_column(0x0d)
    6258                    
    6259                    $C$DW$557       .dwtag  DW_TAG_member
    6260                            .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$104)
    6261                            .dwattr $C$DW$557, DW_AT_name("panDesc")
    6262                            .dwattr $C$DW$557, DW_AT_TI_symbol_name("panDesc")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  115

    6263                            .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6264                            .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    6265                            .dwattr $C$DW$557, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    6266                            .dwattr $C$DW$557, DW_AT_decl_line(0x88a)
    6267                            .dwattr $C$DW$557, DW_AT_decl_column(0x16)
    6268                    
    6269                    $C$DW$558       .dwtag  DW_TAG_member
    6270                            .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$419)
    6271                            .dwattr $C$DW$558, DW_AT_name("beaconData")
    6272                            .dwattr $C$DW$558, DW_AT_TI_symbol_name("beaconData")
    6273                            .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6274                            .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    6275                            .dwattr $C$DW$558, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    6276                            .dwattr $C$DW$558, DW_AT_decl_line(0x895)
    6277                            .dwattr $C$DW$558, DW_AT_decl_column(0x07)
    6278                    
    6279                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    6280                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x884)
    6281                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x01)
    6282                            .dwendtag $C$DW$T$105
    6283                    
    6284                    $C$DW$T$546     .dwtag  DW_TAG_typedef
    6285                            .dwattr $C$DW$T$546, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    6286                            .dwattr $C$DW$T$546, DW_AT_type(*$C$DW$T$105)
    6287                            .dwattr $C$DW$T$546, DW_AT_language(DW_LANG_C)
    6288                            .dwattr $C$DW$T$546, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    6289                            .dwattr $C$DW$T$546, DW_AT_decl_line(0x896)
    6290                            .dwattr $C$DW$T$546, DW_AT_decl_column(0x03)
    6291                    
    6292                    $C$DW$T$547     .dwtag  DW_TAG_pointer_type
    6293                            .dwattr $C$DW$T$547, DW_AT_type(*$C$DW$T$546)
    6294                            .dwattr $C$DW$T$547, DW_AT_address_class(0x20)
    6295                    
    6296                    
    6297                    $C$DW$T$106     .dwtag  DW_TAG_structure_type
    6298                            .dwattr $C$DW$T$106, DW_AT_byte_size(0x08)
    6299                    $C$DW$559       .dwtag  DW_TAG_member
    6300                            .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$10)
    6301                            .dwattr $C$DW$559, DW_AT_name("quot")
    6302                            .dwattr $C$DW$559, DW_AT_TI_symbol_name("quot")
    6303                            .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6304                            .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    6305                            .dwattr $C$DW$559, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    6306                            .dwattr $C$DW$559, DW_AT_decl_line(0x49)
    6307                            .dwattr $C$DW$559, DW_AT_decl_column(0x16)
    6308                    
    6309                    $C$DW$560       .dwtag  DW_TAG_member
    6310                            .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$10)
    6311                            .dwattr $C$DW$560, DW_AT_name("rem")
    6312                            .dwattr $C$DW$560, DW_AT_TI_symbol_name("rem")
    6313                            .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6314                            .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    6315                            .dwattr $C$DW$560, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    6316                            .dwattr $C$DW$560, DW_AT_decl_line(0x49)
    6317                            .dwattr $C$DW$560, DW_AT_decl_column(0x1c)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  116

    6318                    
    6319                            .dwattr $C$DW$T$106, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    6320                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x49)
    6321                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x10)
    6322                            .dwendtag $C$DW$T$106
    6323                    
    6324                    $C$DW$T$1001    .dwtag  DW_TAG_typedef
    6325                            .dwattr $C$DW$T$1001, DW_AT_name("div_t")
    6326                            .dwattr $C$DW$T$1001, DW_AT_type(*$C$DW$T$106)
    6327                            .dwattr $C$DW$T$1001, DW_AT_language(DW_LANG_C)
    6328                            .dwattr $C$DW$T$1001, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    6329                            .dwattr $C$DW$T$1001, DW_AT_decl_line(0x49)
    6330                            .dwattr $C$DW$T$1001, DW_AT_decl_column(0x23)
    6331                    
    6332                    
    6333                    $C$DW$T$107     .dwtag  DW_TAG_structure_type
    6334                            .dwattr $C$DW$T$107, DW_AT_byte_size(0x08)
    6335                    $C$DW$561       .dwtag  DW_TAG_member
    6336                            .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$10)
    6337                            .dwattr $C$DW$561, DW_AT_name("quot")
    6338                            .dwattr $C$DW$561, DW_AT_TI_symbol_name("quot")
    6339                            .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6340                            .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    6341                            .dwattr $C$DW$561, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    6342                            .dwattr $C$DW$561, DW_AT_decl_line(0x4e)
    6343                            .dwattr $C$DW$561, DW_AT_decl_column(0x16)
    6344                    
    6345                    $C$DW$562       .dwtag  DW_TAG_member
    6346                            .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$10)
    6347                            .dwattr $C$DW$562, DW_AT_name("rem")
    6348                            .dwattr $C$DW$562, DW_AT_TI_symbol_name("rem")
    6349                            .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6350                            .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    6351                            .dwattr $C$DW$562, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    6352                            .dwattr $C$DW$562, DW_AT_decl_line(0x4e)
    6353                            .dwattr $C$DW$562, DW_AT_decl_column(0x1c)
    6354                    
    6355                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    6356                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x4e)
    6357                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x10)
    6358                            .dwendtag $C$DW$T$107
    6359                    
    6360                    $C$DW$T$1002    .dwtag  DW_TAG_typedef
    6361                            .dwattr $C$DW$T$1002, DW_AT_name("ldiv_t")
    6362                            .dwattr $C$DW$T$1002, DW_AT_type(*$C$DW$T$107)
    6363                            .dwattr $C$DW$T$1002, DW_AT_language(DW_LANG_C)
    6364                            .dwattr $C$DW$T$1002, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    6365                            .dwattr $C$DW$T$1002, DW_AT_decl_line(0x4e)
    6366                            .dwattr $C$DW$T$1002, DW_AT_decl_column(0x23)
    6367                    
    6368                    
    6369                    $C$DW$T$108     .dwtag  DW_TAG_structure_type
    6370                            .dwattr $C$DW$T$108, DW_AT_byte_size(0x10)
    6371                    $C$DW$563       .dwtag  DW_TAG_member
    6372                            .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$14)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  117

    6373                            .dwattr $C$DW$563, DW_AT_name("quot")
    6374                            .dwattr $C$DW$563, DW_AT_TI_symbol_name("quot")
    6375                            .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6376                            .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    6377                            .dwattr $C$DW$563, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    6378                            .dwattr $C$DW$563, DW_AT_decl_line(0x56)
    6379                            .dwattr $C$DW$563, DW_AT_decl_column(0x1c)
    6380                    
    6381                    $C$DW$564       .dwtag  DW_TAG_member
    6382                            .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$14)
    6383                            .dwattr $C$DW$564, DW_AT_name("rem")
    6384                            .dwattr $C$DW$564, DW_AT_TI_symbol_name("rem")
    6385                            .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6386                            .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    6387                            .dwattr $C$DW$564, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    6388                            .dwattr $C$DW$564, DW_AT_decl_line(0x56)
    6389                            .dwattr $C$DW$564, DW_AT_decl_column(0x22)
    6390                    
    6391                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    6392                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x56)
    6393                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x10)
    6394                            .dwendtag $C$DW$T$108
    6395                    
    6396                    $C$DW$T$1003    .dwtag  DW_TAG_typedef
    6397                            .dwattr $C$DW$T$1003, DW_AT_name("lldiv_t")
    6398                            .dwattr $C$DW$T$1003, DW_AT_type(*$C$DW$T$108)
    6399                            .dwattr $C$DW$T$1003, DW_AT_language(DW_LANG_C)
    6400                            .dwattr $C$DW$T$1003, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    6401                            .dwattr $C$DW$T$1003, DW_AT_decl_line(0x56)
    6402                            .dwattr $C$DW$T$1003, DW_AT_decl_column(0x29)
    6403                    
    6404                    
    6405                    $C$DW$T$113     .dwtag  DW_TAG_structure_type
    6406                            .dwattr $C$DW$T$113, DW_AT_byte_size(0x08)
    6407                    $C$DW$565       .dwtag  DW_TAG_member
    6408                            .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$111)
    6409                            .dwattr $C$DW$565, DW_AT_name("pointerStack")
    6410                            .dwattr $C$DW$565, DW_AT_TI_symbol_name("pointerStack")
    6411                            .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6412                            .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    6413                            .dwattr $C$DW$565, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6414                            .dwattr $C$DW$565, DW_AT_decl_line(0x3f5)
    6415                            .dwattr $C$DW$565, DW_AT_decl_column(0x16)
    6416                    
    6417                    $C$DW$566       .dwtag  DW_TAG_member
    6418                            .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$112)
    6419                            .dwattr $C$DW$566, DW_AT_name("directAPI")
    6420                            .dwattr $C$DW$566, DW_AT_TI_symbol_name("directAPI")
    6421                            .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6422                            .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    6423                            .dwattr $C$DW$566, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6424                            .dwattr $C$DW$566, DW_AT_decl_line(0x3f6)
    6425                            .dwattr $C$DW$566, DW_AT_decl_column(0x15)
    6426                    
    6427                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  118

    6428                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x3f4)
    6429                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x01)
    6430                            .dwendtag $C$DW$T$113
    6431                    
    6432                    $C$DW$T$115     .dwtag  DW_TAG_typedef
    6433                            .dwattr $C$DW$T$115, DW_AT_name("icall_directAPIMsg_t")
    6434                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$113)
    6435                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    6436                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6437                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x3f7)
    6438                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x03)
    6439                    
    6440                    
    6441                    $C$DW$T$116     .dwtag  DW_TAG_structure_type
    6442                            .dwattr $C$DW$T$116, DW_AT_byte_size(0x14)
    6443                    $C$DW$567       .dwtag  DW_TAG_member
    6444                            .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$114)
    6445                            .dwattr $C$DW$567, DW_AT_name("hdr")
    6446                            .dwattr $C$DW$567, DW_AT_TI_symbol_name("hdr")
    6447                            .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6448                            .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    6449                            .dwattr $C$DW$567, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6450                            .dwattr $C$DW$567, DW_AT_decl_line(0x3fb)
    6451                            .dwattr $C$DW$567, DW_AT_decl_column(0x10)
    6452                    
    6453                    $C$DW$568       .dwtag  DW_TAG_member
    6454                            .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$115)
    6455                            .dwattr $C$DW$568, DW_AT_name("msg")
    6456                            .dwattr $C$DW$568, DW_AT_TI_symbol_name("msg")
    6457                            .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6458                            .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    6459                            .dwattr $C$DW$568, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6460                            .dwattr $C$DW$568, DW_AT_decl_line(0x3fc)
    6461                            .dwattr $C$DW$568, DW_AT_decl_column(0x1a)
    6462                    
    6463                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6464                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x3fa)
    6465                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x01)
    6466                            .dwendtag $C$DW$T$116
    6467                    
    6468                    $C$DW$T$1004    .dwtag  DW_TAG_typedef
    6469                            .dwattr $C$DW$T$1004, DW_AT_name("icallLiteMsg_t")
    6470                            .dwattr $C$DW$T$1004, DW_AT_type(*$C$DW$T$116)
    6471                            .dwattr $C$DW$T$1004, DW_AT_language(DW_LANG_C)
    6472                            .dwattr $C$DW$T$1004, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    6473                            .dwattr $C$DW$T$1004, DW_AT_decl_line(0x3fd)
    6474                            .dwattr $C$DW$T$1004, DW_AT_decl_column(0x03)
    6475                    
    6476                    
    6477                    $C$DW$T$117     .dwtag  DW_TAG_structure_type
    6478                            .dwattr $C$DW$T$117, DW_AT_byte_size(0x08)
    6479                    $C$DW$569       .dwtag  DW_TAG_member
    6480                            .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$49)
    6481                            .dwattr $C$DW$569, DW_AT_name("pCurrEntry")
    6482                            .dwattr $C$DW$569, DW_AT_TI_symbol_name("pCurrEntry")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{DAB99997-6FCC-4C27-96C2-D192225EFE57} PAGE  119

    6483                            .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6484                            .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    6485                            .dwattr $C$DW$569, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6486                            .dwattr $C$DW$569, DW_AT_decl_line(0x41)
    6487                            .dwattr $C$DW$569, DW_AT_decl_column(0x0d)
    6488                    
    6489                    $C$DW$570       .dwtag  DW_TAG_member
    6490                            .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$49)
    6491                            .dwattr $C$DW$570, DW_AT_name("pLastEntry")
    6492                            .dwattr $C$DW$570, DW_AT_TI_symbol_name("pLastEntry")
    6493                            .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6494                            .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    6495                            .dwattr $C$DW$570, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6496                            .dwattr $C$DW$570, DW_AT_decl_line(0x42)
    6497                            .dwattr $C$DW$570, DW_AT_decl_column(0x0d)
    6498                    
    6499                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    6500                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x40)
    6501                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x10)
    6502                            .dwendtag $C$DW$T$117
    6503                    
    6504                    $C$DW$T$809     .dwtag  DW_TAG_typedef
    6505                            .dwattr $C$DW$T$809, DW_AT_name("dataQueue_t")
    6506                            .dwattr $C$DW$T$809, DW_AT_type(*$C$DW$T$117)
    6507                            .dwattr $C$DW$T$809, DW_AT_language(DW_LANG_C)
    6508                            .dwattr $C$DW$T$809, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    6509                            .dwattr $C$DW$T$809, DW_AT_decl_line(0x43)
    6510                            .dwattr $C$DW$T$809, DW_AT_decl_column(0x03)
    6511                    
    6512                    $C$DW$T$810     .dwtag  DW_TAG_pointer_type
    6513                            .dwattr $C$DW$T$810, DW_AT_type(*$C$DW$T$809)
    6514                            .dwattr $C$DW$T$810, DW_AT_address_class(0x20)
    6515                    
    6516                    
    6517                    $C$DW$T$118     .dwtag  DW_TAG_structure_type
    6518                            .dwattr $C$DW$T$118, DW_AT_byte_size(0x01)
    6519                    $C$DW$571       .dwtag  DW_TAG_member
    6520                            .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$23)
    6521                            .dwattr $C$DW$571, DW_AT_name("triggerType")
    6522                            .dwattr $C$DW$571, DW_AT_TI_symbol_name("triggerType")
    6523                            .dwattr $C$DW$571, DW_AT_bit_offset(0x04)
    6524                            .dwattr $C$DW$571, DW_AT_bit_size(0x04)
    6525                            .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6526                            .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    6527                            .dwattr $C$DW$571, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6528                            .dwattr $C$DW$571, DW_AT_decl_line(0x7d)
    6529                            .dwattr $C$DW$571, DW_AT_decl_column(0x0f)
    6530                    
    6531                    $C$DW$572       .dwtag  DW_TAG_member
