TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Dec 12 17:41:37 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/CoP/MT/mt_util.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\The_Wonderer\Google Drive\School\2018_3_Semester_Fa
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    3637                    $C$DW$364       .dwtag  DW_TAG_enumerator
    3638                            .dwattr $C$DW$364, DW_AT_name("MTRPC_SYS_MAX")
    3639                            .dwattr $C$DW$364, DW_AT_const_value(0x0a)
    3640                            .dwattr $C$DW$364, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    3641                            .dwattr $C$DW$364, DW_AT_decl_line(0xdc)
    3642                            .dwattr $C$DW$364, DW_AT_decl_column(0x05)
    3643                    
    3644                            .dwattr $C$DW$T$914, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    3645                            .dwattr $C$DW$T$914, DW_AT_decl_line(0xc6)
    3646                            .dwattr $C$DW$T$914, DW_AT_decl_column(0x01)
    3647                            .dwendtag $C$DW$T$914
    3648                    
    3649                    $C$DW$T$915     .dwtag  DW_TAG_typedef
    3650                            .dwattr $C$DW$T$915, DW_AT_name("MtRpc_SysType_t")
    3651                            .dwattr $C$DW$T$915, DW_AT_type(*$C$DW$T$914)
    3652                            .dwattr $C$DW$T$915, DW_AT_language(DW_LANG_C)
    3653                            .dwattr $C$DW$T$915, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    3654                            .dwattr $C$DW$T$915, DW_AT_decl_line(0xdd)
    3655                            .dwattr $C$DW$T$915, DW_AT_decl_column(0x03)
    3656                    
    3657                    
    3658                    $C$DW$T$916     .dwtag  DW_TAG_enumeration_type
    3659                            .dwattr $C$DW$T$916, DW_AT_byte_size(0x01)
    3660                    $C$DW$365       .dwtag  DW_TAG_enumerator
    3661                            .dwattr $C$DW$365, DW_AT_name("MTRPC_EXT_NOTUSED")
    3662                            .dwattr $C$DW$365, DW_AT_const_value(0x00)
    3663                            .dwattr $C$DW$365, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    3664                            .dwattr $C$DW$365, DW_AT_decl_line(0xe3)
    3665                            .dwattr $C$DW$365, DW_AT_decl_column(0x05)
    3666                    
    3667                    $C$DW$366       .dwtag  DW_TAG_enumerator
    3668                            .dwattr $C$DW$366, DW_AT_name("MTRPC_EXT_STACKID")
    3669                            .dwattr $C$DW$366, DW_AT_const_value(0x08)
    3670                            .dwattr $C$DW$366, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    3671                            .dwattr $C$DW$366, DW_AT_decl_line(0xe5)
    3672                            .dwattr $C$DW$366, DW_AT_decl_column(0x05)
    3673                    
    3674                    $C$DW$367       .dwtag  DW_TAG_enumerator
    3675                            .dwattr $C$DW$367, DW_AT_name("MTRPC_EXT_FRAGBLK")
    3676                            .dwattr $C$DW$367, DW_AT_const_value(0x10)
    3677                            .dwattr $C$DW$367, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    3678                            .dwattr $C$DW$367, DW_AT_decl_line(0xe7)
    3679                            .dwattr $C$DW$367, DW_AT_decl_column(0x05)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   68

    3680                    
    3681                    $C$DW$368       .dwtag  DW_TAG_enumerator
    3682                            .dwattr $C$DW$368, DW_AT_name("MTRPC_EXT_FRAGACK")
    3683                            .dwattr $C$DW$368, DW_AT_const_value(0x18)
    3684                            .dwattr $C$DW$368, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    3685                            .dwattr $C$DW$368, DW_AT_decl_line(0xe9)
    3686                            .dwattr $C$DW$368, DW_AT_decl_column(0x05)
    3687                    
    3688                    $C$DW$369       .dwtag  DW_TAG_enumerator
    3689                            .dwattr $C$DW$369, DW_AT_name("MTRPC_EXT_FRAGSTS")
    3690                            .dwattr $C$DW$369, DW_AT_const_value(0x20)
    3691                            .dwattr $C$DW$369, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    3692                            .dwattr $C$DW$369, DW_AT_decl_line(0xeb)
    3693                            .dwattr $C$DW$369, DW_AT_decl_column(0x05)
    3694                    
    3695                            .dwattr $C$DW$T$916, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    3696                            .dwattr $C$DW$T$916, DW_AT_decl_line(0xe1)
    3697                            .dwattr $C$DW$T$916, DW_AT_decl_column(0x01)
    3698                            .dwendtag $C$DW$T$916
    3699                    
    3700                    $C$DW$T$917     .dwtag  DW_TAG_typedef
    3701                            .dwattr $C$DW$T$917, DW_AT_name("MtRpc_ExtType_t")
    3702                            .dwattr $C$DW$T$917, DW_AT_type(*$C$DW$T$916)
    3703                            .dwattr $C$DW$T$917, DW_AT_language(DW_LANG_C)
    3704                            .dwattr $C$DW$T$917, DW_AT_decl_file("..\Application\CoP\MT\mt_rpc.h")
    3705                            .dwattr $C$DW$T$917, DW_AT_decl_line(0xec)
    3706                            .dwattr $C$DW$T$917, DW_AT_decl_column(0x03)
    3707                    
    3708                    
    3709                    $C$DW$T$145     .dwtag  DW_TAG_structure_type
    3710                            .dwattr $C$DW$T$145, DW_AT_byte_size(0x0c)
    3711                    $C$DW$370       .dwtag  DW_TAG_member
    3712                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$142)
    3713                            .dwattr $C$DW$370, DW_AT_name("cmd0")
    3714                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("cmd0")
    3715                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3716                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3717                            .dwattr $C$DW$370, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    3718                            .dwattr $C$DW$370, DW_AT_decl_line(0x45)
    3719                            .dwattr $C$DW$370, DW_AT_decl_column(0x0d)
    3720                    
    3721                    $C$DW$371       .dwtag  DW_TAG_member
    3722                            .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$142)
    3723                            .dwattr $C$DW$371, DW_AT_name("cmd1")
    3724                            .dwattr $C$DW$371, DW_AT_TI_symbol_name("cmd1")
    3725                            .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3726                            .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3727                            .dwattr $C$DW$371, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    3728                            .dwattr $C$DW$371, DW_AT_decl_line(0x47)
    3729                            .dwattr $C$DW$371, DW_AT_decl_column(0x0d)
    3730                    
    3731                    $C$DW$372       .dwtag  DW_TAG_member
    3732                            .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$142)
    3733                            .dwattr $C$DW$372, DW_AT_name("block")
    3734                            .dwattr $C$DW$372, DW_AT_TI_symbol_name("block")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   69

    3735                            .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3736                            .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3737                            .dwattr $C$DW$372, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    3738                            .dwattr $C$DW$372, DW_AT_decl_line(0x49)
    3739                            .dwattr $C$DW$372, DW_AT_decl_column(0x0d)
    3740                    
    3741                    $C$DW$373       .dwtag  DW_TAG_member
    3742                            .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$142)
    3743                            .dwattr $C$DW$373, DW_AT_name("verid")
    3744                            .dwattr $C$DW$373, DW_AT_TI_symbol_name("verid")
    3745                            .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3746                            .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3747                            .dwattr $C$DW$373, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    3748                            .dwattr $C$DW$373, DW_AT_decl_line(0x4b)
    3749                            .dwattr $C$DW$373, DW_AT_decl_column(0x0d)
    3750                    
    3751                    $C$DW$374       .dwtag  DW_TAG_member
    3752                            .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$144)
    3753                            .dwattr $C$DW$374, DW_AT_name("length")
    3754                            .dwattr $C$DW$374, DW_AT_TI_symbol_name("length")
    3755                            .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3756                            .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3757                            .dwattr $C$DW$374, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    3758                            .dwattr $C$DW$374, DW_AT_decl_line(0x4d)
    3759                            .dwattr $C$DW$374, DW_AT_decl_column(0x0e)
    3760                    
    3761                    $C$DW$375       .dwtag  DW_TAG_member
    3762                            .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$3)
    3763                            .dwattr $C$DW$375, DW_AT_name("pData")
    3764                            .dwattr $C$DW$375, DW_AT_TI_symbol_name("pData")
    3765                            .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3766                            .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3767                            .dwattr $C$DW$375, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    3768                            .dwattr $C$DW$375, DW_AT_decl_line(0x4f)
    3769                            .dwattr $C$DW$375, DW_AT_decl_column(0x0b)
    3770                    
    3771                            .dwattr $C$DW$T$145, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    3772                            .dwattr $C$DW$T$145, DW_AT_decl_line(0x43)
    3773                            .dwattr $C$DW$T$145, DW_AT_decl_column(0x01)
    3774                            .dwendtag $C$DW$T$145
    3775                    
    3776                    $C$DW$T$918     .dwtag  DW_TAG_typedef
    3777                            .dwattr $C$DW$T$918, DW_AT_name("Mt_mpb_t")
    3778                            .dwattr $C$DW$T$918, DW_AT_type(*$C$DW$T$145)
    3779                            .dwattr $C$DW$T$918, DW_AT_language(DW_LANG_C)
    3780                            .dwattr $C$DW$T$918, DW_AT_decl_file("..\Application\CoP\MT\mt.h")
    3781                            .dwattr $C$DW$T$918, DW_AT_decl_line(0x50)
    3782                            .dwattr $C$DW$T$918, DW_AT_decl_column(0x03)
    3783                    
    3784                    $C$DW$T$919     .dwtag  DW_TAG_pointer_type
    3785                            .dwattr $C$DW$T$919, DW_AT_type(*$C$DW$T$918)
    3786                            .dwattr $C$DW$T$919, DW_AT_address_class(0x20)
    3787                    
    3788                    $C$DW$T$920     .dwtag  DW_TAG_const_type
    3789                            .dwattr $C$DW$T$920, DW_AT_type(*$C$DW$T$919)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   70

    3790                    
    3791                    
    3792                    $C$DW$T$148     .dwtag  DW_TAG_structure_type
    3793                            .dwattr $C$DW$T$148, DW_AT_byte_size(0x58)
    3794                    $C$DW$376       .dwtag  DW_TAG_member
    3795                            .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$147)
    3796                            .dwattr $C$DW$376, DW_AT_name("CCFG_EXT_LF_CLK")
    3797                            .dwattr $C$DW$376, DW_AT_TI_symbol_name("CCFG_EXT_LF_CLK")
    3798                            .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3799                            .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3800                            .dwattr $C$DW$376, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3801                            .dwattr $C$DW$376, DW_AT_decl_line(0x31)
    3802                            .dwattr $C$DW$376, DW_AT_decl_column(0x10)
    3803                    
    3804                    $C$DW$377       .dwtag  DW_TAG_member
    3805                            .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$147)
    3806                            .dwattr $C$DW$377, DW_AT_name("CCFG_MODE_CONF_1")
    3807                            .dwattr $C$DW$377, DW_AT_TI_symbol_name("CCFG_MODE_CONF_1")
    3808                            .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3809                            .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3810                            .dwattr $C$DW$377, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3811                            .dwattr $C$DW$377, DW_AT_decl_line(0x32)
    3812                            .dwattr $C$DW$377, DW_AT_decl_column(0x10)
    3813                    
    3814                    $C$DW$378       .dwtag  DW_TAG_member
    3815                            .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$147)
    3816                            .dwattr $C$DW$378, DW_AT_name("CCFG_SIZE_AND_DIS_FLAGS")
    3817                            .dwattr $C$DW$378, DW_AT_TI_symbol_name("CCFG_SIZE_AND_DIS_FLAGS")
    3818                            .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3819                            .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3820                            .dwattr $C$DW$378, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3821                            .dwattr $C$DW$378, DW_AT_decl_line(0x33)
    3822                            .dwattr $C$DW$378, DW_AT_decl_column(0x10)
    3823                    
    3824                    $C$DW$379       .dwtag  DW_TAG_member
    3825                            .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$147)
    3826                            .dwattr $C$DW$379, DW_AT_name("CCFG_MODE_CONF")
    3827                            .dwattr $C$DW$379, DW_AT_TI_symbol_name("CCFG_MODE_CONF")
    3828                            .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3829                            .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3830                            .dwattr $C$DW$379, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3831                            .dwattr $C$DW$379, DW_AT_decl_line(0x34)
    3832                            .dwattr $C$DW$379, DW_AT_decl_column(0x10)
    3833                    
    3834                    $C$DW$380       .dwtag  DW_TAG_member
    3835                            .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$147)
    3836                            .dwattr $C$DW$380, DW_AT_name("CCFG_VOLT_LOAD_0")
    3837                            .dwattr $C$DW$380, DW_AT_TI_symbol_name("CCFG_VOLT_LOAD_0")
    3838                            .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3839                            .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3840                            .dwattr $C$DW$380, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3841                            .dwattr $C$DW$380, DW_AT_decl_line(0x35)
    3842                            .dwattr $C$DW$380, DW_AT_decl_column(0x10)
    3843                    
    3844                    $C$DW$381       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   71

    3845                            .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$147)
    3846                            .dwattr $C$DW$381, DW_AT_name("CCFG_VOLT_LOAD_1")
    3847                            .dwattr $C$DW$381, DW_AT_TI_symbol_name("CCFG_VOLT_LOAD_1")
    3848                            .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3849                            .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3850                            .dwattr $C$DW$381, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3851                            .dwattr $C$DW$381, DW_AT_decl_line(0x36)
    3852                            .dwattr $C$DW$381, DW_AT_decl_column(0x10)
    3853                    
    3854                    $C$DW$382       .dwtag  DW_TAG_member
    3855                            .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$147)
    3856                            .dwattr $C$DW$382, DW_AT_name("CCFG_RTC_OFFSET")
    3857                            .dwattr $C$DW$382, DW_AT_TI_symbol_name("CCFG_RTC_OFFSET")
    3858                            .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3859                            .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3860                            .dwattr $C$DW$382, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3861                            .dwattr $C$DW$382, DW_AT_decl_line(0x37)
    3862                            .dwattr $C$DW$382, DW_AT_decl_column(0x10)
    3863                    
    3864                    $C$DW$383       .dwtag  DW_TAG_member
    3865                            .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$147)
    3866                            .dwattr $C$DW$383, DW_AT_name("CCFG_FREQ_OFFSET")
    3867                            .dwattr $C$DW$383, DW_AT_TI_symbol_name("CCFG_FREQ_OFFSET")
    3868                            .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3869                            .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3870                            .dwattr $C$DW$383, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3871                            .dwattr $C$DW$383, DW_AT_decl_line(0x38)
    3872                            .dwattr $C$DW$383, DW_AT_decl_column(0x10)
    3873                    
    3874                    $C$DW$384       .dwtag  DW_TAG_member
    3875                            .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$147)
    3876                            .dwattr $C$DW$384, DW_AT_name("CCFG_IEEE_MAC_0")
    3877                            .dwattr $C$DW$384, DW_AT_TI_symbol_name("CCFG_IEEE_MAC_0")
    3878                            .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3879                            .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3880                            .dwattr $C$DW$384, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3881                            .dwattr $C$DW$384, DW_AT_decl_line(0x39)
    3882                            .dwattr $C$DW$384, DW_AT_decl_column(0x10)
    3883                    
    3884                    $C$DW$385       .dwtag  DW_TAG_member
    3885                            .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$147)
    3886                            .dwattr $C$DW$385, DW_AT_name("CCFG_IEEE_MAC_1")
    3887                            .dwattr $C$DW$385, DW_AT_TI_symbol_name("CCFG_IEEE_MAC_1")
    3888                            .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3889                            .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3890                            .dwattr $C$DW$385, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3891                            .dwattr $C$DW$385, DW_AT_decl_line(0x3a)
    3892                            .dwattr $C$DW$385, DW_AT_decl_column(0x10)
    3893                    
    3894                    $C$DW$386       .dwtag  DW_TAG_member
    3895                            .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$147)
    3896                            .dwattr $C$DW$386, DW_AT_name("CCFG_IEEE_BLE_0")
    3897                            .dwattr $C$DW$386, DW_AT_TI_symbol_name("CCFG_IEEE_BLE_0")
    3898                            .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3899                            .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   72

    3900                            .dwattr $C$DW$386, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3901                            .dwattr $C$DW$386, DW_AT_decl_line(0x3b)
    3902                            .dwattr $C$DW$386, DW_AT_decl_column(0x10)
    3903                    
    3904                    $C$DW$387       .dwtag  DW_TAG_member
    3905                            .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$147)
    3906                            .dwattr $C$DW$387, DW_AT_name("CCFG_IEEE_BLE_1")
    3907                            .dwattr $C$DW$387, DW_AT_TI_symbol_name("CCFG_IEEE_BLE_1")
    3908                            .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3909                            .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3910                            .dwattr $C$DW$387, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3911                            .dwattr $C$DW$387, DW_AT_decl_line(0x3c)
    3912                            .dwattr $C$DW$387, DW_AT_decl_column(0x10)
    3913                    
    3914                    $C$DW$388       .dwtag  DW_TAG_member
    3915                            .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$147)
    3916                            .dwattr $C$DW$388, DW_AT_name("CCFG_BL_CONFIG")
    3917                            .dwattr $C$DW$388, DW_AT_TI_symbol_name("CCFG_BL_CONFIG")
    3918                            .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3919                            .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3920                            .dwattr $C$DW$388, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3921                            .dwattr $C$DW$388, DW_AT_decl_line(0x3d)
    3922                            .dwattr $C$DW$388, DW_AT_decl_column(0x10)
    3923                    
    3924                    $C$DW$389       .dwtag  DW_TAG_member
    3925                            .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$147)
    3926                            .dwattr $C$DW$389, DW_AT_name("CCFG_ERASE_CONF")
    3927                            .dwattr $C$DW$389, DW_AT_TI_symbol_name("CCFG_ERASE_CONF")
    3928                            .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3929                            .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3930                            .dwattr $C$DW$389, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3931                            .dwattr $C$DW$389, DW_AT_decl_line(0x3e)
    3932                            .dwattr $C$DW$389, DW_AT_decl_column(0x10)
    3933                    
    3934                    $C$DW$390       .dwtag  DW_TAG_member
    3935                            .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$147)
    3936                            .dwattr $C$DW$390, DW_AT_name("CCFG_CCFG_TI_OPTIONS")
    3937                            .dwattr $C$DW$390, DW_AT_TI_symbol_name("CCFG_CCFG_TI_OPTIONS")
    3938                            .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3939                            .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3940                            .dwattr $C$DW$390, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3941                            .dwattr $C$DW$390, DW_AT_decl_line(0x3f)
    3942                            .dwattr $C$DW$390, DW_AT_decl_column(0x10)
    3943                    
    3944                    $C$DW$391       .dwtag  DW_TAG_member
    3945                            .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$147)
    3946                            .dwattr $C$DW$391, DW_AT_name("CCFG_CCFG_TAP_DAP_0")
    3947                            .dwattr $C$DW$391, DW_AT_TI_symbol_name("CCFG_CCFG_TAP_DAP_0")
    3948                            .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3949                            .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3950                            .dwattr $C$DW$391, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3951                            .dwattr $C$DW$391, DW_AT_decl_line(0x40)
    3952                            .dwattr $C$DW$391, DW_AT_decl_column(0x10)
    3953                    
    3954                    $C$DW$392       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   73

    3955                            .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$147)
    3956                            .dwattr $C$DW$392, DW_AT_name("CCFG_CCFG_TAP_DAP_1")
    3957                            .dwattr $C$DW$392, DW_AT_TI_symbol_name("CCFG_CCFG_TAP_DAP_1")
    3958                            .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3959                            .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3960                            .dwattr $C$DW$392, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3961                            .dwattr $C$DW$392, DW_AT_decl_line(0x41)
    3962                            .dwattr $C$DW$392, DW_AT_decl_column(0x10)
    3963                    
    3964                    $C$DW$393       .dwtag  DW_TAG_member
    3965                            .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$147)
    3966                            .dwattr $C$DW$393, DW_AT_name("CCFG_IMAGE_VALID_CONF")
    3967                            .dwattr $C$DW$393, DW_AT_TI_symbol_name("CCFG_IMAGE_VALID_CONF")
    3968                            .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3969                            .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3970                            .dwattr $C$DW$393, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3971                            .dwattr $C$DW$393, DW_AT_decl_line(0x42)
    3972                            .dwattr $C$DW$393, DW_AT_decl_column(0x10)
    3973                    
    3974                    $C$DW$394       .dwtag  DW_TAG_member
    3975                            .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$147)
    3976                            .dwattr $C$DW$394, DW_AT_name("CCFG_CCFG_PROT_31_0")
    3977                            .dwattr $C$DW$394, DW_AT_TI_symbol_name("CCFG_CCFG_PROT_31_0")
    3978                            .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3979                            .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3980                            .dwattr $C$DW$394, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3981                            .dwattr $C$DW$394, DW_AT_decl_line(0x43)
    3982                            .dwattr $C$DW$394, DW_AT_decl_column(0x10)
    3983                    
    3984                    $C$DW$395       .dwtag  DW_TAG_member
    3985                            .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$147)
    3986                            .dwattr $C$DW$395, DW_AT_name("CCFG_CCFG_PROT_63_32")
    3987                            .dwattr $C$DW$395, DW_AT_TI_symbol_name("CCFG_CCFG_PROT_63_32")
    3988                            .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3989                            .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3990                            .dwattr $C$DW$395, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3991                            .dwattr $C$DW$395, DW_AT_decl_line(0x44)
    3992                            .dwattr $C$DW$395, DW_AT_decl_column(0x10)
    3993                    
    3994                    $C$DW$396       .dwtag  DW_TAG_member
    3995                            .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$147)
    3996                            .dwattr $C$DW$396, DW_AT_name("CCFG_CCFG_PROT_95_64")
    3997                            .dwattr $C$DW$396, DW_AT_TI_symbol_name("CCFG_CCFG_PROT_95_64")
    3998                            .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3999                            .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4000                            .dwattr $C$DW$396, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4001                            .dwattr $C$DW$396, DW_AT_decl_line(0x45)
    4002                            .dwattr $C$DW$396, DW_AT_decl_column(0x10)
    4003                    
    4004                    $C$DW$397       .dwtag  DW_TAG_member
    4005                            .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$147)
    4006                            .dwattr $C$DW$397, DW_AT_name("CCFG_CCFG_PROT_127_96")
    4007                            .dwattr $C$DW$397, DW_AT_TI_symbol_name("CCFG_CCFG_PROT_127_96")
    4008                            .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    4009                            .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   74

    4010                            .dwattr $C$DW$397, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4011                            .dwattr $C$DW$397, DW_AT_decl_line(0x46)
    4012                            .dwattr $C$DW$397, DW_AT_decl_column(0x10)
    4013                    
    4014                            .dwattr $C$DW$T$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    4015                            .dwattr $C$DW$T$148, DW_AT_decl_line(0x30)
    4016                            .dwattr $C$DW$T$148, DW_AT_decl_column(0x01)
    4017                            .dwendtag $C$DW$T$148
    4018                    
    4019                    $C$DW$T$925     .dwtag  DW_TAG_typedef
    4020                            .dwattr $C$DW$T$925, DW_AT_name("ccfg_t")
    4021                            .dwattr $C$DW$T$925, DW_AT_type(*$C$DW$T$148)
    4022                            .dwattr $C$DW$T$925, DW_AT_language(DW_LANG_C)
    4023                            .dwattr $C$DW$T$925, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    4024                            .dwattr $C$DW$T$925, DW_AT_decl_line(0x47)
    4025                            .dwattr $C$DW$T$925, DW_AT_decl_column(0x03)
    4026                    
    4027                    $C$DW$T$926     .dwtag  DW_TAG_const_type
    4028                            .dwattr $C$DW$T$926, DW_AT_type(*$C$DW$T$925)
    4029                    
    4030                    
    4031                    $C$DW$T$149     .dwtag  DW_TAG_structure_type
    4032                            .dwattr $C$DW$T$149, DW_AT_byte_size(0x10)
    4033                    $C$DW$398       .dwtag  DW_TAG_member
    4034                            .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$14)
    4035                            .dwattr $C$DW$398, DW_AT_name("__max_align1")
    4036                            .dwattr $C$DW$398, DW_AT_TI_symbol_name("__max_align1")
    4037                            .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4038                            .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4039                            .dwattr $C$DW$398, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4040                            .dwattr $C$DW$398, DW_AT_decl_line(0x70)
    4041                            .dwattr $C$DW$398, DW_AT_decl_column(0x0c)
    4042                    
    4043                    $C$DW$399       .dwtag  DW_TAG_member
    4044                            .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$18)
    4045                            .dwattr $C$DW$399, DW_AT_name("__max_align2")
    4046                            .dwattr $C$DW$399, DW_AT_TI_symbol_name("__max_align2")
    4047                            .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4048                            .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4049                            .dwattr $C$DW$399, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4050                            .dwattr $C$DW$399, DW_AT_decl_line(0x71)
    4051                            .dwattr $C$DW$399, DW_AT_decl_column(0x0e)
    4052                    
    4053                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    4054                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x6f)
    4055                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x10)
    4056                            .dwendtag $C$DW$T$149
    4057                    
    4058                    $C$DW$T$927     .dwtag  DW_TAG_typedef
    4059                            .dwattr $C$DW$T$927, DW_AT_name("__max_align_t")
    4060                            .dwattr $C$DW$T$927, DW_AT_type(*$C$DW$T$149)
    4061                            .dwattr $C$DW$T$927, DW_AT_language(DW_LANG_C)
    4062                            .dwattr $C$DW$T$927, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    4063                            .dwattr $C$DW$T$927, DW_AT_decl_line(0x72)
    4064                            .dwattr $C$DW$T$927, DW_AT_decl_column(0x03)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   75

    4065                    
    4066                    
    4067                    $C$DW$T$188     .dwtag  DW_TAG_structure_type
    4068                            .dwattr $C$DW$T$188, DW_AT_byte_size(0x4c)
    4069                    $C$DW$400       .dwtag  DW_TAG_member
    4070                            .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$153)
    4071                            .dwattr $C$DW$400, DW_AT_name("Crc32")
    4072                            .dwattr $C$DW$400, DW_AT_TI_symbol_name("Crc32")
    4073                            .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4074                            .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4075                            .dwattr $C$DW$400, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4076                            .dwattr $C$DW$400, DW_AT_decl_line(0x76)
    4077                            .dwattr $C$DW$400, DW_AT_decl_column(0x25)
    4078                    
    4079                    $C$DW$401       .dwtag  DW_TAG_member
    4080                            .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$156)
    4081                            .dwattr $C$DW$401, DW_AT_name("FlashGetSize")
    4082                            .dwattr $C$DW$401, DW_AT_TI_symbol_name("FlashGetSize")
    4083                            .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4084                            .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4085                            .dwattr $C$DW$401, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4086                            .dwattr $C$DW$401, DW_AT_decl_line(0x77)
    4087                            .dwattr $C$DW$401, DW_AT_decl_column(0x25)
    4088                    
    4089                    $C$DW$402       .dwtag  DW_TAG_member
    4090                            .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$157)
    4091                            .dwattr $C$DW$402, DW_AT_name("GetChipId")
    4092                            .dwattr $C$DW$402, DW_AT_TI_symbol_name("GetChipId")
    4093                            .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4094                            .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4095                            .dwattr $C$DW$402, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4096                            .dwattr $C$DW$402, DW_AT_decl_line(0x78)
    4097                            .dwattr $C$DW$402, DW_AT_decl_column(0x25)
    4098                    
    4099                    $C$DW$403       .dwtag  DW_TAG_member
    4100                            .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$160)
    4101                            .dwattr $C$DW$403, DW_AT_name("ReservedLocation1")
    4102                            .dwattr $C$DW$403, DW_AT_TI_symbol_name("ReservedLocation1")
    4103                            .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4104                            .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4105                            .dwattr $C$DW$403, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4106                            .dwattr $C$DW$403, DW_AT_decl_line(0x79)
    4107                            .dwattr $C$DW$403, DW_AT_decl_column(0x25)
    4108                    
    4109                    $C$DW$404       .dwtag  DW_TAG_member
    4110                            .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$161)
    4111                            .dwattr $C$DW$404, DW_AT_name("ReservedLocation2")
    4112                            .dwattr $C$DW$404, DW_AT_TI_symbol_name("ReservedLocation2")
    4113                            .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4114                            .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4115                            .dwattr $C$DW$404, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4116                            .dwattr $C$DW$404, DW_AT_decl_line(0x7a)
    4117                            .dwattr $C$DW$404, DW_AT_decl_column(0x25)
    4118                    
    4119                    $C$DW$405       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   76

    4120                            .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$162)
    4121                            .dwattr $C$DW$405, DW_AT_name("ReservedLocation3")
    4122                            .dwattr $C$DW$405, DW_AT_TI_symbol_name("ReservedLocation3")
    4123                            .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4124                            .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4125                            .dwattr $C$DW$405, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4126                            .dwattr $C$DW$405, DW_AT_decl_line(0x7b)
    4127                            .dwattr $C$DW$405, DW_AT_decl_column(0x25)
    4128                    
    4129                    $C$DW$406       .dwtag  DW_TAG_member
    4130                            .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$165)
    4131                            .dwattr $C$DW$406, DW_AT_name("ResetDevice")
    4132                            .dwattr $C$DW$406, DW_AT_TI_symbol_name("ResetDevice")
    4133                            .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4134                            .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4135                            .dwattr $C$DW$406, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4136                            .dwattr $C$DW$406, DW_AT_decl_line(0x7c)
    4137                            .dwattr $C$DW$406, DW_AT_decl_column(0x25)
    4138                    
    4139                    $C$DW$407       .dwtag  DW_TAG_member
    4140                            .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$169)
    4141                            .dwattr $C$DW$407, DW_AT_name("Fletcher32")
    4142                            .dwattr $C$DW$407, DW_AT_TI_symbol_name("Fletcher32")
    4143                            .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4144                            .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4145                            .dwattr $C$DW$407, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4146                            .dwattr $C$DW$407, DW_AT_decl_line(0x7d)
    4147                            .dwattr $C$DW$407, DW_AT_decl_column(0x25)
    4148                    
    4149                    $C$DW$408       .dwtag  DW_TAG_member
    4150                            .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$173)
    4151                            .dwattr $C$DW$408, DW_AT_name("MinValue")
    4152                            .dwattr $C$DW$408, DW_AT_TI_symbol_name("MinValue")
    4153                            .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4154                            .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4155                            .dwattr $C$DW$408, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4156                            .dwattr $C$DW$408, DW_AT_decl_line(0x7e)
    4157                            .dwattr $C$DW$408, DW_AT_decl_column(0x25)
    4158                    
    4159                    $C$DW$409       .dwtag  DW_TAG_member
    4160                            .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$174)
    4161                            .dwattr $C$DW$409, DW_AT_name("MaxValue")
    4162                            .dwattr $C$DW$409, DW_AT_TI_symbol_name("MaxValue")
    4163                            .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4164                            .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4165                            .dwattr $C$DW$409, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4166                            .dwattr $C$DW$409, DW_AT_decl_line(0x7f)
    4167                            .dwattr $C$DW$409, DW_AT_decl_column(0x25)
    4168                    
    4169                    $C$DW$410       .dwtag  DW_TAG_member
    4170                            .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$175)
    4171                            .dwattr $C$DW$410, DW_AT_name("MeanValue")
    4172                            .dwattr $C$DW$410, DW_AT_TI_symbol_name("MeanValue")
    4173                            .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4174                            .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   77

    4175                            .dwattr $C$DW$410, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4176                            .dwattr $C$DW$410, DW_AT_decl_line(0x80)
    4177                            .dwattr $C$DW$410, DW_AT_decl_column(0x25)
    4178                    
    4179                    $C$DW$411       .dwtag  DW_TAG_member
    4180                            .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$176)
    4181                            .dwattr $C$DW$411, DW_AT_name("StandDeviationValue")
    4182                            .dwattr $C$DW$411, DW_AT_TI_symbol_name("StandDeviationValue")
    4183                            .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4184                            .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4185                            .dwattr $C$DW$411, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4186                            .dwattr $C$DW$411, DW_AT_decl_line(0x81)
    4187                            .dwattr $C$DW$411, DW_AT_decl_column(0x25)
    4188                    
    4189                    $C$DW$412       .dwtag  DW_TAG_member
    4190                            .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$179)
    4191                            .dwattr $C$DW$412, DW_AT_name("ReservedLocation4")
    4192                            .dwattr $C$DW$412, DW_AT_TI_symbol_name("ReservedLocation4")
    4193                            .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4194                            .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4195                            .dwattr $C$DW$412, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4196                            .dwattr $C$DW$412, DW_AT_decl_line(0x82)
    4197                            .dwattr $C$DW$412, DW_AT_decl_column(0x25)
    4198                    
    4199                    $C$DW$413       .dwtag  DW_TAG_member
    4200                            .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$180)
    4201                            .dwattr $C$DW$413, DW_AT_name("ReservedLocation5")
    4202                            .dwattr $C$DW$413, DW_AT_TI_symbol_name("ReservedLocation5")
    4203                            .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4204                            .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4205                            .dwattr $C$DW$413, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4206                            .dwattr $C$DW$413, DW_AT_decl_line(0x83)
    4207                            .dwattr $C$DW$413, DW_AT_decl_column(0x25)
    4208                    
    4209                    $C$DW$414       .dwtag  DW_TAG_member
    4210                            .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$181)
    4211                            .dwattr $C$DW$414, DW_AT_name("HFSourceSafeSwitch")
    4212                            .dwattr $C$DW$414, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    4213                            .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4214                            .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4215                            .dwattr $C$DW$414, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4216                            .dwattr $C$DW$414, DW_AT_decl_line(0x84)
    4217                            .dwattr $C$DW$414, DW_AT_decl_column(0x25)
    4218                    
    4219                    $C$DW$415       .dwtag  DW_TAG_member
    4220                            .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$184)
    4221                            .dwattr $C$DW$415, DW_AT_name("SelectCompAInput")
    4222                            .dwattr $C$DW$415, DW_AT_TI_symbol_name("SelectCompAInput")
    4223                            .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4224                            .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4225                            .dwattr $C$DW$415, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4226                            .dwattr $C$DW$415, DW_AT_decl_line(0x85)
    4227                            .dwattr $C$DW$415, DW_AT_decl_column(0x25)
    4228                    
    4229                    $C$DW$416       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   78

    4230                            .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$185)
    4231                            .dwattr $C$DW$416, DW_AT_name("SelectCompARef")
    4232                            .dwattr $C$DW$416, DW_AT_TI_symbol_name("SelectCompARef")
    4233                            .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4234                            .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4235                            .dwattr $C$DW$416, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4236                            .dwattr $C$DW$416, DW_AT_decl_line(0x86)
    4237                            .dwattr $C$DW$416, DW_AT_decl_column(0x25)
    4238                    
    4239                    $C$DW$417       .dwtag  DW_TAG_member
    4240                            .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$186)
    4241                            .dwattr $C$DW$417, DW_AT_name("SelectADCCompBInput")
    4242                            .dwattr $C$DW$417, DW_AT_TI_symbol_name("SelectADCCompBInput")
    4243                            .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4244                            .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4245                            .dwattr $C$DW$417, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4246                            .dwattr $C$DW$417, DW_AT_decl_line(0x87)
    4247                            .dwattr $C$DW$417, DW_AT_decl_column(0x25)
    4248                    
    4249                    $C$DW$418       .dwtag  DW_TAG_member
    4250                            .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$187)
    4251                            .dwattr $C$DW$418, DW_AT_name("SelectCompBRef")
    4252                            .dwattr $C$DW$418, DW_AT_TI_symbol_name("SelectCompBRef")
    4253                            .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4254                            .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4255                            .dwattr $C$DW$418, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    4256                            .dwattr $C$DW$418, DW_AT_decl_line(0x88)
    4257                            .dwattr $C$DW$418, DW_AT_decl_column(0x25)
    4258                    
    4259                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    4260                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x75)
    4261                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x01)
    4262                            .dwendtag $C$DW$T$188
    4263                    
    4264                    $C$DW$T$928     .dwtag  DW_TAG_typedef
    4265                            .dwattr $C$DW$T$928, DW_AT_name("HARD_API_T")
    4266                            .dwattr $C$DW$T$928, DW_AT_type(*$C$DW$T$188)
    4267                            .dwattr $C$DW$T$928, DW_AT_language(DW_LANG_C)
    4268                            .dwattr $C$DW$T$928, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    4269                            .dwattr $C$DW$T$928, DW_AT_decl_line(0x89)
    4270                            .dwattr $C$DW$T$928, DW_AT_decl_column(0x03)
    4271                    
    4272                    
    4273                    $C$DW$T$191     .dwtag  DW_TAG_structure_type
    4274                            .dwattr $C$DW$T$191, DW_AT_byte_size(0x08)
    4275                    $C$DW$419       .dwtag  DW_TAG_member
    4276                            .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$10)
    4277                            .dwattr $C$DW$419, DW_AT_name("length")
    4278                            .dwattr $C$DW$419, DW_AT_TI_symbol_name("length")
    4279                            .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4280                            .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4281                            .dwattr $C$DW$419, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    4282                            .dwattr $C$DW$419, DW_AT_decl_line(0x165)
    4283                            .dwattr $C$DW$419, DW_AT_decl_column(0x16)
    4284                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   79

    4285                    $C$DW$420       .dwtag  DW_TAG_member
    4286                            .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$190)
    4287                            .dwattr $C$DW$420, DW_AT_name("elem")
    4288                            .dwattr $C$DW$420, DW_AT_TI_symbol_name("elem")
    4289                            .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4290                            .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4291                            .dwattr $C$DW$420, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    4292                            .dwattr $C$DW$420, DW_AT_decl_line(0x165)
    4293                            .dwattr $C$DW$420, DW_AT_decl_column(0x3a)
    4294                    
    4295                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    4296                            .dwattr $C$DW$T$191, DW_AT_decl_line(0x165)
    4297                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x10)
    4298                            .dwendtag $C$DW$T$191
    4299                    
    4300                    $C$DW$T$929     .dwtag  DW_TAG_typedef
    4301                            .dwattr $C$DW$T$929, DW_AT_name("ARRAY1_ti_sysbios_knl_Swi_hooks")
    4302                            .dwattr $C$DW$T$929, DW_AT_type(*$C$DW$T$191)
    4303                            .dwattr $C$DW$T$929, DW_AT_language(DW_LANG_C)
    4304                            .dwattr $C$DW$T$929, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    4305                            .dwattr $C$DW$T$929, DW_AT_decl_line(0x165)
    4306                            .dwattr $C$DW$T$929, DW_AT_decl_column(0x42)
    4307                    
    4308                    
    4309                    $C$DW$T$194     .dwtag  DW_TAG_structure_type
    4310                            .dwattr $C$DW$T$194, DW_AT_byte_size(0x08)
    4311                    $C$DW$421       .dwtag  DW_TAG_member
    4312                            .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$10)
    4313                            .dwattr $C$DW$421, DW_AT_name("length")
    4314                            .dwattr $C$DW$421, DW_AT_TI_symbol_name("length")
    4315                            .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4316                            .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4317                            .dwattr $C$DW$421, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    4318                            .dwattr $C$DW$421, DW_AT_decl_line(0x166)
    4319                            .dwattr $C$DW$421, DW_AT_decl_column(0x16)
    4320                    
    4321                    $C$DW$422       .dwtag  DW_TAG_member
    4322                            .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$193)
    4323                            .dwattr $C$DW$422, DW_AT_name("elem")
    4324                            .dwattr $C$DW$422, DW_AT_TI_symbol_name("elem")
    4325                            .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4326                            .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4327                            .dwattr $C$DW$422, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    4328                            .dwattr $C$DW$422, DW_AT_decl_line(0x166)
    4329                            .dwattr $C$DW$422, DW_AT_decl_column(0x40)
    4330                    
    4331                            .dwattr $C$DW$T$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    4332                            .dwattr $C$DW$T$194, DW_AT_decl_line(0x166)
    4333                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x10)
    4334                            .dwendtag $C$DW$T$194
    4335                    
    4336                    $C$DW$T$930     .dwtag  DW_TAG_typedef
    4337                            .dwattr $C$DW$T$930, DW_AT_name("CARRAY1_ti_sysbios_knl_Swi_hooks")
    4338                            .dwattr $C$DW$T$930, DW_AT_type(*$C$DW$T$194)
    4339                            .dwattr $C$DW$T$930, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   80

    4340                            .dwattr $C$DW$T$930, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    4341                            .dwattr $C$DW$T$930, DW_AT_decl_line(0x166)
    4342                            .dwattr $C$DW$T$930, DW_AT_decl_column(0x48)
    4343                    
    4344                    $C$DW$T$931     .dwtag  DW_TAG_typedef
    4345                            .dwattr $C$DW$T$931, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    4346                            .dwattr $C$DW$T$931, DW_AT_type(*$C$DW$T$930)
    4347                            .dwattr $C$DW$T$931, DW_AT_language(DW_LANG_C)
    4348                            .dwattr $C$DW$T$931, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    4349                            .dwattr $C$DW$T$931, DW_AT_decl_line(0x168)
    4350                            .dwattr $C$DW$T$931, DW_AT_decl_column(0x2a)
    4351                    
    4352                    $C$DW$T$932     .dwtag  DW_TAG_typedef
    4353                            .dwattr $C$DW$T$932, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    4354                            .dwattr $C$DW$T$932, DW_AT_type(*$C$DW$T$930)
    4355                            .dwattr $C$DW$T$932, DW_AT_language(DW_LANG_C)
    4356                            .dwattr $C$DW$T$932, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    4357                            .dwattr $C$DW$T$932, DW_AT_decl_line(0x167)
    4358                            .dwattr $C$DW$T$932, DW_AT_decl_column(0x2a)
    4359                    
    4360                    
    4361                    $C$DW$T$197     .dwtag  DW_TAG_structure_type
    4362                            .dwattr $C$DW$T$197, DW_AT_byte_size(0x0a)
    4363                    $C$DW$423       .dwtag  DW_TAG_member
    4364                            .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$292)
    4365                            .dwattr $C$DW$423, DW_AT_name("addr")
    4366                            .dwattr $C$DW$423, DW_AT_TI_symbol_name("addr")
    4367                            .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4368                            .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4369                            .dwattr $C$DW$423, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4370                            .dwattr $C$DW$423, DW_AT_decl_line(0x4db)
    4371                            .dwattr $C$DW$423, DW_AT_decl_column(0x07)
    4372                    
    4373                    $C$DW$424       .dwtag  DW_TAG_member
    4374                            .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$196)
    4375                            .dwattr $C$DW$424, DW_AT_name("addrMode")
    4376                            .dwattr $C$DW$424, DW_AT_TI_symbol_name("addrMode")
    4377                            .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4378                            .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4379                            .dwattr $C$DW$424, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4380                            .dwattr $C$DW$424, DW_AT_decl_line(0x4de)
    4381                            .dwattr $C$DW$424, DW_AT_decl_column(0x17)
    4382                    
    4383                            .dwattr $C$DW$T$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    4384                            .dwattr $C$DW$T$197, DW_AT_decl_line(0x4d0)
    4385                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x01)
    4386                            .dwendtag $C$DW$T$197
    4387                    
    4388                    $C$DW$T$456     .dwtag  DW_TAG_typedef
    4389                            .dwattr $C$DW$T$456, DW_AT_name("ApiMac_sAddr_t")
    4390                            .dwattr $C$DW$T$456, DW_AT_type(*$C$DW$T$197)
    4391                            .dwattr $C$DW$T$456, DW_AT_language(DW_LANG_C)
    4392                            .dwattr $C$DW$T$456, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    4393                            .dwattr $C$DW$T$456, DW_AT_decl_line(0x4df)
    4394                            .dwattr $C$DW$T$456, DW_AT_decl_column(0x03)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   81

    4395                    
    4396                    
    4397                    $C$DW$T$198     .dwtag  DW_TAG_structure_type
    4398                            .dwattr $C$DW$T$198, DW_AT_byte_size(0x08)
    4399                    $C$DW$425       .dwtag  DW_TAG_member
    4400                            .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$147)
    4401                            .dwattr $C$DW$425, DW_AT_name("frameCounter")
    4402                            .dwattr $C$DW$425, DW_AT_TI_symbol_name("frameCounter")
    4403                            .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4404                            .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4405                            .dwattr $C$DW$425, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4406                            .dwattr $C$DW$425, DW_AT_decl_line(0x575)
    4407                            .dwattr $C$DW$425, DW_AT_decl_column(0x1a)
    4408                    
    4409                    $C$DW$426       .dwtag  DW_TAG_member
    4410                            .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$144)
    4411                            .dwattr $C$DW$426, DW_AT_name("keyIdx")
    4412                            .dwattr $C$DW$426, DW_AT_TI_symbol_name("keyIdx")
    4413                            .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4414                            .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4415                            .dwattr $C$DW$426, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4416                            .dwattr $C$DW$426, DW_AT_decl_line(0x576)
    4417                            .dwattr $C$DW$426, DW_AT_decl_column(0x1a)
    4418                    
    4419                            .dwattr $C$DW$T$198, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    4420                            .dwattr $C$DW$T$198, DW_AT_decl_line(0x574)
    4421                            .dwattr $C$DW$T$198, DW_AT_decl_column(0x01)
    4422                            .dwendtag $C$DW$T$198
    4423                    
    4424                    $C$DW$T$517     .dwtag  DW_TAG_typedef
    4425                            .dwattr $C$DW$T$517, DW_AT_name("ApiMac_frameCntr_t")
    4426                            .dwattr $C$DW$T$517, DW_AT_type(*$C$DW$T$198)
    4427                            .dwattr $C$DW$T$517, DW_AT_language(DW_LANG_C)
    4428                            .dwattr $C$DW$T$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    4429                            .dwattr $C$DW$T$517, DW_AT_decl_line(0x577)
    4430                            .dwattr $C$DW$T$517, DW_AT_decl_column(0x03)
    4431                    
    4432                    $C$DW$T$518     .dwtag  DW_TAG_pointer_type
    4433                            .dwattr $C$DW$T$518, DW_AT_type(*$C$DW$T$517)
    4434                            .dwattr $C$DW$T$518, DW_AT_address_class(0x20)
    4435                    
    4436                    
    4437                    $C$DW$T$202     .dwtag  DW_TAG_structure_type
    4438                            .dwattr $C$DW$T$202, DW_AT_byte_size(0x40)
    4439                    $C$DW$427       .dwtag  DW_TAG_member
    4440                            .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$200)
    4441                            .dwattr $C$DW$427, DW_AT_name("beaconType")
    4442                            .dwattr $C$DW$427, DW_AT_TI_symbol_name("beaconType")
    4443                            .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4444                            .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4445                            .dwattr $C$DW$427, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4446                            .dwattr $C$DW$427, DW_AT_decl_line(0x886)
    4447                            .dwattr $C$DW$427, DW_AT_decl_column(0x19)
    4448                    
    4449                    $C$DW$428       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   82

    4450                            .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$142)
    4451                            .dwattr $C$DW$428, DW_AT_name("bsn")
    4452                            .dwattr $C$DW$428, DW_AT_TI_symbol_name("bsn")
    4453                            .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4454                            .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4455                            .dwattr $C$DW$428, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4456                            .dwattr $C$DW$428, DW_AT_decl_line(0x888)
    4457                            .dwattr $C$DW$428, DW_AT_decl_column(0x0d)
    4458                    
    4459                    $C$DW$429       .dwtag  DW_TAG_member
    4460                            .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$201)
    4461                            .dwattr $C$DW$429, DW_AT_name("panDesc")
    4462                            .dwattr $C$DW$429, DW_AT_TI_symbol_name("panDesc")
    4463                            .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4464                            .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4465                            .dwattr $C$DW$429, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4466                            .dwattr $C$DW$429, DW_AT_decl_line(0x88a)
    4467                            .dwattr $C$DW$429, DW_AT_decl_column(0x16)
    4468                    
    4469                    $C$DW$430       .dwtag  DW_TAG_member
    4470                            .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$295)
    4471                            .dwattr $C$DW$430, DW_AT_name("beaconData")
    4472                            .dwattr $C$DW$430, DW_AT_TI_symbol_name("beaconData")
    4473                            .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4474                            .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4475                            .dwattr $C$DW$430, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4476                            .dwattr $C$DW$430, DW_AT_decl_line(0x895)
    4477                            .dwattr $C$DW$430, DW_AT_decl_column(0x07)
    4478                    
    4479                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    4480                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x884)
    4481                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x01)
    4482                            .dwendtag $C$DW$T$202
    4483                    
    4484                    $C$DW$T$370     .dwtag  DW_TAG_typedef
    4485                            .dwattr $C$DW$T$370, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    4486                            .dwattr $C$DW$T$370, DW_AT_type(*$C$DW$T$202)
    4487                            .dwattr $C$DW$T$370, DW_AT_language(DW_LANG_C)
    4488                            .dwattr $C$DW$T$370, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    4489                            .dwattr $C$DW$T$370, DW_AT_decl_line(0x896)
    4490                            .dwattr $C$DW$T$370, DW_AT_decl_column(0x03)
    4491                    
    4492                    $C$DW$T$371     .dwtag  DW_TAG_pointer_type
    4493                            .dwattr $C$DW$T$371, DW_AT_type(*$C$DW$T$370)
    4494                            .dwattr $C$DW$T$371, DW_AT_address_class(0x20)
    4495                    
    4496                    
    4497                    $C$DW$T$203     .dwtag  DW_TAG_structure_type
    4498                            .dwattr $C$DW$T$203, DW_AT_byte_size(0x08)
    4499                    $C$DW$431       .dwtag  DW_TAG_member
    4500                            .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$10)
    4501                            .dwattr $C$DW$431, DW_AT_name("quot")
    4502                            .dwattr $C$DW$431, DW_AT_TI_symbol_name("quot")
    4503                            .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4504                            .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   83

    4505                            .dwattr $C$DW$431, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4506                            .dwattr $C$DW$431, DW_AT_decl_line(0x49)
    4507                            .dwattr $C$DW$431, DW_AT_decl_column(0x16)
    4508                    
    4509                    $C$DW$432       .dwtag  DW_TAG_member
    4510                            .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$10)
    4511                            .dwattr $C$DW$432, DW_AT_name("rem")
    4512                            .dwattr $C$DW$432, DW_AT_TI_symbol_name("rem")
    4513                            .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4514                            .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4515                            .dwattr $C$DW$432, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4516                            .dwattr $C$DW$432, DW_AT_decl_line(0x49)
    4517                            .dwattr $C$DW$432, DW_AT_decl_column(0x1c)
    4518                    
    4519                            .dwattr $C$DW$T$203, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    4520                            .dwattr $C$DW$T$203, DW_AT_decl_line(0x49)
    4521                            .dwattr $C$DW$T$203, DW_AT_decl_column(0x10)
    4522                            .dwendtag $C$DW$T$203
    4523                    
    4524                    $C$DW$T$933     .dwtag  DW_TAG_typedef
    4525                            .dwattr $C$DW$T$933, DW_AT_name("div_t")
    4526                            .dwattr $C$DW$T$933, DW_AT_type(*$C$DW$T$203)
    4527                            .dwattr $C$DW$T$933, DW_AT_language(DW_LANG_C)
    4528                            .dwattr $C$DW$T$933, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    4529                            .dwattr $C$DW$T$933, DW_AT_decl_line(0x49)
    4530                            .dwattr $C$DW$T$933, DW_AT_decl_column(0x23)
    4531                    
    4532                    
    4533                    $C$DW$T$204     .dwtag  DW_TAG_structure_type
    4534                            .dwattr $C$DW$T$204, DW_AT_byte_size(0x08)
    4535                    $C$DW$433       .dwtag  DW_TAG_member
    4536                            .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$10)
    4537                            .dwattr $C$DW$433, DW_AT_name("quot")
    4538                            .dwattr $C$DW$433, DW_AT_TI_symbol_name("quot")
    4539                            .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4540                            .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4541                            .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4542                            .dwattr $C$DW$433, DW_AT_decl_line(0x4e)
    4543                            .dwattr $C$DW$433, DW_AT_decl_column(0x16)
    4544                    
    4545                    $C$DW$434       .dwtag  DW_TAG_member
    4546                            .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$10)
    4547                            .dwattr $C$DW$434, DW_AT_name("rem")
    4548                            .dwattr $C$DW$434, DW_AT_TI_symbol_name("rem")
    4549                            .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4550                            .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4551                            .dwattr $C$DW$434, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4552                            .dwattr $C$DW$434, DW_AT_decl_line(0x4e)
    4553                            .dwattr $C$DW$434, DW_AT_decl_column(0x1c)
    4554                    
    4555                            .dwattr $C$DW$T$204, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    4556                            .dwattr $C$DW$T$204, DW_AT_decl_line(0x4e)
    4557                            .dwattr $C$DW$T$204, DW_AT_decl_column(0x10)
    4558                            .dwendtag $C$DW$T$204
    4559                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   84

    4560                    $C$DW$T$934     .dwtag  DW_TAG_typedef
    4561                            .dwattr $C$DW$T$934, DW_AT_name("ldiv_t")
    4562                            .dwattr $C$DW$T$934, DW_AT_type(*$C$DW$T$204)
    4563                            .dwattr $C$DW$T$934, DW_AT_language(DW_LANG_C)
    4564                            .dwattr $C$DW$T$934, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    4565                            .dwattr $C$DW$T$934, DW_AT_decl_line(0x4e)
    4566                            .dwattr $C$DW$T$934, DW_AT_decl_column(0x23)
    4567                    
    4568                    
    4569                    $C$DW$T$205     .dwtag  DW_TAG_structure_type
    4570                            .dwattr $C$DW$T$205, DW_AT_byte_size(0x10)
    4571                    $C$DW$435       .dwtag  DW_TAG_member
    4572                            .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$14)
    4573                            .dwattr $C$DW$435, DW_AT_name("quot")
    4574                            .dwattr $C$DW$435, DW_AT_TI_symbol_name("quot")
    4575                            .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4576                            .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4577                            .dwattr $C$DW$435, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4578                            .dwattr $C$DW$435, DW_AT_decl_line(0x56)
    4579                            .dwattr $C$DW$435, DW_AT_decl_column(0x1c)
    4580                    
    4581                    $C$DW$436       .dwtag  DW_TAG_member
    4582                            .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$14)
    4583                            .dwattr $C$DW$436, DW_AT_name("rem")
    4584                            .dwattr $C$DW$436, DW_AT_TI_symbol_name("rem")
    4585                            .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4586                            .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4587                            .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4588                            .dwattr $C$DW$436, DW_AT_decl_line(0x56)
    4589                            .dwattr $C$DW$436, DW_AT_decl_column(0x22)
    4590                    
    4591                            .dwattr $C$DW$T$205, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    4592                            .dwattr $C$DW$T$205, DW_AT_decl_line(0x56)
    4593                            .dwattr $C$DW$T$205, DW_AT_decl_column(0x10)
    4594                            .dwendtag $C$DW$T$205
    4595                    
    4596                    $C$DW$T$935     .dwtag  DW_TAG_typedef
    4597                            .dwattr $C$DW$T$935, DW_AT_name("lldiv_t")
    4598                            .dwattr $C$DW$T$935, DW_AT_type(*$C$DW$T$205)
    4599                            .dwattr $C$DW$T$935, DW_AT_language(DW_LANG_C)
    4600                            .dwattr $C$DW$T$935, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    4601                            .dwattr $C$DW$T$935, DW_AT_decl_line(0x56)
    4602                            .dwattr $C$DW$T$935, DW_AT_decl_column(0x29)
    4603                    
    4604                    
    4605                    $C$DW$T$210     .dwtag  DW_TAG_structure_type
    4606                            .dwattr $C$DW$T$210, DW_AT_byte_size(0x08)
    4607                    $C$DW$437       .dwtag  DW_TAG_member
    4608                            .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$208)
    4609                            .dwattr $C$DW$437, DW_AT_name("pointerStack")
    4610                            .dwattr $C$DW$437, DW_AT_TI_symbol_name("pointerStack")
    4611                            .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4612                            .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4613                            .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4614                            .dwattr $C$DW$437, DW_AT_decl_line(0x3f5)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   85

    4615                            .dwattr $C$DW$437, DW_AT_decl_column(0x16)
    4616                    
    4617                    $C$DW$438       .dwtag  DW_TAG_member
    4618                            .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$209)
    4619                            .dwattr $C$DW$438, DW_AT_name("directAPI")
    4620                            .dwattr $C$DW$438, DW_AT_TI_symbol_name("directAPI")
    4621                            .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4622                            .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4623                            .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4624                            .dwattr $C$DW$438, DW_AT_decl_line(0x3f6)
    4625                            .dwattr $C$DW$438, DW_AT_decl_column(0x15)
    4626                    
    4627                            .dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    4628                            .dwattr $C$DW$T$210, DW_AT_decl_line(0x3f4)
    4629                            .dwattr $C$DW$T$210, DW_AT_decl_column(0x01)
    4630                            .dwendtag $C$DW$T$210
    4631                    
    4632                    $C$DW$T$212     .dwtag  DW_TAG_typedef
    4633                            .dwattr $C$DW$T$212, DW_AT_name("icall_directAPIMsg_t")
    4634                            .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$210)
    4635                            .dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
    4636                            .dwattr $C$DW$T$212, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    4637                            .dwattr $C$DW$T$212, DW_AT_decl_line(0x3f7)
    4638                            .dwattr $C$DW$T$212, DW_AT_decl_column(0x03)
    4639                    
    4640                    
    4641                    $C$DW$T$213     .dwtag  DW_TAG_structure_type
    4642                            .dwattr $C$DW$T$213, DW_AT_byte_size(0x14)
    4643                    $C$DW$439       .dwtag  DW_TAG_member
    4644                            .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$211)
    4645                            .dwattr $C$DW$439, DW_AT_name("hdr")
    4646                            .dwattr $C$DW$439, DW_AT_TI_symbol_name("hdr")
    4647                            .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4648                            .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4649                            .dwattr $C$DW$439, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4650                            .dwattr $C$DW$439, DW_AT_decl_line(0x3fb)
    4651                            .dwattr $C$DW$439, DW_AT_decl_column(0x10)
    4652                    
    4653                    $C$DW$440       .dwtag  DW_TAG_member
    4654                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$212)
    4655                            .dwattr $C$DW$440, DW_AT_name("msg")
    4656                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("msg")
    4657                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4658                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4659                            .dwattr $C$DW$440, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4660                            .dwattr $C$DW$440, DW_AT_decl_line(0x3fc)
    4661                            .dwattr $C$DW$440, DW_AT_decl_column(0x1a)
    4662                    
    4663                            .dwattr $C$DW$T$213, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    4664                            .dwattr $C$DW$T$213, DW_AT_decl_line(0x3fa)
    4665                            .dwattr $C$DW$T$213, DW_AT_decl_column(0x01)
    4666                            .dwendtag $C$DW$T$213
    4667                    
    4668                    $C$DW$T$936     .dwtag  DW_TAG_typedef
    4669                            .dwattr $C$DW$T$936, DW_AT_name("icallLiteMsg_t")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   86

    4670                            .dwattr $C$DW$T$936, DW_AT_type(*$C$DW$T$213)
    4671                            .dwattr $C$DW$T$936, DW_AT_language(DW_LANG_C)
    4672                            .dwattr $C$DW$T$936, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    4673                            .dwattr $C$DW$T$936, DW_AT_decl_line(0x3fd)
    4674                            .dwattr $C$DW$T$936, DW_AT_decl_column(0x03)
    4675                    
    4676                    
    4677                    $C$DW$T$219     .dwtag  DW_TAG_structure_type
    4678                            .dwattr $C$DW$T$219, DW_AT_byte_size(0x1d)
    4679                    $C$DW$441       .dwtag  DW_TAG_member
    4680                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$214)
    4681                            .dwattr $C$DW$441, DW_AT_name("panId")
    4682                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("panId")
    4683                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4684                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4685                            .dwattr $C$DW$441, DW_AT_decl_file("..\Application\CoP\MT\mt_pkt.h")
    4686                            .dwattr $C$DW$441, DW_AT_decl_line(0x49)
    4687                            .dwattr $C$DW$441, DW_AT_decl_column(0x0d)
    4688                    
    4689                    $C$DW$442       .dwtag  DW_TAG_member
    4690                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$214)
    4691                            .dwattr $C$DW$442, DW_AT_name("shortAddr")
    4692                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("shortAddr")
    4693                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4694                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4695                            .dwattr $C$DW$442, DW_AT_decl_file("..\Application\CoP\MT\mt_pkt.h")
    4696                            .dwattr $C$DW$442, DW_AT_decl_line(0x4b)
    4697                            .dwattr $C$DW$442, DW_AT_decl_column(0x0d)
    4698                    
    4699                    $C$DW$443       .dwtag  DW_TAG_member
    4700                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$215)
    4701                            .dwattr $C$DW$443, DW_AT_name("extAddr")
    4702                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("extAddr")
    4703                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4704                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4705                            .dwattr $C$DW$443, DW_AT_decl_file("..\Application\CoP\MT\mt_pkt.h")
    4706                            .dwattr $C$DW$443, DW_AT_decl_line(0x4d)
    4707                            .dwattr $C$DW$443, DW_AT_decl_column(0x0d)
    4708                    
    4709                    $C$DW$444       .dwtag  DW_TAG_member
    4710                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$216)
    4711                            .dwattr $C$DW$444, DW_AT_name("frameCntr")
    4712                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("frameCntr")
    4713                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4714                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4715                            .dwattr $C$DW$444, DW_AT_decl_file("..\Application\CoP\MT\mt_pkt.h")
    4716                            .dwattr $C$DW$444, DW_AT_decl_line(0x4f)
    4717                            .dwattr $C$DW$444, DW_AT_decl_column(0x0d)
    4718                    
    4719                    $C$DW$445       .dwtag  DW_TAG_member
    4720                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$217)
    4721                            .dwattr $C$DW$445, DW_AT_name("exempt")
    4722                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("exempt")
    4723                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4724                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   87

    4725                            .dwattr $C$DW$445, DW_AT_decl_file("..\Application\CoP\MT\mt_pkt.h")
    4726                            .dwattr $C$DW$445, DW_AT_decl_line(0x51)
    4727                            .dwattr $C$DW$445, DW_AT_decl_column(0x0d)
    4728                    
    4729                    $C$DW$446       .dwtag  DW_TAG_member
    4730                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$217)
    4731                            .dwattr $C$DW$446, DW_AT_name("unique")
    4732                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("unique")
    4733                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4734                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4735                            .dwattr $C$DW$446, DW_AT_decl_file("..\Application\CoP\MT\mt_pkt.h")
    4736                            .dwattr $C$DW$446, DW_AT_decl_line(0x53)
    4737                            .dwattr $C$DW$446, DW_AT_decl_column(0x0d)
    4738                    
    4739                    $C$DW$447       .dwtag  DW_TAG_member
    4740                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$217)
    4741                            .dwattr $C$DW$447, DW_AT_name("duplicate")
    4742                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("duplicate")
    4743                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4744                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4745                            .dwattr $C$DW$447, DW_AT_decl_file("..\Application\CoP\MT\mt_pkt.h")
    4746                            .dwattr $C$DW$447, DW_AT_decl_line(0x55)
    4747                            .dwattr $C$DW$447, DW_AT_decl_column(0x0d)
    4748                    
    4749                    $C$DW$448       .dwtag  DW_TAG_member
    4750                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$217)
    4751                            .dwattr $C$DW$448, DW_AT_name("lookupSize")
    4752                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("lookupSize")
    4753                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    4754                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4755                            .dwattr $C$DW$448, DW_AT_decl_file("..\Application\CoP\MT\mt_pkt.h")
    4756                            .dwattr $C$DW$448, DW_AT_decl_line(0x57)
    4757                            .dwattr $C$DW$448, DW_AT_decl_column(0x0d)
    4758                    
    4759                    $C$DW$449       .dwtag  DW_TAG_member
    4760                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$218)
    4761                            .dwattr $C$DW$449, DW_AT_name("lookupData")
    4762                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("lookupData")
    4763                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4764                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4765                            .dwattr $C$DW$449, DW_AT_decl_file("..\Application\CoP\MT\mt_pkt.h")
    4766                            .dwattr $C$DW$449, DW_AT_decl_line(0x59)
    4767                            .dwattr $C$DW$449, DW_AT_decl_column(0x0d)
    4768                    
    4769                            .dwattr $C$DW$T$219, DW_AT_decl_file("..\Application\CoP\MT\mt_pkt.h")
    4770                            .dwattr $C$DW$T$219, DW_AT_decl_line(0x47)
    4771                            .dwattr $C$DW$T$219, DW_AT_decl_column(0x01)
    4772                            .dwendtag $C$DW$T$219
    4773                    
    4774                    $C$DW$T$937     .dwtag  DW_TAG_typedef
    4775                            .dwattr $C$DW$T$937, DW_AT_name("MtPkt_addDevReq_t")
    4776                            .dwattr $C$DW$T$937, DW_AT_type(*$C$DW$T$219)
    4777                            .dwattr $C$DW$T$937, DW_AT_language(DW_LANG_C)
    4778                            .dwattr $C$DW$T$937, DW_AT_decl_file("..\Application\CoP\MT\mt_pkt.h")
    4779                            .dwattr $C$DW$T$937, DW_AT_decl_line(0x5a)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{81691682-86F8-4FD6-AF1A-8AE5AFC725C4} PAGE   88

    4780                            .dwattr $C$DW$T$937, DW_AT_decl_column(0x03)
    4781                    
    4782                    
    4783                    $C$DW$T$220     .dwtag  DW_TAG_structure_type
    4784                            .dwattr $C$DW$T$220, DW_AT_byte_size(0x1a)
    4785                    $C$DW$450       .dwtag  DW_TAG_member
    4786                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$217)
    4787                            .dwattr $C$DW$450, DW_AT_name("logicalChan")
    4788                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("logicalChan")
    4789                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4790                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4791                            .dwattr $C$DW$450, DW_AT_decl_file("..\Application\CoP\MT\mt_pkt.h")
    4792                            .dwattr $C$DW$450, DW_AT_decl_line(0x60)
    4793                            .dwattr $C$DW$450, DW_AT_decl_column(0x0d)
    4794                    
    4795                    $C$DW$451       .dwtag  DW_TAG_member
    4796                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$217)
    4797                            .dwattr $C$DW$451, DW_AT_name("channelPage")
    4798                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("channelPage")
    4799                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4800                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4801                            .dwattr $C$DW$451, DW_AT_decl_file("..\Application\CoP\MT\mt_pkt.h")
    4802                            .dwattr $C$DW$451, DW_AT_decl_line(0x62)
    4803                            .dwattr $C$DW$451, DW_AT_decl_column(0x0d)
    4804                    
    4805                    $C$DW$452       .dwtag  DW_TAG_member
    4806                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$217)
    4807                            .dwattr $C$DW$452, DW_AT_name("phyId")
    4808                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("phyId")
    4809                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4810                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4811                            .dwattr $C$DW$452, DW_AT_decl_file("..\Application\CoP\MT\mt_pkt.h")
