TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Dec 12 17:41:41 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/CoP/NPI/npi_tl_uart.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\The_Wonderer\Google Drive\School\2018_3_Semester_Fa
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1122                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1123                            .dwattr $C$DW$84, DW_AT_decl_line(0x3e6)
    1124                            .dwattr $C$DW$84, DW_AT_decl_column(0x04)
    1125                    
    1126                    $C$DW$85        .dwtag  DW_TAG_enumerator
    1127                            .dwattr $C$DW$85, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    1128                            .dwattr $C$DW$85, DW_AT_const_value(0xe5)
    1129                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1130                            .dwattr $C$DW$85, DW_AT_decl_line(0x3e8)
    1131                            .dwattr $C$DW$85, DW_AT_decl_column(0x04)
    1132                    
    1133                            .dwattr $C$DW$T$863, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1134                            .dwattr $C$DW$T$863, DW_AT_decl_line(0x3dc)
    1135                            .dwattr $C$DW$T$863, DW_AT_decl_column(0x01)
    1136                            .dwendtag $C$DW$T$863
    1137                    
    1138                    $C$DW$T$864     .dwtag  DW_TAG_typedef
    1139                            .dwattr $C$DW$T$864, DW_AT_name("ICall_RemotiCmdEvent_t")
    1140                            .dwattr $C$DW$T$864, DW_AT_type(*$C$DW$T$863)
    1141                            .dwattr $C$DW$T$864, DW_AT_language(DW_LANG_C)
    1142                            .dwattr $C$DW$T$864, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1143                            .dwattr $C$DW$T$864, DW_AT_decl_line(0x3e9)
    1144                            .dwattr $C$DW$T$864, DW_AT_decl_column(0x02)
    1145                    
    1146                    
    1147                    $C$DW$T$865     .dwtag  DW_TAG_enumeration_type
    1148                            .dwattr $C$DW$T$865, DW_AT_byte_size(0x01)
    1149                    $C$DW$86        .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   22

    1150                            .dwattr $C$DW$86, DW_AT_name("PIN_SUCCESS")
    1151                            .dwattr $C$DW$86, DW_AT_const_value(0x00)
    1152                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/PI
    1153                            .dwattr $C$DW$86, DW_AT_decl_line(0x2cd)
    1154                            .dwattr $C$DW$86, DW_AT_decl_column(0x05)
    1155                    
    1156                    $C$DW$87        .dwtag  DW_TAG_enumerator
    1157                            .dwattr $C$DW$87, DW_AT_name("PIN_ALREADY_ALLOCATED")
    1158                            .dwattr $C$DW$87, DW_AT_const_value(0x01)
    1159                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/PI
    1160                            .dwattr $C$DW$87, DW_AT_decl_line(0x2ce)
    1161                            .dwattr $C$DW$87, DW_AT_decl_column(0x05)
    1162                    
    1163                    $C$DW$88        .dwtag  DW_TAG_enumerator
    1164                            .dwattr $C$DW$88, DW_AT_name("PIN_NO_ACCESS")
    1165                            .dwattr $C$DW$88, DW_AT_const_value(0x02)
    1166                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/PI
    1167                            .dwattr $C$DW$88, DW_AT_decl_line(0x2cf)
    1168                            .dwattr $C$DW$88, DW_AT_decl_column(0x05)
    1169                    
    1170                    $C$DW$89        .dwtag  DW_TAG_enumerator
    1171                            .dwattr $C$DW$89, DW_AT_name("PIN_UNSUPPORTED")
    1172                            .dwattr $C$DW$89, DW_AT_const_value(0x03)
    1173                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/PI
    1174                            .dwattr $C$DW$89, DW_AT_decl_line(0x2d0)
    1175                            .dwattr $C$DW$89, DW_AT_decl_column(0x05)
    1176                    
    1177                            .dwattr $C$DW$T$865, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    1178                            .dwattr $C$DW$T$865, DW_AT_decl_line(0x2cc)
    1179                            .dwattr $C$DW$T$865, DW_AT_decl_column(0x0e)
    1180                            .dwendtag $C$DW$T$865
    1181                    
    1182                    $C$DW$T$866     .dwtag  DW_TAG_typedef
    1183                            .dwattr $C$DW$T$866, DW_AT_name("PIN_Status")
    1184                            .dwattr $C$DW$T$866, DW_AT_type(*$C$DW$T$865)
    1185                            .dwattr $C$DW$T$866, DW_AT_language(DW_LANG_C)
    1186                            .dwattr $C$DW$T$866, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    1187                            .dwattr $C$DW$T$866, DW_AT_decl_line(0x2d1)
    1188                            .dwattr $C$DW$T$866, DW_AT_decl_column(0x03)
    1189                    
    1190                    
    1191                    $C$DW$T$141     .dwtag  DW_TAG_structure_type
    1192                            .dwattr $C$DW$T$141, DW_AT_byte_size(0x10)
    1193                    $C$DW$90        .dwtag  DW_TAG_member
    1194                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$14)
    1195                            .dwattr $C$DW$90, DW_AT_name("__max_align1")
    1196                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("__max_align1")
    1197                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1198                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1199                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/sy
    1200                            .dwattr $C$DW$90, DW_AT_decl_line(0x70)
    1201                            .dwattr $C$DW$90, DW_AT_decl_column(0x0c)
    1202                    
    1203                    $C$DW$91        .dwtag  DW_TAG_member
    1204                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$18)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   23

    1205                            .dwattr $C$DW$91, DW_AT_name("__max_align2")
    1206                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("__max_align2")
    1207                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1208                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1209                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/sy
    1210                            .dwattr $C$DW$91, DW_AT_decl_line(0x71)
    1211                            .dwattr $C$DW$91, DW_AT_decl_column(0x0e)
    1212                    
    1213                            .dwattr $C$DW$T$141, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1214                            .dwattr $C$DW$T$141, DW_AT_decl_line(0x6f)
    1215                            .dwattr $C$DW$T$141, DW_AT_decl_column(0x10)
    1216                            .dwendtag $C$DW$T$141
    1217                    
    1218                    $C$DW$T$867     .dwtag  DW_TAG_typedef
    1219                            .dwattr $C$DW$T$867, DW_AT_name("__max_align_t")
    1220                            .dwattr $C$DW$T$867, DW_AT_type(*$C$DW$T$141)
    1221                            .dwattr $C$DW$T$867, DW_AT_language(DW_LANG_C)
    1222                            .dwattr $C$DW$T$867, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1223                            .dwattr $C$DW$T$867, DW_AT_decl_line(0x72)
    1224                            .dwattr $C$DW$T$867, DW_AT_decl_column(0x03)
    1225                    
    1226                    
    1227                    $C$DW$T$145     .dwtag  DW_TAG_structure_type
    1228                            .dwattr $C$DW$T$145, DW_AT_byte_size(0x08)
    1229                    $C$DW$92        .dwtag  DW_TAG_member
    1230                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$10)
    1231                            .dwattr $C$DW$92, DW_AT_name("length")
    1232                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("length")
    1233                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1235                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packag
    1236                            .dwattr $C$DW$92, DW_AT_decl_line(0x36f)
    1237                            .dwattr $C$DW$92, DW_AT_decl_column(0x16)
    1238                    
    1239                    $C$DW$93        .dwtag  DW_TAG_member
    1240                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$144)
    1241                            .dwattr $C$DW$93, DW_AT_name("elem")
    1242                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("elem")
    1243                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1244                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1245                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packag
    1246                            .dwattr $C$DW$93, DW_AT_decl_line(0x36f)
    1247                            .dwattr $C$DW$93, DW_AT_decl_column(0x44)
    1248                    
    1249                            .dwattr $C$DW$T$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1250                            .dwattr $C$DW$T$145, DW_AT_decl_line(0x36f)
    1251                            .dwattr $C$DW$T$145, DW_AT_decl_column(0x10)
    1252                            .dwendtag $C$DW$T$145
    1253                    
    1254                    $C$DW$T$868     .dwtag  DW_TAG_typedef
    1255                            .dwattr $C$DW$T$868, DW_AT_name("ARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
    1256                            .dwattr $C$DW$T$868, DW_AT_type(*$C$DW$T$145)
    1257                            .dwattr $C$DW$T$868, DW_AT_language(DW_LANG_C)
    1258                            .dwattr $C$DW$T$868, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1259                            .dwattr $C$DW$T$868, DW_AT_decl_line(0x36f)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   24

    1260                            .dwattr $C$DW$T$868, DW_AT_decl_column(0x4c)
    1261                    
    1262                    
    1263                    $C$DW$T$148     .dwtag  DW_TAG_structure_type
    1264                            .dwattr $C$DW$T$148, DW_AT_byte_size(0x08)
    1265                    $C$DW$94        .dwtag  DW_TAG_member
    1266                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$10)
    1267                            .dwattr $C$DW$94, DW_AT_name("length")
    1268                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("length")
    1269                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1270                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1271                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packag
    1272                            .dwattr $C$DW$94, DW_AT_decl_line(0x370)
    1273                            .dwattr $C$DW$94, DW_AT_decl_column(0x16)
    1274                    
    1275                    $C$DW$95        .dwtag  DW_TAG_member
    1276                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$147)
    1277                            .dwattr $C$DW$95, DW_AT_name("elem")
    1278                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("elem")
    1279                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1280                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1281                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packag
    1282                            .dwattr $C$DW$95, DW_AT_decl_line(0x370)
    1283                            .dwattr $C$DW$95, DW_AT_decl_column(0x4a)
    1284                    
    1285                            .dwattr $C$DW$T$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1286                            .dwattr $C$DW$T$148, DW_AT_decl_line(0x370)
    1287                            .dwattr $C$DW$T$148, DW_AT_decl_column(0x10)
    1288                            .dwendtag $C$DW$T$148
    1289                    
    1290                    $C$DW$T$869     .dwtag  DW_TAG_typedef
    1291                            .dwattr $C$DW$T$869, DW_AT_name("CARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
    1292                            .dwattr $C$DW$T$869, DW_AT_type(*$C$DW$T$148)
    1293                            .dwattr $C$DW$T$869, DW_AT_language(DW_LANG_C)
    1294                            .dwattr $C$DW$T$869, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1295                            .dwattr $C$DW$T$869, DW_AT_decl_line(0x370)
    1296                            .dwattr $C$DW$T$869, DW_AT_decl_column(0x52)
    1297                    
    1298                    $C$DW$T$870     .dwtag  DW_TAG_typedef
    1299                            .dwattr $C$DW$T$870, DW_AT_name("CT__ti_sysbios_family_arm_m3_Hwi_hooks")
    1300                            .dwattr $C$DW$T$870, DW_AT_type(*$C$DW$T$869)
    1301                            .dwattr $C$DW$T$870, DW_AT_language(DW_LANG_C)
    1302                            .dwattr $C$DW$T$870, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1303                            .dwattr $C$DW$T$870, DW_AT_decl_line(0x372)
    1304                            .dwattr $C$DW$T$870, DW_AT_decl_column(0x34)
    1305                    
    1306                    $C$DW$T$871     .dwtag  DW_TAG_typedef
    1307                            .dwattr $C$DW$T$871, DW_AT_name("__TA_ti_sysbios_family_arm_m3_Hwi_hooks")
    1308                            .dwattr $C$DW$T$871, DW_AT_type(*$C$DW$T$869)
    1309                            .dwattr $C$DW$T$871, DW_AT_language(DW_LANG_C)
    1310                            .dwattr $C$DW$T$871, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1311                            .dwattr $C$DW$T$871, DW_AT_decl_line(0x371)
    1312                            .dwattr $C$DW$T$871, DW_AT_decl_column(0x34)
    1313                    
    1314                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   25

    1315                    $C$DW$T$149     .dwtag  DW_TAG_structure_type
    1316                            .dwattr $C$DW$T$149, DW_AT_byte_size(0x08)
    1317                    $C$DW$96        .dwtag  DW_TAG_member
    1318                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$10)
    1319                            .dwattr $C$DW$96, DW_AT_name("quot")
    1320                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("quot")
    1321                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1322                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1323                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/st
    1324                            .dwattr $C$DW$96, DW_AT_decl_line(0x49)
    1325                            .dwattr $C$DW$96, DW_AT_decl_column(0x16)
    1326                    
    1327                    $C$DW$97        .dwtag  DW_TAG_member
    1328                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$10)
    1329                            .dwattr $C$DW$97, DW_AT_name("rem")
    1330                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("rem")
    1331                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1332                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1333                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/st
    1334                            .dwattr $C$DW$97, DW_AT_decl_line(0x49)
    1335                            .dwattr $C$DW$97, DW_AT_decl_column(0x1c)
    1336                    
    1337                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1338                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x49)
    1339                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x10)
    1340                            .dwendtag $C$DW$T$149
    1341                    
    1342                    $C$DW$T$872     .dwtag  DW_TAG_typedef
    1343                            .dwattr $C$DW$T$872, DW_AT_name("div_t")
    1344                            .dwattr $C$DW$T$872, DW_AT_type(*$C$DW$T$149)
    1345                            .dwattr $C$DW$T$872, DW_AT_language(DW_LANG_C)
    1346                            .dwattr $C$DW$T$872, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1347                            .dwattr $C$DW$T$872, DW_AT_decl_line(0x49)
    1348                            .dwattr $C$DW$T$872, DW_AT_decl_column(0x23)
    1349                    
    1350                    
    1351                    $C$DW$T$150     .dwtag  DW_TAG_structure_type
    1352                            .dwattr $C$DW$T$150, DW_AT_byte_size(0x08)
    1353                    $C$DW$98        .dwtag  DW_TAG_member
    1354                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$10)
    1355                            .dwattr $C$DW$98, DW_AT_name("quot")
    1356                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("quot")
    1357                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1358                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1359                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/st
    1360                            .dwattr $C$DW$98, DW_AT_decl_line(0x4e)
    1361                            .dwattr $C$DW$98, DW_AT_decl_column(0x16)
    1362                    
    1363                    $C$DW$99        .dwtag  DW_TAG_member
    1364                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$10)
    1365                            .dwattr $C$DW$99, DW_AT_name("rem")
    1366                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("rem")
    1367                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1368                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1369                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/st
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   26

    1370                            .dwattr $C$DW$99, DW_AT_decl_line(0x4e)
    1371                            .dwattr $C$DW$99, DW_AT_decl_column(0x1c)
    1372                    
    1373                            .dwattr $C$DW$T$150, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1374                            .dwattr $C$DW$T$150, DW_AT_decl_line(0x4e)
    1375                            .dwattr $C$DW$T$150, DW_AT_decl_column(0x10)
    1376                            .dwendtag $C$DW$T$150
    1377                    
    1378                    $C$DW$T$873     .dwtag  DW_TAG_typedef
    1379                            .dwattr $C$DW$T$873, DW_AT_name("ldiv_t")
    1380                            .dwattr $C$DW$T$873, DW_AT_type(*$C$DW$T$150)
    1381                            .dwattr $C$DW$T$873, DW_AT_language(DW_LANG_C)
    1382                            .dwattr $C$DW$T$873, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1383                            .dwattr $C$DW$T$873, DW_AT_decl_line(0x4e)
    1384                            .dwattr $C$DW$T$873, DW_AT_decl_column(0x23)
    1385                    
    1386                    
    1387                    $C$DW$T$151     .dwtag  DW_TAG_structure_type
    1388                            .dwattr $C$DW$T$151, DW_AT_byte_size(0x10)
    1389                    $C$DW$100       .dwtag  DW_TAG_member
    1390                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$14)
    1391                            .dwattr $C$DW$100, DW_AT_name("quot")
    1392                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("quot")
    1393                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1394                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1395                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1396                            .dwattr $C$DW$100, DW_AT_decl_line(0x56)
    1397                            .dwattr $C$DW$100, DW_AT_decl_column(0x1c)
    1398                    
    1399                    $C$DW$101       .dwtag  DW_TAG_member
    1400                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$14)
    1401                            .dwattr $C$DW$101, DW_AT_name("rem")
    1402                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("rem")
    1403                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1404                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1405                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1406                            .dwattr $C$DW$101, DW_AT_decl_line(0x56)
    1407                            .dwattr $C$DW$101, DW_AT_decl_column(0x22)
    1408                    
    1409                            .dwattr $C$DW$T$151, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1410                            .dwattr $C$DW$T$151, DW_AT_decl_line(0x56)
    1411                            .dwattr $C$DW$T$151, DW_AT_decl_column(0x10)
    1412                            .dwendtag $C$DW$T$151
    1413                    
    1414                    $C$DW$T$874     .dwtag  DW_TAG_typedef
    1415                            .dwattr $C$DW$T$874, DW_AT_name("lldiv_t")
    1416                            .dwattr $C$DW$T$874, DW_AT_type(*$C$DW$T$151)
    1417                            .dwattr $C$DW$T$874, DW_AT_language(DW_LANG_C)
    1418                            .dwattr $C$DW$T$874, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1419                            .dwattr $C$DW$T$874, DW_AT_decl_line(0x56)
    1420                            .dwattr $C$DW$T$874, DW_AT_decl_column(0x29)
    1421                    
    1422                    
    1423                    $C$DW$T$157     .dwtag  DW_TAG_structure_type
    1424                            .dwattr $C$DW$T$157, DW_AT_byte_size(0x08)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   27

    1425                    $C$DW$102       .dwtag  DW_TAG_member
    1426                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$155)
    1427                            .dwattr $C$DW$102, DW_AT_name("pointerStack")
    1428                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("pointerStack")
    1429                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1430                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1431                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1432                            .dwattr $C$DW$102, DW_AT_decl_line(0x3f5)
    1433                            .dwattr $C$DW$102, DW_AT_decl_column(0x16)
    1434                    
    1435                    $C$DW$103       .dwtag  DW_TAG_member
    1436                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$156)
    1437                            .dwattr $C$DW$103, DW_AT_name("directAPI")
    1438                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("directAPI")
    1439                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1440                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1441                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1442                            .dwattr $C$DW$103, DW_AT_decl_line(0x3f6)
    1443                            .dwattr $C$DW$103, DW_AT_decl_column(0x15)
    1444                    
    1445                            .dwattr $C$DW$T$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1446                            .dwattr $C$DW$T$157, DW_AT_decl_line(0x3f4)
    1447                            .dwattr $C$DW$T$157, DW_AT_decl_column(0x01)
    1448                            .dwendtag $C$DW$T$157
    1449                    
    1450                    $C$DW$T$159     .dwtag  DW_TAG_typedef
    1451                            .dwattr $C$DW$T$159, DW_AT_name("icall_directAPIMsg_t")
    1452                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$157)
    1453                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    1454                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1455                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x3f7)
    1456                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x03)
    1457                    
    1458                    
    1459                    $C$DW$T$160     .dwtag  DW_TAG_structure_type
    1460                            .dwattr $C$DW$T$160, DW_AT_byte_size(0x14)
    1461                    $C$DW$104       .dwtag  DW_TAG_member
    1462                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$158)
    1463                            .dwattr $C$DW$104, DW_AT_name("hdr")
    1464                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("hdr")
    1465                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1466                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1467                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1468                            .dwattr $C$DW$104, DW_AT_decl_line(0x3fb)
    1469                            .dwattr $C$DW$104, DW_AT_decl_column(0x10)
    1470                    
    1471                    $C$DW$105       .dwtag  DW_TAG_member
    1472                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$159)
    1473                            .dwattr $C$DW$105, DW_AT_name("msg")
    1474                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("msg")
    1475                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1476                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1477                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1478                            .dwattr $C$DW$105, DW_AT_decl_line(0x3fc)
    1479                            .dwattr $C$DW$105, DW_AT_decl_column(0x1a)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   28

    1480                    
    1481                            .dwattr $C$DW$T$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1482                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x3fa)
    1483                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x01)
    1484                            .dwendtag $C$DW$T$160
    1485                    
    1486                    $C$DW$T$875     .dwtag  DW_TAG_typedef
    1487                            .dwattr $C$DW$T$875, DW_AT_name("icallLiteMsg_t")
    1488                            .dwattr $C$DW$T$875, DW_AT_type(*$C$DW$T$160)
    1489                            .dwattr $C$DW$T$875, DW_AT_language(DW_LANG_C)
    1490                            .dwattr $C$DW$T$875, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1491                            .dwattr $C$DW$T$875, DW_AT_decl_line(0x3fd)
    1492                            .dwattr $C$DW$T$875, DW_AT_decl_column(0x03)
    1493                    
    1494                    
    1495                    $C$DW$T$204     .dwtag  DW_TAG_structure_type
    1496                            .dwattr $C$DW$T$204, DW_AT_byte_size(0x4c)
    1497                    $C$DW$106       .dwtag  DW_TAG_member
    1498                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$167)
    1499                            .dwattr $C$DW$106, DW_AT_name("Crc32")
    1500                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("Crc32")
    1501                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1503                            .dwattr $C$DW$106, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1504                            .dwattr $C$DW$106, DW_AT_decl_line(0x76)
    1505                            .dwattr $C$DW$106, DW_AT_decl_column(0x25)
    1506                    
    1507                    $C$DW$107       .dwtag  DW_TAG_member
    1508                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$170)
    1509                            .dwattr $C$DW$107, DW_AT_name("FlashGetSize")
    1510                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("FlashGetSize")
    1511                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1512                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1513                            .dwattr $C$DW$107, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1514                            .dwattr $C$DW$107, DW_AT_decl_line(0x77)
    1515                            .dwattr $C$DW$107, DW_AT_decl_column(0x25)
    1516                    
    1517                    $C$DW$108       .dwtag  DW_TAG_member
    1518                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$171)
    1519                            .dwattr $C$DW$108, DW_AT_name("GetChipId")
    1520                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("GetChipId")
    1521                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1522                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1523                            .dwattr $C$DW$108, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1524                            .dwattr $C$DW$108, DW_AT_decl_line(0x78)
    1525                            .dwattr $C$DW$108, DW_AT_decl_column(0x25)
    1526                    
    1527                    $C$DW$109       .dwtag  DW_TAG_member
    1528                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$174)
    1529                            .dwattr $C$DW$109, DW_AT_name("ReservedLocation1")
    1530                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("ReservedLocation1")
    1531                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1532                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1533                            .dwattr $C$DW$109, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1534                            .dwattr $C$DW$109, DW_AT_decl_line(0x79)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   29

    1535                            .dwattr $C$DW$109, DW_AT_decl_column(0x25)
    1536                    
    1537                    $C$DW$110       .dwtag  DW_TAG_member
    1538                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$175)
    1539                            .dwattr $C$DW$110, DW_AT_name("ReservedLocation2")
    1540                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("ReservedLocation2")
    1541                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1542                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1543                            .dwattr $C$DW$110, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1544                            .dwattr $C$DW$110, DW_AT_decl_line(0x7a)
    1545                            .dwattr $C$DW$110, DW_AT_decl_column(0x25)
    1546                    
    1547                    $C$DW$111       .dwtag  DW_TAG_member
    1548                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$176)
    1549                            .dwattr $C$DW$111, DW_AT_name("ReservedLocation3")
    1550                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("ReservedLocation3")
    1551                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1552                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1553                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1554                            .dwattr $C$DW$111, DW_AT_decl_line(0x7b)
    1555                            .dwattr $C$DW$111, DW_AT_decl_column(0x25)
    1556                    
    1557                    $C$DW$112       .dwtag  DW_TAG_member
    1558                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$179)
    1559                            .dwattr $C$DW$112, DW_AT_name("ResetDevice")
    1560                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("ResetDevice")
    1561                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1562                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1563                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1564                            .dwattr $C$DW$112, DW_AT_decl_line(0x7c)
    1565                            .dwattr $C$DW$112, DW_AT_decl_column(0x25)
    1566                    
    1567                    $C$DW$113       .dwtag  DW_TAG_member
    1568                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$185)
    1569                            .dwattr $C$DW$113, DW_AT_name("Fletcher32")
    1570                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("Fletcher32")
    1571                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1572                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1573                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1574                            .dwattr $C$DW$113, DW_AT_decl_line(0x7d)
    1575                            .dwattr $C$DW$113, DW_AT_decl_column(0x25)
    1576                    
    1577                    $C$DW$114       .dwtag  DW_TAG_member
    1578                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$189)
    1579                            .dwattr $C$DW$114, DW_AT_name("MinValue")
    1580                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("MinValue")
    1581                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1582                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1583                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1584                            .dwattr $C$DW$114, DW_AT_decl_line(0x7e)
    1585                            .dwattr $C$DW$114, DW_AT_decl_column(0x25)
    1586                    
    1587                    $C$DW$115       .dwtag  DW_TAG_member
    1588                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$190)
    1589                            .dwattr $C$DW$115, DW_AT_name("MaxValue")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   30

    1590                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("MaxValue")
    1591                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1592                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1593                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1594                            .dwattr $C$DW$115, DW_AT_decl_line(0x7f)
    1595                            .dwattr $C$DW$115, DW_AT_decl_column(0x25)
    1596                    
    1597                    $C$DW$116       .dwtag  DW_TAG_member
    1598                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$191)
    1599                            .dwattr $C$DW$116, DW_AT_name("MeanValue")
    1600                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("MeanValue")
    1601                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1602                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1603                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1604                            .dwattr $C$DW$116, DW_AT_decl_line(0x80)
    1605                            .dwattr $C$DW$116, DW_AT_decl_column(0x25)
    1606                    
    1607                    $C$DW$117       .dwtag  DW_TAG_member
    1608                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$192)
    1609                            .dwattr $C$DW$117, DW_AT_name("StandDeviationValue")
    1610                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("StandDeviationValue")
    1611                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1612                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1613                            .dwattr $C$DW$117, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1614                            .dwattr $C$DW$117, DW_AT_decl_line(0x81)
    1615                            .dwattr $C$DW$117, DW_AT_decl_column(0x25)
    1616                    
    1617                    $C$DW$118       .dwtag  DW_TAG_member
    1618                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$195)
    1619                            .dwattr $C$DW$118, DW_AT_name("ReservedLocation4")
    1620                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("ReservedLocation4")
    1621                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1622                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1623                            .dwattr $C$DW$118, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1624                            .dwattr $C$DW$118, DW_AT_decl_line(0x82)
    1625                            .dwattr $C$DW$118, DW_AT_decl_column(0x25)
    1626                    
    1627                    $C$DW$119       .dwtag  DW_TAG_member
    1628                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$196)
    1629                            .dwattr $C$DW$119, DW_AT_name("ReservedLocation5")
    1630                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("ReservedLocation5")
    1631                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1632                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1633                            .dwattr $C$DW$119, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1634                            .dwattr $C$DW$119, DW_AT_decl_line(0x83)
    1635                            .dwattr $C$DW$119, DW_AT_decl_column(0x25)
    1636                    
    1637                    $C$DW$120       .dwtag  DW_TAG_member
    1638                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$197)
    1639                            .dwattr $C$DW$120, DW_AT_name("HFSourceSafeSwitch")
    1640                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    1641                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1642                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1643                            .dwattr $C$DW$120, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1644                            .dwattr $C$DW$120, DW_AT_decl_line(0x84)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   31

    1645                            .dwattr $C$DW$120, DW_AT_decl_column(0x25)
    1646                    
    1647                    $C$DW$121       .dwtag  DW_TAG_member
    1648                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$200)
    1649                            .dwattr $C$DW$121, DW_AT_name("SelectCompAInput")
    1650                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("SelectCompAInput")
    1651                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1652                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1653                            .dwattr $C$DW$121, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1654                            .dwattr $C$DW$121, DW_AT_decl_line(0x85)
    1655                            .dwattr $C$DW$121, DW_AT_decl_column(0x25)
    1656                    
    1657                    $C$DW$122       .dwtag  DW_TAG_member
    1658                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$201)
    1659                            .dwattr $C$DW$122, DW_AT_name("SelectCompARef")
    1660                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("SelectCompARef")
    1661                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1662                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1663                            .dwattr $C$DW$122, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1664                            .dwattr $C$DW$122, DW_AT_decl_line(0x86)
    1665                            .dwattr $C$DW$122, DW_AT_decl_column(0x25)
    1666                    
    1667                    $C$DW$123       .dwtag  DW_TAG_member
    1668                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$202)
    1669                            .dwattr $C$DW$123, DW_AT_name("SelectADCCompBInput")
    1670                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("SelectADCCompBInput")
    1671                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1672                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1673                            .dwattr $C$DW$123, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1674                            .dwattr $C$DW$123, DW_AT_decl_line(0x87)
    1675                            .dwattr $C$DW$123, DW_AT_decl_column(0x25)
    1676                    
    1677                    $C$DW$124       .dwtag  DW_TAG_member
    1678                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$203)
    1679                            .dwattr $C$DW$124, DW_AT_name("SelectCompBRef")
    1680                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("SelectCompBRef")
    1681                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1682                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1683                            .dwattr $C$DW$124, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1684                            .dwattr $C$DW$124, DW_AT_decl_line(0x88)
    1685                            .dwattr $C$DW$124, DW_AT_decl_column(0x25)
    1686                    
    1687                            .dwattr $C$DW$T$204, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    1688                            .dwattr $C$DW$T$204, DW_AT_decl_line(0x75)
    1689                            .dwattr $C$DW$T$204, DW_AT_decl_column(0x01)
    1690                            .dwendtag $C$DW$T$204
    1691                    
    1692                    $C$DW$T$876     .dwtag  DW_TAG_typedef
    1693                            .dwattr $C$DW$T$876, DW_AT_name("HARD_API_T")
    1694                            .dwattr $C$DW$T$876, DW_AT_type(*$C$DW$T$204)
    1695                            .dwattr $C$DW$T$876, DW_AT_language(DW_LANG_C)
    1696                            .dwattr $C$DW$T$876, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    1697                            .dwattr $C$DW$T$876, DW_AT_decl_line(0x89)
    1698                            .dwattr $C$DW$T$876, DW_AT_decl_column(0x03)
    1699                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   32

    1700                    
    1701                    $C$DW$T$207     .dwtag  DW_TAG_structure_type
    1702                            .dwattr $C$DW$T$207, DW_AT_byte_size(0x08)
    1703                    $C$DW$125       .dwtag  DW_TAG_member
    1704                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$10)
    1705                            .dwattr $C$DW$125, DW_AT_name("length")
    1706                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("length")
    1707                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1709                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1710                            .dwattr $C$DW$125, DW_AT_decl_line(0x165)
    1711                            .dwattr $C$DW$125, DW_AT_decl_column(0x16)
    1712                    
    1713                    $C$DW$126       .dwtag  DW_TAG_member
    1714                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$206)
    1715                            .dwattr $C$DW$126, DW_AT_name("elem")
    1716                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("elem")
    1717                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1718                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1719                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1720                            .dwattr $C$DW$126, DW_AT_decl_line(0x165)
    1721                            .dwattr $C$DW$126, DW_AT_decl_column(0x3a)
    1722                    
    1723                            .dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1724                            .dwattr $C$DW$T$207, DW_AT_decl_line(0x165)
    1725                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x10)
    1726                            .dwendtag $C$DW$T$207
    1727                    
    1728                    $C$DW$T$877     .dwtag  DW_TAG_typedef
    1729                            .dwattr $C$DW$T$877, DW_AT_name("ARRAY1_ti_sysbios_knl_Swi_hooks")
    1730                            .dwattr $C$DW$T$877, DW_AT_type(*$C$DW$T$207)
    1731                            .dwattr $C$DW$T$877, DW_AT_language(DW_LANG_C)
    1732                            .dwattr $C$DW$T$877, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1733                            .dwattr $C$DW$T$877, DW_AT_decl_line(0x165)
    1734                            .dwattr $C$DW$T$877, DW_AT_decl_column(0x42)
    1735                    
    1736                    
    1737                    $C$DW$T$210     .dwtag  DW_TAG_structure_type
    1738                            .dwattr $C$DW$T$210, DW_AT_byte_size(0x08)
    1739                    $C$DW$127       .dwtag  DW_TAG_member
    1740                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$10)
    1741                            .dwattr $C$DW$127, DW_AT_name("length")
    1742                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("length")
    1743                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1745                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1746                            .dwattr $C$DW$127, DW_AT_decl_line(0x166)
    1747                            .dwattr $C$DW$127, DW_AT_decl_column(0x16)
    1748                    
    1749                    $C$DW$128       .dwtag  DW_TAG_member
    1750                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$209)
    1751                            .dwattr $C$DW$128, DW_AT_name("elem")
    1752                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("elem")
    1753                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1754                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   33

    1755                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1756                            .dwattr $C$DW$128, DW_AT_decl_line(0x166)
    1757                            .dwattr $C$DW$128, DW_AT_decl_column(0x40)
    1758                    
    1759                            .dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1760                            .dwattr $C$DW$T$210, DW_AT_decl_line(0x166)
    1761                            .dwattr $C$DW$T$210, DW_AT_decl_column(0x10)
    1762                            .dwendtag $C$DW$T$210
    1763                    
    1764                    $C$DW$T$878     .dwtag  DW_TAG_typedef
    1765                            .dwattr $C$DW$T$878, DW_AT_name("CARRAY1_ti_sysbios_knl_Swi_hooks")
    1766                            .dwattr $C$DW$T$878, DW_AT_type(*$C$DW$T$210)
    1767                            .dwattr $C$DW$T$878, DW_AT_language(DW_LANG_C)
    1768                            .dwattr $C$DW$T$878, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1769                            .dwattr $C$DW$T$878, DW_AT_decl_line(0x166)
    1770                            .dwattr $C$DW$T$878, DW_AT_decl_column(0x48)
    1771                    
    1772                    $C$DW$T$879     .dwtag  DW_TAG_typedef
    1773                            .dwattr $C$DW$T$879, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    1774                            .dwattr $C$DW$T$879, DW_AT_type(*$C$DW$T$878)
    1775                            .dwattr $C$DW$T$879, DW_AT_language(DW_LANG_C)
    1776                            .dwattr $C$DW$T$879, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1777                            .dwattr $C$DW$T$879, DW_AT_decl_line(0x168)
    1778                            .dwattr $C$DW$T$879, DW_AT_decl_column(0x2a)
    1779                    
    1780                    $C$DW$T$880     .dwtag  DW_TAG_typedef
    1781                            .dwattr $C$DW$T$880, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    1782                            .dwattr $C$DW$T$880, DW_AT_type(*$C$DW$T$878)
    1783                            .dwattr $C$DW$T$880, DW_AT_language(DW_LANG_C)
    1784                            .dwattr $C$DW$T$880, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1785                            .dwattr $C$DW$T$880, DW_AT_decl_line(0x167)
    1786                            .dwattr $C$DW$T$880, DW_AT_decl_column(0x2a)
    1787                    
    1788                    
    1789                    $C$DW$T$213     .dwtag  DW_TAG_structure_type
    1790                            .dwattr $C$DW$T$213, DW_AT_byte_size(0x08)
    1791                    $C$DW$129       .dwtag  DW_TAG_member
    1792                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$10)
    1793                            .dwattr $C$DW$129, DW_AT_name("length")
    1794                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("length")
    1795                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1796                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1797                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1798                            .dwattr $C$DW$129, DW_AT_decl_line(0x29b)
    1799                            .dwattr $C$DW$129, DW_AT_decl_column(0x16)
    1800                    
    1801                    $C$DW$130       .dwtag  DW_TAG_member
    1802                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$212)
    1803                            .dwattr $C$DW$130, DW_AT_name("elem")
    1804                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("elem")
    1805                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1806                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1807                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1808                            .dwattr $C$DW$130, DW_AT_decl_line(0x29b)
    1809                            .dwattr $C$DW$130, DW_AT_decl_column(0x3b)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   34

    1810                    
    1811                            .dwattr $C$DW$T$213, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1812                            .dwattr $C$DW$T$213, DW_AT_decl_line(0x29b)
    1813                            .dwattr $C$DW$T$213, DW_AT_decl_column(0x10)
    1814                            .dwendtag $C$DW$T$213
    1815                    
    1816                    $C$DW$T$881     .dwtag  DW_TAG_typedef
    1817                            .dwattr $C$DW$T$881, DW_AT_name("ARRAY1_ti_sysbios_knl_Task_hooks")
    1818                            .dwattr $C$DW$T$881, DW_AT_type(*$C$DW$T$213)
    1819                            .dwattr $C$DW$T$881, DW_AT_language(DW_LANG_C)
    1820                            .dwattr $C$DW$T$881, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1821                            .dwattr $C$DW$T$881, DW_AT_decl_line(0x29b)
    1822                            .dwattr $C$DW$T$881, DW_AT_decl_column(0x43)
    1823                    
    1824                    
    1825                    $C$DW$T$216     .dwtag  DW_TAG_structure_type
    1826                            .dwattr $C$DW$T$216, DW_AT_byte_size(0x08)
    1827                    $C$DW$131       .dwtag  DW_TAG_member
    1828                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$10)
    1829                            .dwattr $C$DW$131, DW_AT_name("length")
    1830                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("length")
    1831                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1832                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1833                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1834                            .dwattr $C$DW$131, DW_AT_decl_line(0x29c)
    1835                            .dwattr $C$DW$131, DW_AT_decl_column(0x16)
    1836                    
    1837                    $C$DW$132       .dwtag  DW_TAG_member
    1838                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$215)
    1839                            .dwattr $C$DW$132, DW_AT_name("elem")
    1840                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("elem")
    1841                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1842                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1843                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1844                            .dwattr $C$DW$132, DW_AT_decl_line(0x29c)
    1845                            .dwattr $C$DW$132, DW_AT_decl_column(0x41)
    1846                    
    1847                            .dwattr $C$DW$T$216, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1848                            .dwattr $C$DW$T$216, DW_AT_decl_line(0x29c)
    1849                            .dwattr $C$DW$T$216, DW_AT_decl_column(0x10)
    1850                            .dwendtag $C$DW$T$216
    1851                    
    1852                    $C$DW$T$882     .dwtag  DW_TAG_typedef
    1853                            .dwattr $C$DW$T$882, DW_AT_name("CARRAY1_ti_sysbios_knl_Task_hooks")
    1854                            .dwattr $C$DW$T$882, DW_AT_type(*$C$DW$T$216)
    1855                            .dwattr $C$DW$T$882, DW_AT_language(DW_LANG_C)
    1856                            .dwattr $C$DW$T$882, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1857                            .dwattr $C$DW$T$882, DW_AT_decl_line(0x29c)
    1858                            .dwattr $C$DW$T$882, DW_AT_decl_column(0x49)
    1859                    
    1860                    $C$DW$T$883     .dwtag  DW_TAG_typedef
    1861                            .dwattr $C$DW$T$883, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
    1862                            .dwattr $C$DW$T$883, DW_AT_type(*$C$DW$T$882)
    1863                            .dwattr $C$DW$T$883, DW_AT_language(DW_LANG_C)
    1864                            .dwattr $C$DW$T$883, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   35

    1865                            .dwattr $C$DW$T$883, DW_AT_decl_line(0x29e)
    1866                            .dwattr $C$DW$T$883, DW_AT_decl_column(0x2b)
    1867                    
    1868                    $C$DW$T$884     .dwtag  DW_TAG_typedef
    1869                            .dwattr $C$DW$T$884, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
    1870                            .dwattr $C$DW$T$884, DW_AT_type(*$C$DW$T$882)
    1871                            .dwattr $C$DW$T$884, DW_AT_language(DW_LANG_C)
    1872                            .dwattr $C$DW$T$884, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1873                            .dwattr $C$DW$T$884, DW_AT_decl_line(0x29d)
    1874                            .dwattr $C$DW$T$884, DW_AT_decl_column(0x2b)
    1875                    
    1876                    
    1877                    $C$DW$T$222     .dwtag  DW_TAG_union_type
    1878                            .dwattr $C$DW$T$222, DW_AT_byte_size(0x04)
    1879                    $C$DW$133       .dwtag  DW_TAG_member
    1880                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$217)
    1881                            .dwattr $C$DW$133, DW_AT_name("f")
    1882                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("f")
    1883                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1884                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1885                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    1886                            .dwattr $C$DW$133, DW_AT_decl_line(0xb7)
    1887                            .dwattr $C$DW$133, DW_AT_decl_column(0x0f)
    1888                    
    1889                    $C$DW$134       .dwtag  DW_TAG_member
    1890                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$221)
    1891                            .dwattr $C$DW$134, DW_AT_name("a")
    1892                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("a")
    1893                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1894                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1895                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    1896                            .dwattr $C$DW$134, DW_AT_decl_line(0xb8)
    1897                            .dwattr $C$DW$134, DW_AT_decl_column(0x0f)
    1898                    
    1899                            .dwattr $C$DW$T$222, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    1900                            .dwattr $C$DW$T$222, DW_AT_decl_line(0xb6)
    1901                            .dwattr $C$DW$T$222, DW_AT_decl_column(0x0f)
    1902                            .dwendtag $C$DW$T$222
    1903                    
    1904                    $C$DW$T$885     .dwtag  DW_TAG_typedef
    1905                            .dwattr $C$DW$T$885, DW_AT_name("xdc_FloatData")
    1906                            .dwattr $C$DW$T$885, DW_AT_type(*$C$DW$T$222)
    1907                            .dwattr $C$DW$T$885, DW_AT_language(DW_LANG_C)
    1908                            .dwattr $C$DW$T$885, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    1909                            .dwattr $C$DW$T$885, DW_AT_decl_line(0xb9)
    1910                            .dwattr $C$DW$T$885, DW_AT_decl_column(0x03)
    1911                    
    1912                    
    1913                    $C$DW$T$229     .dwtag  DW_TAG_union_type
    1914                            .dwattr $C$DW$T$229, DW_AT_byte_size(0x02)
    1915                    $C$DW$135       .dwtag  DW_TAG_member
    1916                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$225)
    1917                            .dwattr $C$DW$135, DW_AT_name("entityId")
    1918                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("entityId")
    1919                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   36

    1920                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1921                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1922                            .dwattr $C$DW$135, DW_AT_decl_line(0x1fe)
    1923                            .dwattr $C$DW$135, DW_AT_decl_column(0x14)
    1924                    
    1925                    $C$DW$136       .dwtag  DW_TAG_member
    1926                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$228)
    1927                            .dwattr $C$DW$136, DW_AT_name("servId")
    1928                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("servId")
    1929                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1930                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1931                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1932                            .dwattr $C$DW$136, DW_AT_decl_line(0x200)
    1933                            .dwattr $C$DW$136, DW_AT_decl_column(0x17)
    1934                    
    1935                            .dwattr $C$DW$T$229, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1936                            .dwattr $C$DW$T$229, DW_AT_decl_line(0x1fc)
    1937                            .dwattr $C$DW$T$229, DW_AT_decl_column(0x03)
    1938                            .dwendtag $C$DW$T$229
    1939                    
    1940                    
    1941                    $C$DW$T$230     .dwtag  DW_TAG_union_type
    1942                            .dwattr $C$DW$T$230, DW_AT_byte_size(0x02)
    1943                    $C$DW$137       .dwtag  DW_TAG_member
    1944                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$228)
    1945                            .dwattr $C$DW$137, DW_AT_name("servId")
    1946                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("servId")
    1947                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1948                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1949                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1950                            .dwattr $C$DW$137, DW_AT_decl_line(0x211)
    1951                            .dwattr $C$DW$137, DW_AT_decl_column(0x17)
    1952                    
    1953                    $C$DW$138       .dwtag  DW_TAG_member
    1954                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$225)
    1955                            .dwattr $C$DW$138, DW_AT_name("entityId")
    1956                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("entityId")
    1957                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1958                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1959                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1960                            .dwattr $C$DW$138, DW_AT_decl_line(0x213)
    1961                            .dwattr $C$DW$138, DW_AT_decl_column(0x14)
    1962                    
    1963                            .dwattr $C$DW$T$230, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1964                            .dwattr $C$DW$T$230, DW_AT_decl_line(0x20f)
    1965                            .dwattr $C$DW$T$230, DW_AT_decl_column(0x03)
    1966                            .dwendtag $C$DW$T$230
    1967                    
    1968                    
    1969                    $C$DW$T$237     .dwtag  DW_TAG_structure_type
    1970                            .dwattr $C$DW$T$237, DW_AT_name(".ggroup1")
    1971                            .dwattr $C$DW$T$237, DW_AT_byte_size(0x34)
    1972                    $C$DW$139       .dwtag  DW_TAG_member
    1973                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$9)
    1974                            .dwattr $C$DW$139, DW_AT_name("TransportRxLen")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   37

    1975                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("TransportRxLen")
    1976                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1977                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1978                    
    1979                    $C$DW$140       .dwtag  DW_TAG_member
    1980                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$9)
    1981                            .dwattr $C$DW$140, DW_AT_name("TransportTxLen")
    1982                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("TransportTxLen")
    1983                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1984                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1985                    
    1986                    $C$DW$141       .dwtag  DW_TAG_member
    1987                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$231)
    1988                            .dwattr $C$DW$141, DW_AT_name("uartHandle")
    1989                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("uartHandle")
    1990                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1991                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1992                    
    1993                    $C$DW$142       .dwtag  DW_TAG_member
    1994                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$234)
    1995                            .dwattr $C$DW$142, DW_AT_name("npiTransmitCB")
    1996                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("npiTransmitCB")
    1997                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1998                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1999                    
    2000                    $C$DW$143       .dwtag  DW_TAG_member
    2001                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$235)
    2002                            .dwattr $C$DW$143, DW_AT_name("TransportRxBuf")
    2003                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("TransportRxBuf")
    2004                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2005                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2006                    
    2007                    $C$DW$144       .dwtag  DW_TAG_member
    2008                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$235)
    2009                            .dwattr $C$DW$144, DW_AT_name("TransportTxBuf")
    2010                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("TransportTxBuf")
    2011                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2012                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2013                    
    2014                    $C$DW$145       .dwtag  DW_TAG_member
    2015                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$236)
    2016                            .dwattr $C$DW$145, DW_AT_name("isrRxBuf")
    2017                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("isrRxBuf")
    2018                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2019                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2020                    
    2021                            .dwendtag $C$DW$T$237
    2022                    
    2023                    
    2024                    $C$DW$T$887     .dwtag  DW_TAG_enumeration_type
    2025                            .dwattr $C$DW$T$887, DW_AT_name("CC1350_LAUNCHXL_ADCBuf0ChannelName")
    2026                            .dwattr $C$DW$T$887, DW_AT_byte_size(0x01)
    2027                    $C$DW$146       .dwtag  DW_TAG_enumerator
    2028                            .dwattr $C$DW$146, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL0")
    2029                            .dwattr $C$DW$146, DW_AT_const_value(0x00)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   38

    2030                            .dwattr $C$DW$146, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2031                            .dwattr $C$DW$146, DW_AT_decl_line(0xba)
    2032                            .dwattr $C$DW$146, DW_AT_decl_column(0x05)
    2033                    
    2034                    $C$DW$147       .dwtag  DW_TAG_enumerator
    2035                            .dwattr $C$DW$147, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL1")
    2036                            .dwattr $C$DW$147, DW_AT_const_value(0x01)
    2037                            .dwattr $C$DW$147, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2038                            .dwattr $C$DW$147, DW_AT_decl_line(0xbb)
    2039                            .dwattr $C$DW$147, DW_AT_decl_column(0x05)
    2040                    
    2041                    $C$DW$148       .dwtag  DW_TAG_enumerator
    2042                            .dwattr $C$DW$148, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL2")
    2043                            .dwattr $C$DW$148, DW_AT_const_value(0x02)
    2044                            .dwattr $C$DW$148, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2045                            .dwattr $C$DW$148, DW_AT_decl_line(0xbc)
    2046                            .dwattr $C$DW$148, DW_AT_decl_column(0x05)
    2047                    
    2048                    $C$DW$149       .dwtag  DW_TAG_enumerator
    2049                            .dwattr $C$DW$149, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL3")
    2050                            .dwattr $C$DW$149, DW_AT_const_value(0x03)
    2051                            .dwattr $C$DW$149, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2052                            .dwattr $C$DW$149, DW_AT_decl_line(0xbd)
    2053                            .dwattr $C$DW$149, DW_AT_decl_column(0x05)
    2054                    
    2055                    $C$DW$150       .dwtag  DW_TAG_enumerator
    2056                            .dwattr $C$DW$150, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL4")
    2057                            .dwattr $C$DW$150, DW_AT_const_value(0x04)
    2058                            .dwattr $C$DW$150, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2059                            .dwattr $C$DW$150, DW_AT_decl_line(0xbe)
    2060                            .dwattr $C$DW$150, DW_AT_decl_column(0x05)
    2061                    
    2062                    $C$DW$151       .dwtag  DW_TAG_enumerator
    2063                            .dwattr $C$DW$151, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL5")
    2064                            .dwattr $C$DW$151, DW_AT_const_value(0x05)
    2065                            .dwattr $C$DW$151, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2066                            .dwattr $C$DW$151, DW_AT_decl_line(0xbf)
    2067                            .dwattr $C$DW$151, DW_AT_decl_column(0x05)
    2068                    
    2069                    $C$DW$152       .dwtag  DW_TAG_enumerator
    2070                            .dwattr $C$DW$152, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL6")
    2071                            .dwattr $C$DW$152, DW_AT_const_value(0x06)
    2072                            .dwattr $C$DW$152, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2073                            .dwattr $C$DW$152, DW_AT_decl_line(0xc0)
    2074                            .dwattr $C$DW$152, DW_AT_decl_column(0x05)
    2075                    
    2076                    $C$DW$153       .dwtag  DW_TAG_enumerator
    2077                            .dwattr $C$DW$153, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL7")
    2078                            .dwattr $C$DW$153, DW_AT_const_value(0x07)
    2079                            .dwattr $C$DW$153, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2080                            .dwattr $C$DW$153, DW_AT_decl_line(0xc1)
    2081                            .dwattr $C$DW$153, DW_AT_decl_column(0x05)
    2082                    
    2083                    $C$DW$154       .dwtag  DW_TAG_enumerator
    2084                            .dwattr $C$DW$154, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELVDDS")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   39

    2085                            .dwattr $C$DW$154, DW_AT_const_value(0x08)
    2086                            .dwattr $C$DW$154, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2087                            .dwattr $C$DW$154, DW_AT_decl_line(0xc2)
    2088                            .dwattr $C$DW$154, DW_AT_decl_column(0x05)
    2089                    
    2090                    $C$DW$155       .dwtag  DW_TAG_enumerator
    2091                            .dwattr $C$DW$155, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELDCOUPL")
    2092                            .dwattr $C$DW$155, DW_AT_const_value(0x09)
    2093                            .dwattr $C$DW$155, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2094                            .dwattr $C$DW$155, DW_AT_decl_line(0xc3)
    2095                            .dwattr $C$DW$155, DW_AT_decl_column(0x05)
    2096                    
    2097                    $C$DW$156       .dwtag  DW_TAG_enumerator
    2098                            .dwattr $C$DW$156, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELVSS")
    2099                            .dwattr $C$DW$156, DW_AT_const_value(0x0a)
    2100                            .dwattr $C$DW$156, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2101                            .dwattr $C$DW$156, DW_AT_decl_line(0xc4)
    2102                            .dwattr $C$DW$156, DW_AT_decl_column(0x05)
    2103                    
    2104                    $C$DW$157       .dwtag  DW_TAG_enumerator
    2105                            .dwattr $C$DW$157, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELCOUNT")
    2106                            .dwattr $C$DW$157, DW_AT_const_value(0x0b)
    2107                            .dwattr $C$DW$157, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2108                            .dwattr $C$DW$157, DW_AT_decl_line(0xc6)
    2109                            .dwattr $C$DW$157, DW_AT_decl_column(0x05)
    2110                    
    2111                            .dwattr $C$DW$T$887, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2112                            .dwattr $C$DW$T$887, DW_AT_decl_line(0xb9)
    2113                            .dwattr $C$DW$T$887, DW_AT_decl_column(0x0e)
    2114                            .dwendtag $C$DW$T$887
    2115                    
    2116                    $C$DW$T$888     .dwtag  DW_TAG_typedef
    2117                            .dwattr $C$DW$T$888, DW_AT_name("CC1350_LAUNCHXL_ADCBuf0ChannelName")
    2118                            .dwattr $C$DW$T$888, DW_AT_type(*$C$DW$T$887)
    2119                            .dwattr $C$DW$T$888, DW_AT_language(DW_LANG_C)
    2120                            .dwattr $C$DW$T$888, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2121                            .dwattr $C$DW$T$888, DW_AT_decl_line(0xc7)
    2122                            .dwattr $C$DW$T$888, DW_AT_decl_column(0x03)
    2123                    
    2124                    
    2125                    $C$DW$T$889     .dwtag  DW_TAG_enumeration_type
    2126                            .dwattr $C$DW$T$889, DW_AT_name("CC1350_LAUNCHXL_ADCBufName")
    2127                            .dwattr $C$DW$T$889, DW_AT_byte_size(0x01)
    2128                    $C$DW$158       .dwtag  DW_TAG_enumerator
    2129                            .dwattr $C$DW$158, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0")
    2130                            .dwattr $C$DW$158, DW_AT_const_value(0x00)
    2131                            .dwattr $C$DW$158, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2132                            .dwattr $C$DW$158, DW_AT_decl_line(0xb0)
    2133                            .dwattr $C$DW$158, DW_AT_decl_column(0x05)
    2134                    
    2135                    $C$DW$159       .dwtag  DW_TAG_enumerator
    2136                            .dwattr $C$DW$159, DW_AT_name("CC1350_LAUNCHXL_ADCBUFCOUNT")
    2137                            .dwattr $C$DW$159, DW_AT_const_value(0x01)
    2138                            .dwattr $C$DW$159, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2139                            .dwattr $C$DW$159, DW_AT_decl_line(0xb2)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   40

    2140                            .dwattr $C$DW$159, DW_AT_decl_column(0x05)
    2141                    
    2142                            .dwattr $C$DW$T$889, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2143                            .dwattr $C$DW$T$889, DW_AT_decl_line(0xaf)
    2144                            .dwattr $C$DW$T$889, DW_AT_decl_column(0x0e)
    2145                            .dwendtag $C$DW$T$889
    2146                    
    2147                    $C$DW$T$890     .dwtag  DW_TAG_typedef
    2148                            .dwattr $C$DW$T$890, DW_AT_name("CC1350_LAUNCHXL_ADCBufName")
    2149                            .dwattr $C$DW$T$890, DW_AT_type(*$C$DW$T$889)
    2150                            .dwattr $C$DW$T$890, DW_AT_language(DW_LANG_C)
    2151                            .dwattr $C$DW$T$890, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2152                            .dwattr $C$DW$T$890, DW_AT_decl_line(0xb3)
    2153                            .dwattr $C$DW$T$890, DW_AT_decl_column(0x03)
    2154                    
    2155                    
    2156                    $C$DW$T$891     .dwtag  DW_TAG_enumeration_type
    2157                            .dwattr $C$DW$T$891, DW_AT_name("CC1350_LAUNCHXL_ADCName")
    2158                            .dwattr $C$DW$T$891, DW_AT_byte_size(0x01)
    2159                    $C$DW$160       .dwtag  DW_TAG_enumerator
    2160                            .dwattr $C$DW$160, DW_AT_name("CC1350_LAUNCHXL_ADC0")
    2161                            .dwattr $C$DW$160, DW_AT_const_value(0x00)
    2162                            .dwattr $C$DW$160, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2163                            .dwattr $C$DW$160, DW_AT_decl_line(0xce)
    2164                            .dwattr $C$DW$160, DW_AT_decl_column(0x05)
    2165                    
    2166                    $C$DW$161       .dwtag  DW_TAG_enumerator
    2167                            .dwattr $C$DW$161, DW_AT_name("CC1350_LAUNCHXL_ADC1")
    2168                            .dwattr $C$DW$161, DW_AT_const_value(0x01)
    2169                            .dwattr $C$DW$161, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2170                            .dwattr $C$DW$161, DW_AT_decl_line(0xcf)
    2171                            .dwattr $C$DW$161, DW_AT_decl_column(0x05)
    2172                    
    2173                    $C$DW$162       .dwtag  DW_TAG_enumerator
    2174                            .dwattr $C$DW$162, DW_AT_name("CC1350_LAUNCHXL_ADC2")
    2175                            .dwattr $C$DW$162, DW_AT_const_value(0x02)
    2176                            .dwattr $C$DW$162, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2177                            .dwattr $C$DW$162, DW_AT_decl_line(0xd0)
    2178                            .dwattr $C$DW$162, DW_AT_decl_column(0x05)
    2179                    
    2180                    $C$DW$163       .dwtag  DW_TAG_enumerator
    2181                            .dwattr $C$DW$163, DW_AT_name("CC1350_LAUNCHXL_ADC3")
    2182                            .dwattr $C$DW$163, DW_AT_const_value(0x03)
    2183                            .dwattr $C$DW$163, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2184                            .dwattr $C$DW$163, DW_AT_decl_line(0xd1)
    2185                            .dwattr $C$DW$163, DW_AT_decl_column(0x05)
    2186                    
    2187                    $C$DW$164       .dwtag  DW_TAG_enumerator
    2188                            .dwattr $C$DW$164, DW_AT_name("CC1350_LAUNCHXL_ADC4")
    2189                            .dwattr $C$DW$164, DW_AT_const_value(0x04)
    2190                            .dwattr $C$DW$164, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2191                            .dwattr $C$DW$164, DW_AT_decl_line(0xd2)
    2192                            .dwattr $C$DW$164, DW_AT_decl_column(0x05)
    2193                    
    2194                    $C$DW$165       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   41

    2195                            .dwattr $C$DW$165, DW_AT_name("CC1350_LAUNCHXL_ADC5")
    2196                            .dwattr $C$DW$165, DW_AT_const_value(0x05)
    2197                            .dwattr $C$DW$165, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2198                            .dwattr $C$DW$165, DW_AT_decl_line(0xd3)
    2199                            .dwattr $C$DW$165, DW_AT_decl_column(0x05)
    2200                    
    2201                    $C$DW$166       .dwtag  DW_TAG_enumerator
    2202                            .dwattr $C$DW$166, DW_AT_name("CC1350_LAUNCHXL_ADC6")
    2203                            .dwattr $C$DW$166, DW_AT_const_value(0x06)
    2204                            .dwattr $C$DW$166, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2205                            .dwattr $C$DW$166, DW_AT_decl_line(0xd4)
    2206                            .dwattr $C$DW$166, DW_AT_decl_column(0x05)
    2207                    
    2208                    $C$DW$167       .dwtag  DW_TAG_enumerator
    2209                            .dwattr $C$DW$167, DW_AT_name("CC1350_LAUNCHXL_ADC7")
    2210                            .dwattr $C$DW$167, DW_AT_const_value(0x07)
    2211                            .dwattr $C$DW$167, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2212                            .dwattr $C$DW$167, DW_AT_decl_line(0xd5)
    2213                            .dwattr $C$DW$167, DW_AT_decl_column(0x05)
    2214                    
    2215                    $C$DW$168       .dwtag  DW_TAG_enumerator
    2216                            .dwattr $C$DW$168, DW_AT_name("CC1350_LAUNCHXL_ADCDCOUPL")
    2217                            .dwattr $C$DW$168, DW_AT_const_value(0x08)
    2218                            .dwattr $C$DW$168, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2219                            .dwattr $C$DW$168, DW_AT_decl_line(0xd6)
    2220                            .dwattr $C$DW$168, DW_AT_decl_column(0x05)
    2221                    
    2222                    $C$DW$169       .dwtag  DW_TAG_enumerator
    2223                            .dwattr $C$DW$169, DW_AT_name("CC1350_LAUNCHXL_ADCVSS")
    2224                            .dwattr $C$DW$169, DW_AT_const_value(0x09)
    2225                            .dwattr $C$DW$169, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2226                            .dwattr $C$DW$169, DW_AT_decl_line(0xd7)
    2227                            .dwattr $C$DW$169, DW_AT_decl_column(0x05)
    2228                    
    2229                    $C$DW$170       .dwtag  DW_TAG_enumerator
    2230                            .dwattr $C$DW$170, DW_AT_name("CC1350_LAUNCHXL_ADCVDDS")
    2231                            .dwattr $C$DW$170, DW_AT_const_value(0x0a)
    2232                            .dwattr $C$DW$170, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2233                            .dwattr $C$DW$170, DW_AT_decl_line(0xd8)
    2234                            .dwattr $C$DW$170, DW_AT_decl_column(0x05)
    2235                    
    2236                    $C$DW$171       .dwtag  DW_TAG_enumerator
    2237                            .dwattr $C$DW$171, DW_AT_name("CC1350_LAUNCHXL_ADCCOUNT")
    2238                            .dwattr $C$DW$171, DW_AT_const_value(0x0b)
    2239                            .dwattr $C$DW$171, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2240                            .dwattr $C$DW$171, DW_AT_decl_line(0xda)
    2241                            .dwattr $C$DW$171, DW_AT_decl_column(0x05)
    2242                    
    2243                            .dwattr $C$DW$T$891, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2244                            .dwattr $C$DW$T$891, DW_AT_decl_line(0xcd)
    2245                            .dwattr $C$DW$T$891, DW_AT_decl_column(0x0e)
    2246                            .dwendtag $C$DW$T$891
    2247                    
    2248                    $C$DW$T$892     .dwtag  DW_TAG_typedef
    2249                            .dwattr $C$DW$T$892, DW_AT_name("CC1350_LAUNCHXL_ADCName")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{69F199AD-4BAE-42BC-9166-839124552075} PAGE   42

    2250                            .dwattr $C$DW$T$892, DW_AT_type(*$C$DW$T$891)
    2251                            .dwattr $C$DW$T$892, DW_AT_language(DW_LANG_C)
    2252                            .dwattr $C$DW$T$892, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2253                            .dwattr $C$DW$T$892, DW_AT_decl_line(0xdb)
    2254                            .dwattr $C$DW$T$892, DW_AT_decl_column(0x03)
    2255                    
    2256                    
    2257                    $C$DW$T$893     .dwtag  DW_TAG_enumeration_type
    2258                            .dwattr $C$DW$T$893, DW_AT_name("CC1350_LAUNCHXL_CryptoName")
    2259                            .dwattr $C$DW$T$893, DW_AT_byte_size(0x01)
    2260                    $C$DW$172       .dwtag  DW_TAG_enumerator
    2261                            .dwattr $C$DW$172, DW_AT_name("CC1350_LAUNCHXL_CRYPTO0")
    2262                            .dwattr $C$DW$172, DW_AT_const_value(0x00)
    2263                            .dwattr $C$DW$172, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2264                            .dwattr $C$DW$172, DW_AT_decl_line(0xe2)
    2265                            .dwattr $C$DW$172, DW_AT_decl_column(0x05)
    2266                    
    2267                    $C$DW$173       .dwtag  DW_TAG_enumerator
    2268                            .dwattr $C$DW$173, DW_AT_name("CC1350_LAUNCHXL_CRYPTOCOUNT")
    2269                            .dwattr $C$DW$173, DW_AT_const_value(0x01)
    2270                            .dwattr $C$DW$173, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2271                            .dwattr $C$DW$173, DW_AT_decl_line(0xe4)
    2272                            .dwattr $C$DW$173, DW_AT_decl_column(0x05)
    2273                    
    2274                            .dwattr $C$DW$T$893, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2275                            .dwattr $C$DW$T$893, DW_AT_decl_line(0xe1)
    2276                            .dwattr $C$DW$T$893, DW_AT_decl_column(0x0e)
    2277                            .dwendtag $C$DW$T$893
    2278                    
    2279                    $C$DW$T$894     .dwtag  DW_TAG_typedef
    2280                            .dwattr $C$DW$T$894, DW_AT_name("CC1350_LAUNCHXL_CryptoName")
    2281                            .dwattr $C$DW$T$894, DW_AT_type(*$C$DW$T$893)
    2282                            .dwattr $C$DW$T$894, DW_AT_language(DW_LANG_C)
    2283                            .dwattr $C$DW$T$894, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2284                            .dwattr $C$DW$T$894, DW_AT_decl_line(0xe5)
    2285                            .dwattr $C$DW$T$894, DW_AT_decl_column(0x03)
    2286                    
    2287                    
    2288                    $C$DW$T$895     .dwtag  DW_TAG_enumeration_type
    2289                            .dwattr $C$DW$T$895, DW_AT_name("CC1350_LAUNCHXL_GPIOName")
    2290                            .dwattr $C$DW$T$895, DW_AT_byte_size(0x01)
    2291                    $C$DW$174       .dwtag  DW_TAG_enumerator
    2292                            .dwattr $C$DW$174, DW_AT_name("CC1350_LAUNCHXL_GPIO_S1")
    2293                            .dwattr $C$DW$174, DW_AT_const_value(0x00)
    2294                            .dwattr $C$DW$174, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2295                            .dwattr $C$DW$174, DW_AT_decl_line(0xec)
    2296                            .dwattr $C$DW$174, DW_AT_decl_column(0x05)
    2297                    
    2298                    $C$DW$175       .dwtag  DW_TAG_enumerator
    2299                            .dwattr $C$DW$175, DW_AT_name("CC1350_LAUNCHXL_GPIO_S2")
    2300                            .dwattr $C$DW$175, DW_AT_const_value(0x01)
    2301                            .dwattr $C$DW$175, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2302                            .dwattr $C$DW$175, DW_AT_decl_line(0xed)
    2303                            .dwattr $C$DW$175, DW_AT_decl_column(0x05)
    2304                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

