TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Dec 12 17:41:41 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/CoP/NPI/npi_task.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\The_Wonderer\Google Drive\School\2018_3_Semester_Fa
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    3251                            .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3252                            .dwattr $C$DW$249, DW_AT_decl_line(0x3e6)
    3253                            .dwattr $C$DW$249, DW_AT_decl_column(0x04)
    3254                    
    3255                    $C$DW$250       .dwtag  DW_TAG_enumerator
    3256                            .dwattr $C$DW$250, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    3257                            .dwattr $C$DW$250, DW_AT_const_value(0xe5)
    3258                            .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3259                            .dwattr $C$DW$250, DW_AT_decl_line(0x3e8)
    3260                            .dwattr $C$DW$250, DW_AT_decl_column(0x04)
    3261                    
    3262                            .dwattr $C$DW$T$656, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3263                            .dwattr $C$DW$T$656, DW_AT_decl_line(0x3dc)
    3264                            .dwattr $C$DW$T$656, DW_AT_decl_column(0x01)
    3265                            .dwendtag $C$DW$T$656
    3266                    
    3267                    $C$DW$T$657     .dwtag  DW_TAG_typedef
    3268                            .dwattr $C$DW$T$657, DW_AT_name("ICall_RemotiCmdEvent_t")
    3269                            .dwattr $C$DW$T$657, DW_AT_type(*$C$DW$T$656)
    3270                            .dwattr $C$DW$T$657, DW_AT_language(DW_LANG_C)
    3271                            .dwattr $C$DW$T$657, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3272                            .dwattr $C$DW$T$657, DW_AT_decl_line(0x3e9)
    3273                            .dwattr $C$DW$T$657, DW_AT_decl_column(0x02)
    3274                    
    3275                    
    3276                    $C$DW$T$658     .dwtag  DW_TAG_enumeration_type
    3277                            .dwattr $C$DW$T$658, DW_AT_byte_size(0x01)
    3278                    $C$DW$251       .dwtag  DW_TAG_enumerator
    3279                            .dwattr $C$DW$251, DW_AT_name("PIN_SUCCESS")
    3280                            .dwattr $C$DW$251, DW_AT_const_value(0x00)
    3281                            .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    3282                            .dwattr $C$DW$251, DW_AT_decl_line(0x2cd)
    3283                            .dwattr $C$DW$251, DW_AT_decl_column(0x05)
    3284                    
    3285                    $C$DW$252       .dwtag  DW_TAG_enumerator
    3286                            .dwattr $C$DW$252, DW_AT_name("PIN_ALREADY_ALLOCATED")
    3287                            .dwattr $C$DW$252, DW_AT_const_value(0x01)
    3288                            .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    3289                            .dwattr $C$DW$252, DW_AT_decl_line(0x2ce)
    3290                            .dwattr $C$DW$252, DW_AT_decl_column(0x05)
    3291                    
    3292                    $C$DW$253       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   61

    3293                            .dwattr $C$DW$253, DW_AT_name("PIN_NO_ACCESS")
    3294                            .dwattr $C$DW$253, DW_AT_const_value(0x02)
    3295                            .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    3296                            .dwattr $C$DW$253, DW_AT_decl_line(0x2cf)
    3297                            .dwattr $C$DW$253, DW_AT_decl_column(0x05)
    3298                    
    3299                    $C$DW$254       .dwtag  DW_TAG_enumerator
    3300                            .dwattr $C$DW$254, DW_AT_name("PIN_UNSUPPORTED")
    3301                            .dwattr $C$DW$254, DW_AT_const_value(0x03)
    3302                            .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    3303                            .dwattr $C$DW$254, DW_AT_decl_line(0x2d0)
    3304                            .dwattr $C$DW$254, DW_AT_decl_column(0x05)
    3305                    
    3306                            .dwattr $C$DW$T$658, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    3307                            .dwattr $C$DW$T$658, DW_AT_decl_line(0x2cc)
    3308                            .dwattr $C$DW$T$658, DW_AT_decl_column(0x0e)
    3309                            .dwendtag $C$DW$T$658
    3310                    
    3311                    $C$DW$T$659     .dwtag  DW_TAG_typedef
    3312                            .dwattr $C$DW$T$659, DW_AT_name("PIN_Status")
    3313                            .dwattr $C$DW$T$659, DW_AT_type(*$C$DW$T$658)
    3314                            .dwattr $C$DW$T$659, DW_AT_language(DW_LANG_C)
    3315                            .dwattr $C$DW$T$659, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    3316                            .dwattr $C$DW$T$659, DW_AT_decl_line(0x2d1)
    3317                            .dwattr $C$DW$T$659, DW_AT_decl_column(0x03)
    3318                    
    3319                    
    3320                    $C$DW$T$125     .dwtag  DW_TAG_structure_type
    3321                            .dwattr $C$DW$T$125, DW_AT_byte_size(0x10)
    3322                    $C$DW$255       .dwtag  DW_TAG_member
    3323                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$14)
    3324                            .dwattr $C$DW$255, DW_AT_name("__max_align1")
    3325                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("__max_align1")
    3326                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3327                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3328                            .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3329                            .dwattr $C$DW$255, DW_AT_decl_line(0x70)
    3330                            .dwattr $C$DW$255, DW_AT_decl_column(0x0c)
    3331                    
    3332                    $C$DW$256       .dwtag  DW_TAG_member
    3333                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$18)
    3334                            .dwattr $C$DW$256, DW_AT_name("__max_align2")
    3335                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("__max_align2")
    3336                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3337                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3338                            .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3339                            .dwattr $C$DW$256, DW_AT_decl_line(0x71)
    3340                            .dwattr $C$DW$256, DW_AT_decl_column(0x0e)
    3341                    
    3342                            .dwattr $C$DW$T$125, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3343                            .dwattr $C$DW$T$125, DW_AT_decl_line(0x6f)
    3344                            .dwattr $C$DW$T$125, DW_AT_decl_column(0x10)
    3345                            .dwendtag $C$DW$T$125
    3346                    
    3347                    $C$DW$T$660     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   62

    3348                            .dwattr $C$DW$T$660, DW_AT_name("__max_align_t")
    3349                            .dwattr $C$DW$T$660, DW_AT_type(*$C$DW$T$125)
    3350                            .dwattr $C$DW$T$660, DW_AT_language(DW_LANG_C)
    3351                            .dwattr $C$DW$T$660, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3352                            .dwattr $C$DW$T$660, DW_AT_decl_line(0x72)
    3353                            .dwattr $C$DW$T$660, DW_AT_decl_column(0x03)
    3354                    
    3355                    
    3356                    $C$DW$T$128     .dwtag  DW_TAG_structure_type
    3357                            .dwattr $C$DW$T$128, DW_AT_byte_size(0x08)
    3358                    $C$DW$257       .dwtag  DW_TAG_member
    3359                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$10)
    3360                            .dwattr $C$DW$257, DW_AT_name("length")
    3361                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("length")
    3362                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3363                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3364                            .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    3365                            .dwattr $C$DW$257, DW_AT_decl_line(0x165)
    3366                            .dwattr $C$DW$257, DW_AT_decl_column(0x16)
    3367                    
    3368                    $C$DW$258       .dwtag  DW_TAG_member
    3369                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$127)
    3370                            .dwattr $C$DW$258, DW_AT_name("elem")
    3371                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("elem")
    3372                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3373                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3374                            .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    3375                            .dwattr $C$DW$258, DW_AT_decl_line(0x165)
    3376                            .dwattr $C$DW$258, DW_AT_decl_column(0x3a)
    3377                    
    3378                            .dwattr $C$DW$T$128, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    3379                            .dwattr $C$DW$T$128, DW_AT_decl_line(0x165)
    3380                            .dwattr $C$DW$T$128, DW_AT_decl_column(0x10)
    3381                            .dwendtag $C$DW$T$128
    3382                    
    3383                    $C$DW$T$661     .dwtag  DW_TAG_typedef
    3384                            .dwattr $C$DW$T$661, DW_AT_name("ARRAY1_ti_sysbios_knl_Swi_hooks")
    3385                            .dwattr $C$DW$T$661, DW_AT_type(*$C$DW$T$128)
    3386                            .dwattr $C$DW$T$661, DW_AT_language(DW_LANG_C)
    3387                            .dwattr $C$DW$T$661, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    3388                            .dwattr $C$DW$T$661, DW_AT_decl_line(0x165)
    3389                            .dwattr $C$DW$T$661, DW_AT_decl_column(0x42)
    3390                    
    3391                    
    3392                    $C$DW$T$131     .dwtag  DW_TAG_structure_type
    3393                            .dwattr $C$DW$T$131, DW_AT_byte_size(0x08)
    3394                    $C$DW$259       .dwtag  DW_TAG_member
    3395                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$10)
    3396                            .dwattr $C$DW$259, DW_AT_name("length")
    3397                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("length")
    3398                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3399                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3400                            .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    3401                            .dwattr $C$DW$259, DW_AT_decl_line(0x166)
    3402                            .dwattr $C$DW$259, DW_AT_decl_column(0x16)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   63

    3403                    
    3404                    $C$DW$260       .dwtag  DW_TAG_member
    3405                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$130)
    3406                            .dwattr $C$DW$260, DW_AT_name("elem")
    3407                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("elem")
    3408                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3409                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3410                            .dwattr $C$DW$260, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    3411                            .dwattr $C$DW$260, DW_AT_decl_line(0x166)
    3412                            .dwattr $C$DW$260, DW_AT_decl_column(0x40)
    3413                    
    3414                            .dwattr $C$DW$T$131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    3415                            .dwattr $C$DW$T$131, DW_AT_decl_line(0x166)
    3416                            .dwattr $C$DW$T$131, DW_AT_decl_column(0x10)
    3417                            .dwendtag $C$DW$T$131
    3418                    
    3419                    $C$DW$T$662     .dwtag  DW_TAG_typedef
    3420                            .dwattr $C$DW$T$662, DW_AT_name("CARRAY1_ti_sysbios_knl_Swi_hooks")
    3421                            .dwattr $C$DW$T$662, DW_AT_type(*$C$DW$T$131)
    3422                            .dwattr $C$DW$T$662, DW_AT_language(DW_LANG_C)
    3423                            .dwattr $C$DW$T$662, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    3424                            .dwattr $C$DW$T$662, DW_AT_decl_line(0x166)
    3425                            .dwattr $C$DW$T$662, DW_AT_decl_column(0x48)
    3426                    
    3427                    $C$DW$T$663     .dwtag  DW_TAG_typedef
    3428                            .dwattr $C$DW$T$663, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    3429                            .dwattr $C$DW$T$663, DW_AT_type(*$C$DW$T$662)
    3430                            .dwattr $C$DW$T$663, DW_AT_language(DW_LANG_C)
    3431                            .dwattr $C$DW$T$663, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    3432                            .dwattr $C$DW$T$663, DW_AT_decl_line(0x168)
    3433                            .dwattr $C$DW$T$663, DW_AT_decl_column(0x2a)
    3434                    
    3435                    $C$DW$T$664     .dwtag  DW_TAG_typedef
    3436                            .dwattr $C$DW$T$664, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    3437                            .dwattr $C$DW$T$664, DW_AT_type(*$C$DW$T$662)
    3438                            .dwattr $C$DW$T$664, DW_AT_language(DW_LANG_C)
    3439                            .dwattr $C$DW$T$664, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    3440                            .dwattr $C$DW$T$664, DW_AT_decl_line(0x167)
    3441                            .dwattr $C$DW$T$664, DW_AT_decl_column(0x2a)
    3442                    
    3443                    
    3444                    $C$DW$T$134     .dwtag  DW_TAG_structure_type
    3445                            .dwattr $C$DW$T$134, DW_AT_byte_size(0x08)
    3446                    $C$DW$261       .dwtag  DW_TAG_member
    3447                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$10)
    3448                            .dwattr $C$DW$261, DW_AT_name("length")
    3449                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("length")
    3450                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3451                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3452                            .dwattr $C$DW$261, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    3453                            .dwattr $C$DW$261, DW_AT_decl_line(0x29b)
    3454                            .dwattr $C$DW$261, DW_AT_decl_column(0x16)
    3455                    
    3456                    $C$DW$262       .dwtag  DW_TAG_member
    3457                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$133)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   64

    3458                            .dwattr $C$DW$262, DW_AT_name("elem")
    3459                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("elem")
    3460                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3461                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3462                            .dwattr $C$DW$262, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    3463                            .dwattr $C$DW$262, DW_AT_decl_line(0x29b)
    3464                            .dwattr $C$DW$262, DW_AT_decl_column(0x3b)
    3465                    
    3466                            .dwattr $C$DW$T$134, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    3467                            .dwattr $C$DW$T$134, DW_AT_decl_line(0x29b)
    3468                            .dwattr $C$DW$T$134, DW_AT_decl_column(0x10)
    3469                            .dwendtag $C$DW$T$134
    3470                    
    3471                    $C$DW$T$665     .dwtag  DW_TAG_typedef
    3472                            .dwattr $C$DW$T$665, DW_AT_name("ARRAY1_ti_sysbios_knl_Task_hooks")
    3473                            .dwattr $C$DW$T$665, DW_AT_type(*$C$DW$T$134)
    3474                            .dwattr $C$DW$T$665, DW_AT_language(DW_LANG_C)
    3475                            .dwattr $C$DW$T$665, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    3476                            .dwattr $C$DW$T$665, DW_AT_decl_line(0x29b)
    3477                            .dwattr $C$DW$T$665, DW_AT_decl_column(0x43)
    3478                    
    3479                    
    3480                    $C$DW$T$137     .dwtag  DW_TAG_structure_type
    3481                            .dwattr $C$DW$T$137, DW_AT_byte_size(0x08)
    3482                    $C$DW$263       .dwtag  DW_TAG_member
    3483                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$10)
    3484                            .dwattr $C$DW$263, DW_AT_name("length")
    3485                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("length")
    3486                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3487                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3488                            .dwattr $C$DW$263, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    3489                            .dwattr $C$DW$263, DW_AT_decl_line(0x29c)
    3490                            .dwattr $C$DW$263, DW_AT_decl_column(0x16)
    3491                    
    3492                    $C$DW$264       .dwtag  DW_TAG_member
    3493                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$136)
    3494                            .dwattr $C$DW$264, DW_AT_name("elem")
    3495                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("elem")
    3496                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3497                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3498                            .dwattr $C$DW$264, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    3499                            .dwattr $C$DW$264, DW_AT_decl_line(0x29c)
    3500                            .dwattr $C$DW$264, DW_AT_decl_column(0x41)
    3501                    
    3502                            .dwattr $C$DW$T$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    3503                            .dwattr $C$DW$T$137, DW_AT_decl_line(0x29c)
    3504                            .dwattr $C$DW$T$137, DW_AT_decl_column(0x10)
    3505                            .dwendtag $C$DW$T$137
    3506                    
    3507                    $C$DW$T$666     .dwtag  DW_TAG_typedef
    3508                            .dwattr $C$DW$T$666, DW_AT_name("CARRAY1_ti_sysbios_knl_Task_hooks")
    3509                            .dwattr $C$DW$T$666, DW_AT_type(*$C$DW$T$137)
    3510                            .dwattr $C$DW$T$666, DW_AT_language(DW_LANG_C)
    3511                            .dwattr $C$DW$T$666, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    3512                            .dwattr $C$DW$T$666, DW_AT_decl_line(0x29c)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   65

    3513                            .dwattr $C$DW$T$666, DW_AT_decl_column(0x49)
    3514                    
    3515                    $C$DW$T$667     .dwtag  DW_TAG_typedef
    3516                            .dwattr $C$DW$T$667, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
    3517                            .dwattr $C$DW$T$667, DW_AT_type(*$C$DW$T$666)
    3518                            .dwattr $C$DW$T$667, DW_AT_language(DW_LANG_C)
    3519                            .dwattr $C$DW$T$667, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    3520                            .dwattr $C$DW$T$667, DW_AT_decl_line(0x29e)
    3521                            .dwattr $C$DW$T$667, DW_AT_decl_column(0x2b)
    3522                    
    3523                    $C$DW$T$668     .dwtag  DW_TAG_typedef
    3524                            .dwattr $C$DW$T$668, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
    3525                            .dwattr $C$DW$T$668, DW_AT_type(*$C$DW$T$666)
    3526                            .dwattr $C$DW$T$668, DW_AT_language(DW_LANG_C)
    3527                            .dwattr $C$DW$T$668, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    3528                            .dwattr $C$DW$T$668, DW_AT_decl_line(0x29d)
    3529                            .dwattr $C$DW$T$668, DW_AT_decl_column(0x2b)
    3530                    
    3531                    
    3532                    $C$DW$T$138     .dwtag  DW_TAG_structure_type
    3533                            .dwattr $C$DW$T$138, DW_AT_byte_size(0x08)
    3534                    $C$DW$265       .dwtag  DW_TAG_member
    3535                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$10)
    3536                            .dwattr $C$DW$265, DW_AT_name("quot")
    3537                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("quot")
    3538                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3539                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3540                            .dwattr $C$DW$265, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3541                            .dwattr $C$DW$265, DW_AT_decl_line(0x49)
    3542                            .dwattr $C$DW$265, DW_AT_decl_column(0x16)
    3543                    
    3544                    $C$DW$266       .dwtag  DW_TAG_member
    3545                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$10)
    3546                            .dwattr $C$DW$266, DW_AT_name("rem")
    3547                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("rem")
    3548                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3549                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3550                            .dwattr $C$DW$266, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3551                            .dwattr $C$DW$266, DW_AT_decl_line(0x49)
    3552                            .dwattr $C$DW$266, DW_AT_decl_column(0x1c)
    3553                    
    3554                            .dwattr $C$DW$T$138, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3555                            .dwattr $C$DW$T$138, DW_AT_decl_line(0x49)
    3556                            .dwattr $C$DW$T$138, DW_AT_decl_column(0x10)
    3557                            .dwendtag $C$DW$T$138
    3558                    
    3559                    $C$DW$T$669     .dwtag  DW_TAG_typedef
    3560                            .dwattr $C$DW$T$669, DW_AT_name("div_t")
    3561                            .dwattr $C$DW$T$669, DW_AT_type(*$C$DW$T$138)
    3562                            .dwattr $C$DW$T$669, DW_AT_language(DW_LANG_C)
    3563                            .dwattr $C$DW$T$669, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3564                            .dwattr $C$DW$T$669, DW_AT_decl_line(0x49)
    3565                            .dwattr $C$DW$T$669, DW_AT_decl_column(0x23)
    3566                    
    3567                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   66

    3568                    $C$DW$T$139     .dwtag  DW_TAG_structure_type
    3569                            .dwattr $C$DW$T$139, DW_AT_byte_size(0x08)
    3570                    $C$DW$267       .dwtag  DW_TAG_member
    3571                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$10)
    3572                            .dwattr $C$DW$267, DW_AT_name("quot")
    3573                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("quot")
    3574                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3575                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3576                            .dwattr $C$DW$267, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3577                            .dwattr $C$DW$267, DW_AT_decl_line(0x4e)
    3578                            .dwattr $C$DW$267, DW_AT_decl_column(0x16)
    3579                    
    3580                    $C$DW$268       .dwtag  DW_TAG_member
    3581                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$10)
    3582                            .dwattr $C$DW$268, DW_AT_name("rem")
    3583                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("rem")
    3584                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3585                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3586                            .dwattr $C$DW$268, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3587                            .dwattr $C$DW$268, DW_AT_decl_line(0x4e)
    3588                            .dwattr $C$DW$268, DW_AT_decl_column(0x1c)
    3589                    
    3590                            .dwattr $C$DW$T$139, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3591                            .dwattr $C$DW$T$139, DW_AT_decl_line(0x4e)
    3592                            .dwattr $C$DW$T$139, DW_AT_decl_column(0x10)
    3593                            .dwendtag $C$DW$T$139
    3594                    
    3595                    $C$DW$T$670     .dwtag  DW_TAG_typedef
    3596                            .dwattr $C$DW$T$670, DW_AT_name("ldiv_t")
    3597                            .dwattr $C$DW$T$670, DW_AT_type(*$C$DW$T$139)
    3598                            .dwattr $C$DW$T$670, DW_AT_language(DW_LANG_C)
    3599                            .dwattr $C$DW$T$670, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3600                            .dwattr $C$DW$T$670, DW_AT_decl_line(0x4e)
    3601                            .dwattr $C$DW$T$670, DW_AT_decl_column(0x23)
    3602                    
    3603                    
    3604                    $C$DW$T$140     .dwtag  DW_TAG_structure_type
    3605                            .dwattr $C$DW$T$140, DW_AT_byte_size(0x10)
    3606                    $C$DW$269       .dwtag  DW_TAG_member
    3607                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$14)
    3608                            .dwattr $C$DW$269, DW_AT_name("quot")
    3609                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("quot")
    3610                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3611                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3612                            .dwattr $C$DW$269, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3613                            .dwattr $C$DW$269, DW_AT_decl_line(0x56)
    3614                            .dwattr $C$DW$269, DW_AT_decl_column(0x1c)
    3615                    
    3616                    $C$DW$270       .dwtag  DW_TAG_member
    3617                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$14)
    3618                            .dwattr $C$DW$270, DW_AT_name("rem")
    3619                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("rem")
    3620                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3621                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3622                            .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   67

    3623                            .dwattr $C$DW$270, DW_AT_decl_line(0x56)
    3624                            .dwattr $C$DW$270, DW_AT_decl_column(0x22)
    3625                    
    3626                            .dwattr $C$DW$T$140, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3627                            .dwattr $C$DW$T$140, DW_AT_decl_line(0x56)
    3628                            .dwattr $C$DW$T$140, DW_AT_decl_column(0x10)
    3629                            .dwendtag $C$DW$T$140
    3630                    
    3631                    $C$DW$T$671     .dwtag  DW_TAG_typedef
    3632                            .dwattr $C$DW$T$671, DW_AT_name("lldiv_t")
    3633                            .dwattr $C$DW$T$671, DW_AT_type(*$C$DW$T$140)
    3634                            .dwattr $C$DW$T$671, DW_AT_language(DW_LANG_C)
    3635                            .dwattr $C$DW$T$671, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3636                            .dwattr $C$DW$T$671, DW_AT_decl_line(0x56)
    3637                            .dwattr $C$DW$T$671, DW_AT_decl_column(0x29)
    3638                    
    3639                    
    3640                    $C$DW$T$146     .dwtag  DW_TAG_structure_type
    3641                            .dwattr $C$DW$T$146, DW_AT_byte_size(0x08)
    3642                    $C$DW$271       .dwtag  DW_TAG_member
    3643                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$144)
    3644                            .dwattr $C$DW$271, DW_AT_name("pointerStack")
    3645                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("pointerStack")
    3646                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3647                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3648                            .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3649                            .dwattr $C$DW$271, DW_AT_decl_line(0x3f5)
    3650                            .dwattr $C$DW$271, DW_AT_decl_column(0x16)
    3651                    
    3652                    $C$DW$272       .dwtag  DW_TAG_member
    3653                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$145)
    3654                            .dwattr $C$DW$272, DW_AT_name("directAPI")
    3655                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("directAPI")
    3656                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3657                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3658                            .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3659                            .dwattr $C$DW$272, DW_AT_decl_line(0x3f6)
    3660                            .dwattr $C$DW$272, DW_AT_decl_column(0x15)
    3661                    
    3662                            .dwattr $C$DW$T$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3663                            .dwattr $C$DW$T$146, DW_AT_decl_line(0x3f4)
    3664                            .dwattr $C$DW$T$146, DW_AT_decl_column(0x01)
    3665                            .dwendtag $C$DW$T$146
    3666                    
    3667                    $C$DW$T$148     .dwtag  DW_TAG_typedef
    3668                            .dwattr $C$DW$T$148, DW_AT_name("icall_directAPIMsg_t")
    3669                            .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$146)
    3670                            .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
    3671                            .dwattr $C$DW$T$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3672                            .dwattr $C$DW$T$148, DW_AT_decl_line(0x3f7)
    3673                            .dwattr $C$DW$T$148, DW_AT_decl_column(0x03)
    3674                    
    3675                    
    3676                    $C$DW$T$149     .dwtag  DW_TAG_structure_type
    3677                            .dwattr $C$DW$T$149, DW_AT_byte_size(0x14)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   68

    3678                    $C$DW$273       .dwtag  DW_TAG_member
    3679                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$147)
    3680                            .dwattr $C$DW$273, DW_AT_name("hdr")
    3681                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("hdr")
    3682                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3683                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3684                            .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3685                            .dwattr $C$DW$273, DW_AT_decl_line(0x3fb)
    3686                            .dwattr $C$DW$273, DW_AT_decl_column(0x10)
    3687                    
    3688                    $C$DW$274       .dwtag  DW_TAG_member
    3689                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$148)
    3690                            .dwattr $C$DW$274, DW_AT_name("msg")
    3691                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("msg")
    3692                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3693                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3694                            .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3695                            .dwattr $C$DW$274, DW_AT_decl_line(0x3fc)
    3696                            .dwattr $C$DW$274, DW_AT_decl_column(0x1a)
    3697                    
    3698                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3699                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x3fa)
    3700                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x01)
    3701                            .dwendtag $C$DW$T$149
    3702                    
    3703                    $C$DW$T$672     .dwtag  DW_TAG_typedef
    3704                            .dwattr $C$DW$T$672, DW_AT_name("icallLiteMsg_t")
    3705                            .dwattr $C$DW$T$672, DW_AT_type(*$C$DW$T$149)
    3706                            .dwattr $C$DW$T$672, DW_AT_language(DW_LANG_C)
    3707                            .dwattr $C$DW$T$672, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3708                            .dwattr $C$DW$T$672, DW_AT_decl_line(0x3fd)
    3709                            .dwattr $C$DW$T$672, DW_AT_decl_column(0x03)
    3710                    
    3711                    
    3712                    $C$DW$T$151     .dwtag  DW_TAG_structure_type
    3713                            .dwattr $C$DW$T$151, DW_AT_byte_size(0x02)
    3714                    $C$DW$275       .dwtag  DW_TAG_member
    3715                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$150)
    3716                            .dwattr $C$DW$275, DW_AT_name("event")
    3717                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("event")
    3718                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3719                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3720                            .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3721                            .dwattr $C$DW$275, DW_AT_decl_line(0x79)
    3722                            .dwattr $C$DW$275, DW_AT_decl_column(0x0a)
    3723                    
    3724                    $C$DW$276       .dwtag  DW_TAG_member
    3725                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$150)
    3726                            .dwattr $C$DW$276, DW_AT_name("status")
    3727                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("status")
    3728                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3729                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3730                            .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3731                            .dwattr $C$DW$276, DW_AT_decl_line(0x7a)
    3732                            .dwattr $C$DW$276, DW_AT_decl_column(0x0a)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   69

    3733                    
    3734                            .dwattr $C$DW$T$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3735                            .dwattr $C$DW$T$151, DW_AT_decl_line(0x78)
    3736                            .dwattr $C$DW$T$151, DW_AT_decl_column(0x01)
    3737                            .dwendtag $C$DW$T$151
    3738                    
    3739                    $C$DW$T$673     .dwtag  DW_TAG_typedef
    3740                            .dwattr $C$DW$T$673, DW_AT_name("osal_event_hdr_t")
    3741                            .dwattr $C$DW$T$673, DW_AT_type(*$C$DW$T$151)
    3742                            .dwattr $C$DW$T$673, DW_AT_language(DW_LANG_C)
    3743                            .dwattr $C$DW$T$673, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3744                            .dwattr $C$DW$T$673, DW_AT_decl_line(0x7b)
    3745                            .dwattr $C$DW$T$673, DW_AT_decl_column(0x03)
    3746                    
    3747                    
    3748                    $C$DW$T$195     .dwtag  DW_TAG_structure_type
    3749                            .dwattr $C$DW$T$195, DW_AT_byte_size(0x4c)
    3750                    $C$DW$277       .dwtag  DW_TAG_member
    3751                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$158)
    3752                            .dwattr $C$DW$277, DW_AT_name("Crc32")
    3753                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("Crc32")
    3754                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3755                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3756                            .dwattr $C$DW$277, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3757                            .dwattr $C$DW$277, DW_AT_decl_line(0x76)
    3758                            .dwattr $C$DW$277, DW_AT_decl_column(0x25)
    3759                    
    3760                    $C$DW$278       .dwtag  DW_TAG_member
    3761                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$161)
    3762                            .dwattr $C$DW$278, DW_AT_name("FlashGetSize")
    3763                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("FlashGetSize")
    3764                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3765                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3766                            .dwattr $C$DW$278, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3767                            .dwattr $C$DW$278, DW_AT_decl_line(0x77)
    3768                            .dwattr $C$DW$278, DW_AT_decl_column(0x25)
    3769                    
    3770                    $C$DW$279       .dwtag  DW_TAG_member
    3771                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$162)
    3772                            .dwattr $C$DW$279, DW_AT_name("GetChipId")
    3773                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("GetChipId")
    3774                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3775                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3776                            .dwattr $C$DW$279, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3777                            .dwattr $C$DW$279, DW_AT_decl_line(0x78)
    3778                            .dwattr $C$DW$279, DW_AT_decl_column(0x25)
    3779                    
    3780                    $C$DW$280       .dwtag  DW_TAG_member
    3781                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$165)
    3782                            .dwattr $C$DW$280, DW_AT_name("ReservedLocation1")
    3783                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("ReservedLocation1")
    3784                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3785                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3786                            .dwattr $C$DW$280, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3787                            .dwattr $C$DW$280, DW_AT_decl_line(0x79)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   70

    3788                            .dwattr $C$DW$280, DW_AT_decl_column(0x25)
    3789                    
    3790                    $C$DW$281       .dwtag  DW_TAG_member
    3791                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$166)
    3792                            .dwattr $C$DW$281, DW_AT_name("ReservedLocation2")
    3793                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("ReservedLocation2")
    3794                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3795                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3796                            .dwattr $C$DW$281, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3797                            .dwattr $C$DW$281, DW_AT_decl_line(0x7a)
    3798                            .dwattr $C$DW$281, DW_AT_decl_column(0x25)
    3799                    
    3800                    $C$DW$282       .dwtag  DW_TAG_member
    3801                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$167)
    3802                            .dwattr $C$DW$282, DW_AT_name("ReservedLocation3")
    3803                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("ReservedLocation3")
    3804                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3805                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3806                            .dwattr $C$DW$282, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3807                            .dwattr $C$DW$282, DW_AT_decl_line(0x7b)
    3808                            .dwattr $C$DW$282, DW_AT_decl_column(0x25)
    3809                    
    3810                    $C$DW$283       .dwtag  DW_TAG_member
    3811                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$170)
    3812                            .dwattr $C$DW$283, DW_AT_name("ResetDevice")
    3813                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("ResetDevice")
    3814                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3815                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3816                            .dwattr $C$DW$283, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3817                            .dwattr $C$DW$283, DW_AT_decl_line(0x7c)
    3818                            .dwattr $C$DW$283, DW_AT_decl_column(0x25)
    3819                    
    3820                    $C$DW$284       .dwtag  DW_TAG_member
    3821                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$176)
    3822                            .dwattr $C$DW$284, DW_AT_name("Fletcher32")
    3823                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("Fletcher32")
    3824                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3825                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3826                            .dwattr $C$DW$284, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3827                            .dwattr $C$DW$284, DW_AT_decl_line(0x7d)
    3828                            .dwattr $C$DW$284, DW_AT_decl_column(0x25)
    3829                    
    3830                    $C$DW$285       .dwtag  DW_TAG_member
    3831                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$180)
    3832                            .dwattr $C$DW$285, DW_AT_name("MinValue")
    3833                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("MinValue")
    3834                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3835                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3836                            .dwattr $C$DW$285, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3837                            .dwattr $C$DW$285, DW_AT_decl_line(0x7e)
    3838                            .dwattr $C$DW$285, DW_AT_decl_column(0x25)
    3839                    
    3840                    $C$DW$286       .dwtag  DW_TAG_member
    3841                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$181)
    3842                            .dwattr $C$DW$286, DW_AT_name("MaxValue")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   71

    3843                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("MaxValue")
    3844                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3845                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3846                            .dwattr $C$DW$286, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3847                            .dwattr $C$DW$286, DW_AT_decl_line(0x7f)
    3848                            .dwattr $C$DW$286, DW_AT_decl_column(0x25)
    3849                    
    3850                    $C$DW$287       .dwtag  DW_TAG_member
    3851                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$182)
    3852                            .dwattr $C$DW$287, DW_AT_name("MeanValue")
    3853                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("MeanValue")
    3854                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3855                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3856                            .dwattr $C$DW$287, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3857                            .dwattr $C$DW$287, DW_AT_decl_line(0x80)
    3858                            .dwattr $C$DW$287, DW_AT_decl_column(0x25)
    3859                    
    3860                    $C$DW$288       .dwtag  DW_TAG_member
    3861                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$183)
    3862                            .dwattr $C$DW$288, DW_AT_name("StandDeviationValue")
    3863                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("StandDeviationValue")
    3864                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3865                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3866                            .dwattr $C$DW$288, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3867                            .dwattr $C$DW$288, DW_AT_decl_line(0x81)
    3868                            .dwattr $C$DW$288, DW_AT_decl_column(0x25)
    3869                    
    3870                    $C$DW$289       .dwtag  DW_TAG_member
    3871                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$186)
    3872                            .dwattr $C$DW$289, DW_AT_name("ReservedLocation4")
    3873                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("ReservedLocation4")
    3874                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3875                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3876                            .dwattr $C$DW$289, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3877                            .dwattr $C$DW$289, DW_AT_decl_line(0x82)
    3878                            .dwattr $C$DW$289, DW_AT_decl_column(0x25)
    3879                    
    3880                    $C$DW$290       .dwtag  DW_TAG_member
    3881                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$187)
    3882                            .dwattr $C$DW$290, DW_AT_name("ReservedLocation5")
    3883                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("ReservedLocation5")
    3884                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3885                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3886                            .dwattr $C$DW$290, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3887                            .dwattr $C$DW$290, DW_AT_decl_line(0x83)
    3888                            .dwattr $C$DW$290, DW_AT_decl_column(0x25)
    3889                    
    3890                    $C$DW$291       .dwtag  DW_TAG_member
    3891                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$188)
    3892                            .dwattr $C$DW$291, DW_AT_name("HFSourceSafeSwitch")
    3893                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    3894                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3895                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3896                            .dwattr $C$DW$291, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3897                            .dwattr $C$DW$291, DW_AT_decl_line(0x84)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   72

    3898                            .dwattr $C$DW$291, DW_AT_decl_column(0x25)
    3899                    
    3900                    $C$DW$292       .dwtag  DW_TAG_member
    3901                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$191)
    3902                            .dwattr $C$DW$292, DW_AT_name("SelectCompAInput")
    3903                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("SelectCompAInput")
    3904                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3905                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3906                            .dwattr $C$DW$292, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3907                            .dwattr $C$DW$292, DW_AT_decl_line(0x85)
    3908                            .dwattr $C$DW$292, DW_AT_decl_column(0x25)
    3909                    
    3910                    $C$DW$293       .dwtag  DW_TAG_member
    3911                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$192)
    3912                            .dwattr $C$DW$293, DW_AT_name("SelectCompARef")
    3913                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("SelectCompARef")
    3914                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3915                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3916                            .dwattr $C$DW$293, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3917                            .dwattr $C$DW$293, DW_AT_decl_line(0x86)
    3918                            .dwattr $C$DW$293, DW_AT_decl_column(0x25)
    3919                    
    3920                    $C$DW$294       .dwtag  DW_TAG_member
    3921                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$193)
    3922                            .dwattr $C$DW$294, DW_AT_name("SelectADCCompBInput")
    3923                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("SelectADCCompBInput")
    3924                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3925                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3926                            .dwattr $C$DW$294, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3927                            .dwattr $C$DW$294, DW_AT_decl_line(0x87)
    3928                            .dwattr $C$DW$294, DW_AT_decl_column(0x25)
    3929                    
    3930                    $C$DW$295       .dwtag  DW_TAG_member
    3931                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$194)
    3932                            .dwattr $C$DW$295, DW_AT_name("SelectCompBRef")
    3933                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("SelectCompBRef")
    3934                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3935                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3936                            .dwattr $C$DW$295, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3937                            .dwattr $C$DW$295, DW_AT_decl_line(0x88)
    3938                            .dwattr $C$DW$295, DW_AT_decl_column(0x25)
    3939                    
    3940                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    3941                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x75)
    3942                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x01)
    3943                            .dwendtag $C$DW$T$195
    3944                    
    3945                    $C$DW$T$674     .dwtag  DW_TAG_typedef
    3946                            .dwattr $C$DW$T$674, DW_AT_name("HARD_API_T")
    3947                            .dwattr $C$DW$T$674, DW_AT_type(*$C$DW$T$195)
    3948                            .dwattr $C$DW$T$674, DW_AT_language(DW_LANG_C)
    3949                            .dwattr $C$DW$T$674, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    3950                            .dwattr $C$DW$T$674, DW_AT_decl_line(0x89)
    3951                            .dwattr $C$DW$T$674, DW_AT_decl_column(0x03)
    3952                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   73

    3953                    
    3954                    $C$DW$T$202     .dwtag  DW_TAG_union_type
    3955                            .dwattr $C$DW$T$202, DW_AT_byte_size(0x02)
    3956                    $C$DW$296       .dwtag  DW_TAG_member
    3957                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$198)
    3958                            .dwattr $C$DW$296, DW_AT_name("entityId")
    3959                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("entityId")
    3960                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3961                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3962                            .dwattr $C$DW$296, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3963                            .dwattr $C$DW$296, DW_AT_decl_line(0x1fe)
    3964                            .dwattr $C$DW$296, DW_AT_decl_column(0x14)
    3965                    
    3966                    $C$DW$297       .dwtag  DW_TAG_member
    3967                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$201)
    3968                            .dwattr $C$DW$297, DW_AT_name("servId")
    3969                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("servId")
    3970                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3971                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3972                            .dwattr $C$DW$297, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3973                            .dwattr $C$DW$297, DW_AT_decl_line(0x200)
    3974                            .dwattr $C$DW$297, DW_AT_decl_column(0x17)
    3975                    
    3976                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3977                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x1fc)
    3978                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x03)
    3979                            .dwendtag $C$DW$T$202
    3980                    
    3981                    
    3982                    $C$DW$T$203     .dwtag  DW_TAG_union_type
    3983                            .dwattr $C$DW$T$203, DW_AT_byte_size(0x02)
    3984                    $C$DW$298       .dwtag  DW_TAG_member
    3985                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$201)
    3986                            .dwattr $C$DW$298, DW_AT_name("servId")
    3987                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("servId")
    3988                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3989                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3990                            .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3991                            .dwattr $C$DW$298, DW_AT_decl_line(0x211)
    3992                            .dwattr $C$DW$298, DW_AT_decl_column(0x17)
    3993                    
    3994                    $C$DW$299       .dwtag  DW_TAG_member
    3995                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$198)
    3996                            .dwattr $C$DW$299, DW_AT_name("entityId")
    3997                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("entityId")
    3998                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3999                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4000                            .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4001                            .dwattr $C$DW$299, DW_AT_decl_line(0x213)
    4002                            .dwattr $C$DW$299, DW_AT_decl_column(0x14)
    4003                    
    4004                            .dwattr $C$DW$T$203, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    4005                            .dwattr $C$DW$T$203, DW_AT_decl_line(0x20f)
    4006                            .dwattr $C$DW$T$203, DW_AT_decl_column(0x03)
    4007                            .dwendtag $C$DW$T$203
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   74

    4008                    
    4009                    
    4010                    $C$DW$T$209     .dwtag  DW_TAG_union_type
    4011                            .dwattr $C$DW$T$209, DW_AT_byte_size(0x04)
    4012                    $C$DW$300       .dwtag  DW_TAG_member
    4013                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$204)
    4014                            .dwattr $C$DW$300, DW_AT_name("f")
    4015                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("f")
    4016                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4017                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4018                            .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    4019                            .dwattr $C$DW$300, DW_AT_decl_line(0xb7)
    4020                            .dwattr $C$DW$300, DW_AT_decl_column(0x0f)
    4021                    
    4022                    $C$DW$301       .dwtag  DW_TAG_member
    4023                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$208)
    4024                            .dwattr $C$DW$301, DW_AT_name("a")
    4025                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("a")
    4026                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4027                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4028                            .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    4029                            .dwattr $C$DW$301, DW_AT_decl_line(0xb8)
    4030                            .dwattr $C$DW$301, DW_AT_decl_column(0x0f)
    4031                    
    4032                            .dwattr $C$DW$T$209, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    4033                            .dwattr $C$DW$T$209, DW_AT_decl_line(0xb6)
    4034                            .dwattr $C$DW$T$209, DW_AT_decl_column(0x0f)
    4035                            .dwendtag $C$DW$T$209
    4036                    
    4037                    $C$DW$T$675     .dwtag  DW_TAG_typedef
    4038                            .dwattr $C$DW$T$675, DW_AT_name("xdc_FloatData")
    4039                            .dwattr $C$DW$T$675, DW_AT_type(*$C$DW$T$209)
    4040                            .dwattr $C$DW$T$675, DW_AT_language(DW_LANG_C)
    4041                            .dwattr $C$DW$T$675, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    4042                            .dwattr $C$DW$T$675, DW_AT_decl_line(0xb9)
    4043                            .dwattr $C$DW$T$675, DW_AT_decl_column(0x03)
    4044                    
    4045                    
    4046                    $C$DW$T$215     .dwtag  DW_TAG_structure_type
    4047                            .dwattr $C$DW$T$215, DW_AT_name(".ggroup1")
    4048                            .dwattr $C$DW$T$215, DW_AT_byte_size(0x368)
    4049                    $C$DW$302       .dwtag  DW_TAG_member
    4050                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$6)
    4051                            .dwattr $C$DW$302, DW_AT_name("npiAppEntityID")
    4052                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("npiAppEntityID")
    4053                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4054                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4055                    
    4056                    $C$DW$303       .dwtag  DW_TAG_member
    4057                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$6)
    4058                            .dwattr $C$DW$303, DW_AT_name("incomingRXReroute")
    4059                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("incomingRXReroute")
    4060                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4061                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4062                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   75

    4063                    $C$DW$304       .dwtag  DW_TAG_member
    4064                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$6)
    4065                            .dwattr $C$DW$304, DW_AT_name("incomingTXReroute")
    4066                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("incomingTXReroute")
    4067                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4068                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4069                    
    4070                    $C$DW$305       .dwtag  DW_TAG_member
    4071                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$9)
    4072                            .dwattr $C$DW$305, DW_AT_name("NPITask_events")
    4073                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("NPITask_events")
    4074                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4075                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4076                    
    4077                    $C$DW$306       .dwtag  DW_TAG_member
    4078                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$9)
    4079                            .dwattr $C$DW$306, DW_AT_name("TX_DONE_ISR_EVENT_FLAG")
    4080                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("TX_DONE_ISR_EVENT_FLAG")
    4081                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4082                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4083                    
    4084                    $C$DW$307       .dwtag  DW_TAG_member
    4085                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$9)
    4086                            .dwattr $C$DW$307, DW_AT_name("MRDY_ISR_EVENT_FLAG")
    4087                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("MRDY_ISR_EVENT_FLAG")
    4088                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4089                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4090                    
    4091                    $C$DW$308       .dwtag  DW_TAG_member
    4092                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$9)
    4093                            .dwattr $C$DW$308, DW_AT_name("TRANSPORT_RX_ISR_EVENT_FLAG")
    4094                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("TRANSPORT_RX_ISR_EVENT_FLAG")
    4095                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4096                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4097                    
    4098                    $C$DW$309       .dwtag  DW_TAG_member
    4099                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$11)
    4100                            .dwattr $C$DW$309, DW_AT_name("stackServiceID")
    4101                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("stackServiceID")
    4102                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4103                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4104                    
    4105                    $C$DW$310       .dwtag  DW_TAG_member
    4106                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$210)
    4107                            .dwattr $C$DW$310, DW_AT_name("npiTxQueue")
    4108                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("npiTxQueue")
    4109                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4110                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4111                    
    4112                    $C$DW$311       .dwtag  DW_TAG_member
    4113                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$210)
    4114                            .dwattr $C$DW$311, DW_AT_name("npiRxQueue")
    4115                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("npiRxQueue")
    4116                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4117                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   76

    4118                    
    4119                    $C$DW$312       .dwtag  DW_TAG_member
    4120                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$211)
    4121                            .dwattr $C$DW$312, DW_AT_name("lastQueuedTxMsg")
    4122                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("lastQueuedTxMsg")
    4123                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4124                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4125                    
    4126                    $C$DW$313       .dwtag  DW_TAG_member
    4127                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$3)
    4128                            .dwattr $C$DW$313, DW_AT_name("appSem")
    4129                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("appSem")
    4130                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4131                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4132                    
    4133                    $C$DW$314       .dwtag  DW_TAG_member
    4134                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$213)
    4135                            .dwattr $C$DW$314, DW_AT_name("incomingRXEventAppCBFunc")
    4136                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("incomingRXEventAppCBFunc")
    4137                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4138                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4139                    
    4140                    $C$DW$315       .dwtag  DW_TAG_member
    4141                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$213)
    4142                            .dwattr $C$DW$315, DW_AT_name("incomingTXEventAppCBFunc")
    4143                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("incomingTXEventAppCBFunc")
    4144                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4145                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4146                    
    4147                    $C$DW$316       .dwtag  DW_TAG_member
    4148                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$528)
    4149                            .dwattr $C$DW$316, DW_AT_name("npiTaskStruct")
    4150                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("npiTaskStruct")
    4151                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4152                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    4153                    
    4154                    $C$DW$317       .dwtag  DW_TAG_member
    4155                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$214)
    4156                            .dwattr $C$DW$317, DW_AT_name("npiTaskStack")
    4157                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("npiTaskStack")
    4158                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4159                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    4160                    
    4161                            .dwendtag $C$DW$T$215
    4162                    
    4163                    
    4164                    $C$DW$T$677     .dwtag  DW_TAG_enumeration_type
    4165                            .dwattr $C$DW$T$677, DW_AT_name("CC1350_LAUNCHXL_ADCBuf0ChannelName")
    4166                            .dwattr $C$DW$T$677, DW_AT_byte_size(0x01)
    4167                    $C$DW$318       .dwtag  DW_TAG_enumerator
    4168                            .dwattr $C$DW$318, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL0")
    4169                            .dwattr $C$DW$318, DW_AT_const_value(0x00)
    4170                            .dwattr $C$DW$318, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4171                            .dwattr $C$DW$318, DW_AT_decl_line(0xba)
    4172                            .dwattr $C$DW$318, DW_AT_decl_column(0x05)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   77

    4173                    
    4174                    $C$DW$319       .dwtag  DW_TAG_enumerator
    4175                            .dwattr $C$DW$319, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL1")
    4176                            .dwattr $C$DW$319, DW_AT_const_value(0x01)
    4177                            .dwattr $C$DW$319, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4178                            .dwattr $C$DW$319, DW_AT_decl_line(0xbb)
    4179                            .dwattr $C$DW$319, DW_AT_decl_column(0x05)
    4180                    
    4181                    $C$DW$320       .dwtag  DW_TAG_enumerator
    4182                            .dwattr $C$DW$320, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL2")
    4183                            .dwattr $C$DW$320, DW_AT_const_value(0x02)
    4184                            .dwattr $C$DW$320, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4185                            .dwattr $C$DW$320, DW_AT_decl_line(0xbc)
    4186                            .dwattr $C$DW$320, DW_AT_decl_column(0x05)
    4187                    
    4188                    $C$DW$321       .dwtag  DW_TAG_enumerator
    4189                            .dwattr $C$DW$321, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL3")
    4190                            .dwattr $C$DW$321, DW_AT_const_value(0x03)
    4191                            .dwattr $C$DW$321, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4192                            .dwattr $C$DW$321, DW_AT_decl_line(0xbd)
    4193                            .dwattr $C$DW$321, DW_AT_decl_column(0x05)
    4194                    
    4195                    $C$DW$322       .dwtag  DW_TAG_enumerator
    4196                            .dwattr $C$DW$322, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL4")
    4197                            .dwattr $C$DW$322, DW_AT_const_value(0x04)
    4198                            .dwattr $C$DW$322, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4199                            .dwattr $C$DW$322, DW_AT_decl_line(0xbe)
    4200                            .dwattr $C$DW$322, DW_AT_decl_column(0x05)
    4201                    
    4202                    $C$DW$323       .dwtag  DW_TAG_enumerator
    4203                            .dwattr $C$DW$323, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL5")
    4204                            .dwattr $C$DW$323, DW_AT_const_value(0x05)
    4205                            .dwattr $C$DW$323, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4206                            .dwattr $C$DW$323, DW_AT_decl_line(0xbf)
    4207                            .dwattr $C$DW$323, DW_AT_decl_column(0x05)
    4208                    
    4209                    $C$DW$324       .dwtag  DW_TAG_enumerator
    4210                            .dwattr $C$DW$324, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL6")
    4211                            .dwattr $C$DW$324, DW_AT_const_value(0x06)
    4212                            .dwattr $C$DW$324, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4213                            .dwattr $C$DW$324, DW_AT_decl_line(0xc0)
    4214                            .dwattr $C$DW$324, DW_AT_decl_column(0x05)
    4215                    
    4216                    $C$DW$325       .dwtag  DW_TAG_enumerator
    4217                            .dwattr $C$DW$325, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL7")
    4218                            .dwattr $C$DW$325, DW_AT_const_value(0x07)
    4219                            .dwattr $C$DW$325, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4220                            .dwattr $C$DW$325, DW_AT_decl_line(0xc1)
    4221                            .dwattr $C$DW$325, DW_AT_decl_column(0x05)
    4222                    
    4223                    $C$DW$326       .dwtag  DW_TAG_enumerator
    4224                            .dwattr $C$DW$326, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELVDDS")
    4225                            .dwattr $C$DW$326, DW_AT_const_value(0x08)
    4226                            .dwattr $C$DW$326, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4227                            .dwattr $C$DW$326, DW_AT_decl_line(0xc2)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   78

    4228                            .dwattr $C$DW$326, DW_AT_decl_column(0x05)
    4229                    
    4230                    $C$DW$327       .dwtag  DW_TAG_enumerator
    4231                            .dwattr $C$DW$327, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELDCOUPL")
    4232                            .dwattr $C$DW$327, DW_AT_const_value(0x09)
    4233                            .dwattr $C$DW$327, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4234                            .dwattr $C$DW$327, DW_AT_decl_line(0xc3)
    4235                            .dwattr $C$DW$327, DW_AT_decl_column(0x05)
    4236                    
    4237                    $C$DW$328       .dwtag  DW_TAG_enumerator
    4238                            .dwattr $C$DW$328, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELVSS")
    4239                            .dwattr $C$DW$328, DW_AT_const_value(0x0a)
    4240                            .dwattr $C$DW$328, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4241                            .dwattr $C$DW$328, DW_AT_decl_line(0xc4)
    4242                            .dwattr $C$DW$328, DW_AT_decl_column(0x05)
    4243                    
    4244                    $C$DW$329       .dwtag  DW_TAG_enumerator
    4245                            .dwattr $C$DW$329, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELCOUNT")
    4246                            .dwattr $C$DW$329, DW_AT_const_value(0x0b)
    4247                            .dwattr $C$DW$329, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4248                            .dwattr $C$DW$329, DW_AT_decl_line(0xc6)
    4249                            .dwattr $C$DW$329, DW_AT_decl_column(0x05)
    4250                    
    4251                            .dwattr $C$DW$T$677, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    4252                            .dwattr $C$DW$T$677, DW_AT_decl_line(0xb9)
    4253                            .dwattr $C$DW$T$677, DW_AT_decl_column(0x0e)
    4254                            .dwendtag $C$DW$T$677
    4255                    
    4256                    $C$DW$T$678     .dwtag  DW_TAG_typedef
    4257                            .dwattr $C$DW$T$678, DW_AT_name("CC1350_LAUNCHXL_ADCBuf0ChannelName")
    4258                            .dwattr $C$DW$T$678, DW_AT_type(*$C$DW$T$677)
    4259                            .dwattr $C$DW$T$678, DW_AT_language(DW_LANG_C)
    4260                            .dwattr $C$DW$T$678, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    4261                            .dwattr $C$DW$T$678, DW_AT_decl_line(0xc7)
    4262                            .dwattr $C$DW$T$678, DW_AT_decl_column(0x03)
    4263                    
    4264                    
    4265                    $C$DW$T$679     .dwtag  DW_TAG_enumeration_type
    4266                            .dwattr $C$DW$T$679, DW_AT_name("CC1350_LAUNCHXL_ADCBufName")
    4267                            .dwattr $C$DW$T$679, DW_AT_byte_size(0x01)
    4268                    $C$DW$330       .dwtag  DW_TAG_enumerator
    4269                            .dwattr $C$DW$330, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0")
    4270                            .dwattr $C$DW$330, DW_AT_const_value(0x00)
    4271                            .dwattr $C$DW$330, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4272                            .dwattr $C$DW$330, DW_AT_decl_line(0xb0)
    4273                            .dwattr $C$DW$330, DW_AT_decl_column(0x05)
    4274                    
    4275                    $C$DW$331       .dwtag  DW_TAG_enumerator
    4276                            .dwattr $C$DW$331, DW_AT_name("CC1350_LAUNCHXL_ADCBUFCOUNT")
    4277                            .dwattr $C$DW$331, DW_AT_const_value(0x01)
    4278                            .dwattr $C$DW$331, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4279                            .dwattr $C$DW$331, DW_AT_decl_line(0xb2)
    4280                            .dwattr $C$DW$331, DW_AT_decl_column(0x05)
    4281                    
    4282                            .dwattr $C$DW$T$679, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   79

    4283                            .dwattr $C$DW$T$679, DW_AT_decl_line(0xaf)
    4284                            .dwattr $C$DW$T$679, DW_AT_decl_column(0x0e)
    4285                            .dwendtag $C$DW$T$679
    4286                    
    4287                    $C$DW$T$680     .dwtag  DW_TAG_typedef
    4288                            .dwattr $C$DW$T$680, DW_AT_name("CC1350_LAUNCHXL_ADCBufName")
    4289                            .dwattr $C$DW$T$680, DW_AT_type(*$C$DW$T$679)
    4290                            .dwattr $C$DW$T$680, DW_AT_language(DW_LANG_C)
    4291                            .dwattr $C$DW$T$680, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    4292                            .dwattr $C$DW$T$680, DW_AT_decl_line(0xb3)
    4293                            .dwattr $C$DW$T$680, DW_AT_decl_column(0x03)
    4294                    
    4295                    
    4296                    $C$DW$T$681     .dwtag  DW_TAG_enumeration_type
    4297                            .dwattr $C$DW$T$681, DW_AT_name("CC1350_LAUNCHXL_ADCName")
    4298                            .dwattr $C$DW$T$681, DW_AT_byte_size(0x01)
    4299                    $C$DW$332       .dwtag  DW_TAG_enumerator
    4300                            .dwattr $C$DW$332, DW_AT_name("CC1350_LAUNCHXL_ADC0")
    4301                            .dwattr $C$DW$332, DW_AT_const_value(0x00)
    4302                            .dwattr $C$DW$332, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4303                            .dwattr $C$DW$332, DW_AT_decl_line(0xce)
    4304                            .dwattr $C$DW$332, DW_AT_decl_column(0x05)
    4305                    
    4306                    $C$DW$333       .dwtag  DW_TAG_enumerator
    4307                            .dwattr $C$DW$333, DW_AT_name("CC1350_LAUNCHXL_ADC1")
    4308                            .dwattr $C$DW$333, DW_AT_const_value(0x01)
    4309                            .dwattr $C$DW$333, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4310                            .dwattr $C$DW$333, DW_AT_decl_line(0xcf)
    4311                            .dwattr $C$DW$333, DW_AT_decl_column(0x05)
    4312                    
    4313                    $C$DW$334       .dwtag  DW_TAG_enumerator
    4314                            .dwattr $C$DW$334, DW_AT_name("CC1350_LAUNCHXL_ADC2")
    4315                            .dwattr $C$DW$334, DW_AT_const_value(0x02)
    4316                            .dwattr $C$DW$334, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4317                            .dwattr $C$DW$334, DW_AT_decl_line(0xd0)
    4318                            .dwattr $C$DW$334, DW_AT_decl_column(0x05)
    4319                    
    4320                    $C$DW$335       .dwtag  DW_TAG_enumerator
    4321                            .dwattr $C$DW$335, DW_AT_name("CC1350_LAUNCHXL_ADC3")
    4322                            .dwattr $C$DW$335, DW_AT_const_value(0x03)
    4323                            .dwattr $C$DW$335, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4324                            .dwattr $C$DW$335, DW_AT_decl_line(0xd1)
    4325                            .dwattr $C$DW$335, DW_AT_decl_column(0x05)
    4326                    
    4327                    $C$DW$336       .dwtag  DW_TAG_enumerator
    4328                            .dwattr $C$DW$336, DW_AT_name("CC1350_LAUNCHXL_ADC4")
    4329                            .dwattr $C$DW$336, DW_AT_const_value(0x04)
    4330                            .dwattr $C$DW$336, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4331                            .dwattr $C$DW$336, DW_AT_decl_line(0xd2)
    4332                            .dwattr $C$DW$336, DW_AT_decl_column(0x05)
    4333                    
    4334                    $C$DW$337       .dwtag  DW_TAG_enumerator
    4335                            .dwattr $C$DW$337, DW_AT_name("CC1350_LAUNCHXL_ADC5")
    4336                            .dwattr $C$DW$337, DW_AT_const_value(0x05)
    4337                            .dwattr $C$DW$337, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   80

    4338                            .dwattr $C$DW$337, DW_AT_decl_line(0xd3)
    4339                            .dwattr $C$DW$337, DW_AT_decl_column(0x05)
    4340                    
    4341                    $C$DW$338       .dwtag  DW_TAG_enumerator
    4342                            .dwattr $C$DW$338, DW_AT_name("CC1350_LAUNCHXL_ADC6")
    4343                            .dwattr $C$DW$338, DW_AT_const_value(0x06)
    4344                            .dwattr $C$DW$338, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4345                            .dwattr $C$DW$338, DW_AT_decl_line(0xd4)
    4346                            .dwattr $C$DW$338, DW_AT_decl_column(0x05)
    4347                    
    4348                    $C$DW$339       .dwtag  DW_TAG_enumerator
    4349                            .dwattr $C$DW$339, DW_AT_name("CC1350_LAUNCHXL_ADC7")
    4350                            .dwattr $C$DW$339, DW_AT_const_value(0x07)
    4351                            .dwattr $C$DW$339, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4352                            .dwattr $C$DW$339, DW_AT_decl_line(0xd5)
    4353                            .dwattr $C$DW$339, DW_AT_decl_column(0x05)
    4354                    
    4355                    $C$DW$340       .dwtag  DW_TAG_enumerator
    4356                            .dwattr $C$DW$340, DW_AT_name("CC1350_LAUNCHXL_ADCDCOUPL")
    4357                            .dwattr $C$DW$340, DW_AT_const_value(0x08)
    4358                            .dwattr $C$DW$340, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4359                            .dwattr $C$DW$340, DW_AT_decl_line(0xd6)
    4360                            .dwattr $C$DW$340, DW_AT_decl_column(0x05)
    4361                    
    4362                    $C$DW$341       .dwtag  DW_TAG_enumerator
    4363                            .dwattr $C$DW$341, DW_AT_name("CC1350_LAUNCHXL_ADCVSS")
    4364                            .dwattr $C$DW$341, DW_AT_const_value(0x09)
    4365                            .dwattr $C$DW$341, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4366                            .dwattr $C$DW$341, DW_AT_decl_line(0xd7)
    4367                            .dwattr $C$DW$341, DW_AT_decl_column(0x05)
    4368                    
    4369                    $C$DW$342       .dwtag  DW_TAG_enumerator
    4370                            .dwattr $C$DW$342, DW_AT_name("CC1350_LAUNCHXL_ADCVDDS")
    4371                            .dwattr $C$DW$342, DW_AT_const_value(0x0a)
    4372                            .dwattr $C$DW$342, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4373                            .dwattr $C$DW$342, DW_AT_decl_line(0xd8)
    4374                            .dwattr $C$DW$342, DW_AT_decl_column(0x05)
    4375                    
    4376                    $C$DW$343       .dwtag  DW_TAG_enumerator
    4377                            .dwattr $C$DW$343, DW_AT_name("CC1350_LAUNCHXL_ADCCOUNT")
    4378                            .dwattr $C$DW$343, DW_AT_const_value(0x0b)
    4379                            .dwattr $C$DW$343, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4380                            .dwattr $C$DW$343, DW_AT_decl_line(0xda)
    4381                            .dwattr $C$DW$343, DW_AT_decl_column(0x05)
    4382                    
    4383                            .dwattr $C$DW$T$681, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    4384                            .dwattr $C$DW$T$681, DW_AT_decl_line(0xcd)
    4385                            .dwattr $C$DW$T$681, DW_AT_decl_column(0x0e)
    4386                            .dwendtag $C$DW$T$681
    4387                    
    4388                    $C$DW$T$682     .dwtag  DW_TAG_typedef
    4389                            .dwattr $C$DW$T$682, DW_AT_name("CC1350_LAUNCHXL_ADCName")
    4390                            .dwattr $C$DW$T$682, DW_AT_type(*$C$DW$T$681)
    4391                            .dwattr $C$DW$T$682, DW_AT_language(DW_LANG_C)
    4392                            .dwattr $C$DW$T$682, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{EDB6CCF9-DACC-43B8-95CB-11108A63F946} PAGE   81

    4393                            .dwattr $C$DW$T$682, DW_AT_decl_line(0xdb)
    4394                            .dwattr $C$DW$T$682, DW_AT_decl_column(0x03)
    4395                    
    4396                    
    4397                    $C$DW$T$683     .dwtag  DW_TAG_enumeration_type
    4398                            .dwattr $C$DW$T$683, DW_AT_name("CC1350_LAUNCHXL_CryptoName")
    4399                            .dwattr $C$DW$T$683, DW_AT_byte_size(0x01)
    4400                    $C$DW$344       .dwtag  DW_TAG_enumerator
    4401                            .dwattr $C$DW$344, DW_AT_name("CC1350_LAUNCHXL_CRYPTO0")
    4402                            .dwattr $C$DW$344, DW_AT_const_value(0x00)
    4403                            .dwattr $C$DW$344, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4404                            .dwattr $C$DW$344, DW_AT_decl_line(0xe2)
    4405                            .dwattr $C$DW$344, DW_AT_decl_column(0x05)
    4406                    
    4407                    $C$DW$345       .dwtag  DW_TAG_enumerator
    4408                            .dwattr $C$DW$345, DW_AT_name("CC1350_LAUNCHXL_CRYPTOCOUNT")
    4409                            .dwattr $C$DW$345, DW_AT_const_value(0x01)
    4410                            .dwattr $C$DW$345, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    4411                            .dwattr $C$DW$345, DW_AT_decl_line(0xe4)
    4412                            .dwattr $C$DW$345, DW_AT_decl_column(0x05)
    4413                    
    4414                            .dwattr $C$DW$T$683, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    4415                            .dwattr $C$DW$T$683, DW_AT_decl_line(0xe1)
    4416                            .dwattr $C$DW$T$683, DW_AT_decl_column(0x0e)
    4417                            .dwendtag $C$DW$T$683
    4418                    
    4419                    $C$DW$T$684     .dwtag  DW_TAG_typedef
    4420                            .dwattr $C$DW$T$684, DW_AT_name("CC1350_LAUNCHXL_CryptoName")
    4421                            .dwattr $C$DW$T$684, DW_AT_type(*$C$DW$T$683)
    4422                            .dwattr $C$DW$T$684, DW_AT_language(DW_LANG_C)
    4423                            .dwattr $C$DW$T$684, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    4424                            .dwattr $C$DW$T$684, DW_AT_decl_line(0xe5)
    4425                            .dwattr $C$DW$T$684, DW_AT_decl_column(0x03)
    4426                    
    4427                    
    4428                    $C$DW$T$685     .dwtag  DW_TAG_enumeration_type
    4429                            .dwattr $C$DW$T$685, DW_AT_name("CC1350_LAUNCHXL_GPIOName")
    4430                            .dwattr $C$DW$T$685, DW_AT_byte_size(0x01)
    4431                    $C$DW$346       .dwtag  DW_TAG_enumerator
    4432                            .dwattr $C$DW$346, DW_AT_name("CC1350_LAUNCHXL_GPIO_S1")
    4433                            .dwattr $C$DW$346, DW_AT_const_value(0x00)
