TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Dec 12 17:41:41 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/CoP/NPI/npi_tl.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\The_Wonderer\Google Drive\School\2018_3_Semester_Fa
      13                    $C$DW$1 .dwtag  DW_TAG_variable

    1171                            .dwendtag $C$DW$T$806
    1172                    
    1173                    $C$DW$T$807     .dwtag  DW_TAG_typedef
    1174                            .dwattr $C$DW$T$807, DW_AT_name("PIN_Status")
    1175                            .dwattr $C$DW$T$807, DW_AT_type(*$C$DW$T$806)
    1176                            .dwattr $C$DW$T$807, DW_AT_language(DW_LANG_C)
    1177                            .dwattr $C$DW$T$807, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    1178                            .dwattr $C$DW$T$807, DW_AT_decl_line(0x2d1)
    1179                            .dwattr $C$DW$T$807, DW_AT_decl_column(0x03)
    1180                    
    1181                    
    1182                    $C$DW$T$808     .dwtag  DW_TAG_enumeration_type
    1183                            .dwattr $C$DW$T$808, DW_AT_byte_size(0x01)
    1184                    $C$DW$75        .dwtag  DW_TAG_enumerator
    1185                            .dwattr $C$DW$75, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    1186                            .dwattr $C$DW$75, DW_AT_const_value(0xe0)
    1187                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1188                            .dwattr $C$DW$75, DW_AT_decl_line(0x3de)
    1189                            .dwattr $C$DW$75, DW_AT_decl_column(0x04)
    1190                    
    1191                    $C$DW$76        .dwtag  DW_TAG_enumerator
    1192                            .dwattr $C$DW$76, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    1193                            .dwattr $C$DW$76, DW_AT_const_value(0xe1)
    1194                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1195                            .dwattr $C$DW$76, DW_AT_decl_line(0x3e0)
    1196                            .dwattr $C$DW$76, DW_AT_decl_column(0x04)
    1197                    
    1198                    $C$DW$77        .dwtag  DW_TAG_enumerator
    1199                            .dwattr $C$DW$77, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    1200                            .dwattr $C$DW$77, DW_AT_const_value(0xe2)
    1201                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1202                            .dwattr $C$DW$77, DW_AT_decl_line(0x3e2)
    1203                            .dwattr $C$DW$77, DW_AT_decl_column(0x04)
    1204                    
    1205                    $C$DW$78        .dwtag  DW_TAG_enumerator
    1206                            .dwattr $C$DW$78, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    1207                            .dwattr $C$DW$78, DW_AT_const_value(0xe3)
    1208                            .dwattr $C$DW$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   23

    1209                            .dwattr $C$DW$78, DW_AT_decl_line(0x3e4)
    1210                            .dwattr $C$DW$78, DW_AT_decl_column(0x04)
    1211                    
    1212                    $C$DW$79        .dwtag  DW_TAG_enumerator
    1213                            .dwattr $C$DW$79, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    1214                            .dwattr $C$DW$79, DW_AT_const_value(0xe4)
    1215                            .dwattr $C$DW$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1216                            .dwattr $C$DW$79, DW_AT_decl_line(0x3e6)
    1217                            .dwattr $C$DW$79, DW_AT_decl_column(0x04)
    1218                    
    1219                    $C$DW$80        .dwtag  DW_TAG_enumerator
    1220                            .dwattr $C$DW$80, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    1221                            .dwattr $C$DW$80, DW_AT_const_value(0xe5)
    1222                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1223                            .dwattr $C$DW$80, DW_AT_decl_line(0x3e8)
    1224                            .dwattr $C$DW$80, DW_AT_decl_column(0x04)
    1225                    
    1226                            .dwattr $C$DW$T$808, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1227                            .dwattr $C$DW$T$808, DW_AT_decl_line(0x3dc)
    1228                            .dwattr $C$DW$T$808, DW_AT_decl_column(0x01)
    1229                            .dwendtag $C$DW$T$808
    1230                    
    1231                    $C$DW$T$809     .dwtag  DW_TAG_typedef
    1232                            .dwattr $C$DW$T$809, DW_AT_name("ICall_RemotiCmdEvent_t")
    1233                            .dwattr $C$DW$T$809, DW_AT_type(*$C$DW$T$808)
    1234                            .dwattr $C$DW$T$809, DW_AT_language(DW_LANG_C)
    1235                            .dwattr $C$DW$T$809, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1236                            .dwattr $C$DW$T$809, DW_AT_decl_line(0x3e9)
    1237                            .dwattr $C$DW$T$809, DW_AT_decl_column(0x02)
    1238                    
    1239                    
    1240                    $C$DW$T$141     .dwtag  DW_TAG_structure_type
    1241                            .dwattr $C$DW$T$141, DW_AT_byte_size(0x10)
    1242                    $C$DW$81        .dwtag  DW_TAG_member
    1243                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$14)
    1244                            .dwattr $C$DW$81, DW_AT_name("__max_align1")
    1245                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("__max_align1")
    1246                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1247                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1248                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/sy
    1249                            .dwattr $C$DW$81, DW_AT_decl_line(0x70)
    1250                            .dwattr $C$DW$81, DW_AT_decl_column(0x0c)
    1251                    
    1252                    $C$DW$82        .dwtag  DW_TAG_member
    1253                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$18)
    1254                            .dwattr $C$DW$82, DW_AT_name("__max_align2")
    1255                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("__max_align2")
    1256                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1257                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1258                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/sy
    1259                            .dwattr $C$DW$82, DW_AT_decl_line(0x71)
    1260                            .dwattr $C$DW$82, DW_AT_decl_column(0x0e)
    1261                    
    1262                            .dwattr $C$DW$T$141, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1263                            .dwattr $C$DW$T$141, DW_AT_decl_line(0x6f)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   24

    1264                            .dwattr $C$DW$T$141, DW_AT_decl_column(0x10)
    1265                            .dwendtag $C$DW$T$141
    1266                    
    1267                    $C$DW$T$810     .dwtag  DW_TAG_typedef
    1268                            .dwattr $C$DW$T$810, DW_AT_name("__max_align_t")
    1269                            .dwattr $C$DW$T$810, DW_AT_type(*$C$DW$T$141)
    1270                            .dwattr $C$DW$T$810, DW_AT_language(DW_LANG_C)
    1271                            .dwattr $C$DW$T$810, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1272                            .dwattr $C$DW$T$810, DW_AT_decl_line(0x72)
    1273                            .dwattr $C$DW$T$810, DW_AT_decl_column(0x03)
    1274                    
    1275                    
    1276                    $C$DW$T$145     .dwtag  DW_TAG_structure_type
    1277                            .dwattr $C$DW$T$145, DW_AT_byte_size(0x08)
    1278                    $C$DW$83        .dwtag  DW_TAG_member
    1279                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$10)
    1280                            .dwattr $C$DW$83, DW_AT_name("length")
    1281                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("length")
    1282                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1284                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packag
    1285                            .dwattr $C$DW$83, DW_AT_decl_line(0x36f)
    1286                            .dwattr $C$DW$83, DW_AT_decl_column(0x16)
    1287                    
    1288                    $C$DW$84        .dwtag  DW_TAG_member
    1289                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$144)
    1290                            .dwattr $C$DW$84, DW_AT_name("elem")
    1291                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("elem")
    1292                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1293                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1294                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packag
    1295                            .dwattr $C$DW$84, DW_AT_decl_line(0x36f)
    1296                            .dwattr $C$DW$84, DW_AT_decl_column(0x44)
    1297                    
    1298                            .dwattr $C$DW$T$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1299                            .dwattr $C$DW$T$145, DW_AT_decl_line(0x36f)
    1300                            .dwattr $C$DW$T$145, DW_AT_decl_column(0x10)
    1301                            .dwendtag $C$DW$T$145
    1302                    
    1303                    $C$DW$T$811     .dwtag  DW_TAG_typedef
    1304                            .dwattr $C$DW$T$811, DW_AT_name("ARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
    1305                            .dwattr $C$DW$T$811, DW_AT_type(*$C$DW$T$145)
    1306                            .dwattr $C$DW$T$811, DW_AT_language(DW_LANG_C)
    1307                            .dwattr $C$DW$T$811, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1308                            .dwattr $C$DW$T$811, DW_AT_decl_line(0x36f)
    1309                            .dwattr $C$DW$T$811, DW_AT_decl_column(0x4c)
    1310                    
    1311                    
    1312                    $C$DW$T$148     .dwtag  DW_TAG_structure_type
    1313                            .dwattr $C$DW$T$148, DW_AT_byte_size(0x08)
    1314                    $C$DW$85        .dwtag  DW_TAG_member
    1315                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$10)
    1316                            .dwattr $C$DW$85, DW_AT_name("length")
    1317                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("length")
    1318                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   25

    1319                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1320                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packag
    1321                            .dwattr $C$DW$85, DW_AT_decl_line(0x370)
    1322                            .dwattr $C$DW$85, DW_AT_decl_column(0x16)
    1323                    
    1324                    $C$DW$86        .dwtag  DW_TAG_member
    1325                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$147)
    1326                            .dwattr $C$DW$86, DW_AT_name("elem")
    1327                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("elem")
    1328                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1329                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1330                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packag
    1331                            .dwattr $C$DW$86, DW_AT_decl_line(0x370)
    1332                            .dwattr $C$DW$86, DW_AT_decl_column(0x4a)
    1333                    
    1334                            .dwattr $C$DW$T$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1335                            .dwattr $C$DW$T$148, DW_AT_decl_line(0x370)
    1336                            .dwattr $C$DW$T$148, DW_AT_decl_column(0x10)
    1337                            .dwendtag $C$DW$T$148
    1338                    
    1339                    $C$DW$T$812     .dwtag  DW_TAG_typedef
    1340                            .dwattr $C$DW$T$812, DW_AT_name("CARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
    1341                            .dwattr $C$DW$T$812, DW_AT_type(*$C$DW$T$148)
    1342                            .dwattr $C$DW$T$812, DW_AT_language(DW_LANG_C)
    1343                            .dwattr $C$DW$T$812, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1344                            .dwattr $C$DW$T$812, DW_AT_decl_line(0x370)
    1345                            .dwattr $C$DW$T$812, DW_AT_decl_column(0x52)
    1346                    
    1347                    $C$DW$T$813     .dwtag  DW_TAG_typedef
    1348                            .dwattr $C$DW$T$813, DW_AT_name("CT__ti_sysbios_family_arm_m3_Hwi_hooks")
    1349                            .dwattr $C$DW$T$813, DW_AT_type(*$C$DW$T$812)
    1350                            .dwattr $C$DW$T$813, DW_AT_language(DW_LANG_C)
    1351                            .dwattr $C$DW$T$813, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1352                            .dwattr $C$DW$T$813, DW_AT_decl_line(0x372)
    1353                            .dwattr $C$DW$T$813, DW_AT_decl_column(0x34)
    1354                    
    1355                    $C$DW$T$814     .dwtag  DW_TAG_typedef
    1356                            .dwattr $C$DW$T$814, DW_AT_name("__TA_ti_sysbios_family_arm_m3_Hwi_hooks")
    1357                            .dwattr $C$DW$T$814, DW_AT_type(*$C$DW$T$812)
    1358                            .dwattr $C$DW$T$814, DW_AT_language(DW_LANG_C)
    1359                            .dwattr $C$DW$T$814, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1360                            .dwattr $C$DW$T$814, DW_AT_decl_line(0x371)
    1361                            .dwattr $C$DW$T$814, DW_AT_decl_column(0x34)
    1362                    
    1363                    
    1364                    $C$DW$T$193     .dwtag  DW_TAG_structure_type
    1365                            .dwattr $C$DW$T$193, DW_AT_byte_size(0x4c)
    1366                    $C$DW$87        .dwtag  DW_TAG_member
    1367                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$156)
    1368                            .dwattr $C$DW$87, DW_AT_name("Crc32")
    1369                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("Crc32")
    1370                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1371                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1372                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1373                            .dwattr $C$DW$87, DW_AT_decl_line(0x76)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   26

    1374                            .dwattr $C$DW$87, DW_AT_decl_column(0x25)
    1375                    
    1376                    $C$DW$88        .dwtag  DW_TAG_member
    1377                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$159)
    1378                            .dwattr $C$DW$88, DW_AT_name("FlashGetSize")
    1379                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("FlashGetSize")
    1380                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1381                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1382                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1383                            .dwattr $C$DW$88, DW_AT_decl_line(0x77)
    1384                            .dwattr $C$DW$88, DW_AT_decl_column(0x25)
    1385                    
    1386                    $C$DW$89        .dwtag  DW_TAG_member
    1387                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$160)
    1388                            .dwattr $C$DW$89, DW_AT_name("GetChipId")
    1389                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("GetChipId")
    1390                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1391                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1392                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1393                            .dwattr $C$DW$89, DW_AT_decl_line(0x78)
    1394                            .dwattr $C$DW$89, DW_AT_decl_column(0x25)
    1395                    
    1396                    $C$DW$90        .dwtag  DW_TAG_member
    1397                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$163)
    1398                            .dwattr $C$DW$90, DW_AT_name("ReservedLocation1")
    1399                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("ReservedLocation1")
    1400                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1401                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1402                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1403                            .dwattr $C$DW$90, DW_AT_decl_line(0x79)
    1404                            .dwattr $C$DW$90, DW_AT_decl_column(0x25)
    1405                    
    1406                    $C$DW$91        .dwtag  DW_TAG_member
    1407                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$164)
    1408                            .dwattr $C$DW$91, DW_AT_name("ReservedLocation2")
    1409                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("ReservedLocation2")
    1410                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1411                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1412                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1413                            .dwattr $C$DW$91, DW_AT_decl_line(0x7a)
    1414                            .dwattr $C$DW$91, DW_AT_decl_column(0x25)
    1415                    
    1416                    $C$DW$92        .dwtag  DW_TAG_member
    1417                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$165)
    1418                            .dwattr $C$DW$92, DW_AT_name("ReservedLocation3")
    1419                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("ReservedLocation3")
    1420                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1421                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1422                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1423                            .dwattr $C$DW$92, DW_AT_decl_line(0x7b)
    1424                            .dwattr $C$DW$92, DW_AT_decl_column(0x25)
    1425                    
    1426                    $C$DW$93        .dwtag  DW_TAG_member
    1427                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$168)
    1428                            .dwattr $C$DW$93, DW_AT_name("ResetDevice")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   27

    1429                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("ResetDevice")
    1430                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1431                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1432                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1433                            .dwattr $C$DW$93, DW_AT_decl_line(0x7c)
    1434                            .dwattr $C$DW$93, DW_AT_decl_column(0x25)
    1435                    
    1436                    $C$DW$94        .dwtag  DW_TAG_member
    1437                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$174)
    1438                            .dwattr $C$DW$94, DW_AT_name("Fletcher32")
    1439                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("Fletcher32")
    1440                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1441                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1442                            .dwattr $C$DW$94, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1443                            .dwattr $C$DW$94, DW_AT_decl_line(0x7d)
    1444                            .dwattr $C$DW$94, DW_AT_decl_column(0x25)
    1445                    
    1446                    $C$DW$95        .dwtag  DW_TAG_member
    1447                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$178)
    1448                            .dwattr $C$DW$95, DW_AT_name("MinValue")
    1449                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("MinValue")
    1450                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1451                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1452                            .dwattr $C$DW$95, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1453                            .dwattr $C$DW$95, DW_AT_decl_line(0x7e)
    1454                            .dwattr $C$DW$95, DW_AT_decl_column(0x25)
    1455                    
    1456                    $C$DW$96        .dwtag  DW_TAG_member
    1457                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$179)
    1458                            .dwattr $C$DW$96, DW_AT_name("MaxValue")
    1459                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("MaxValue")
    1460                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1461                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1462                            .dwattr $C$DW$96, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1463                            .dwattr $C$DW$96, DW_AT_decl_line(0x7f)
    1464                            .dwattr $C$DW$96, DW_AT_decl_column(0x25)
    1465                    
    1466                    $C$DW$97        .dwtag  DW_TAG_member
    1467                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$180)
    1468                            .dwattr $C$DW$97, DW_AT_name("MeanValue")
    1469                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("MeanValue")
    1470                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1471                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1472                            .dwattr $C$DW$97, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1473                            .dwattr $C$DW$97, DW_AT_decl_line(0x80)
    1474                            .dwattr $C$DW$97, DW_AT_decl_column(0x25)
    1475                    
    1476                    $C$DW$98        .dwtag  DW_TAG_member
    1477                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$181)
    1478                            .dwattr $C$DW$98, DW_AT_name("StandDeviationValue")
    1479                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("StandDeviationValue")
    1480                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1481                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1482                            .dwattr $C$DW$98, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1483                            .dwattr $C$DW$98, DW_AT_decl_line(0x81)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   28

    1484                            .dwattr $C$DW$98, DW_AT_decl_column(0x25)
    1485                    
    1486                    $C$DW$99        .dwtag  DW_TAG_member
    1487                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$184)
    1488                            .dwattr $C$DW$99, DW_AT_name("ReservedLocation4")
    1489                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("ReservedLocation4")
    1490                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1491                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1492                            .dwattr $C$DW$99, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1493                            .dwattr $C$DW$99, DW_AT_decl_line(0x82)
    1494                            .dwattr $C$DW$99, DW_AT_decl_column(0x25)
    1495                    
    1496                    $C$DW$100       .dwtag  DW_TAG_member
    1497                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$185)
    1498                            .dwattr $C$DW$100, DW_AT_name("ReservedLocation5")
    1499                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("ReservedLocation5")
    1500                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1501                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1502                            .dwattr $C$DW$100, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1503                            .dwattr $C$DW$100, DW_AT_decl_line(0x83)
    1504                            .dwattr $C$DW$100, DW_AT_decl_column(0x25)
    1505                    
    1506                    $C$DW$101       .dwtag  DW_TAG_member
    1507                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$186)
    1508                            .dwattr $C$DW$101, DW_AT_name("HFSourceSafeSwitch")
    1509                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    1510                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1511                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1512                            .dwattr $C$DW$101, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1513                            .dwattr $C$DW$101, DW_AT_decl_line(0x84)
    1514                            .dwattr $C$DW$101, DW_AT_decl_column(0x25)
    1515                    
    1516                    $C$DW$102       .dwtag  DW_TAG_member
    1517                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$189)
    1518                            .dwattr $C$DW$102, DW_AT_name("SelectCompAInput")
    1519                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("SelectCompAInput")
    1520                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1521                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1522                            .dwattr $C$DW$102, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1523                            .dwattr $C$DW$102, DW_AT_decl_line(0x85)
    1524                            .dwattr $C$DW$102, DW_AT_decl_column(0x25)
    1525                    
    1526                    $C$DW$103       .dwtag  DW_TAG_member
    1527                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$190)
    1528                            .dwattr $C$DW$103, DW_AT_name("SelectCompARef")
    1529                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("SelectCompARef")
    1530                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1531                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1532                            .dwattr $C$DW$103, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1533                            .dwattr $C$DW$103, DW_AT_decl_line(0x86)
    1534                            .dwattr $C$DW$103, DW_AT_decl_column(0x25)
    1535                    
    1536                    $C$DW$104       .dwtag  DW_TAG_member
    1537                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$191)
    1538                            .dwattr $C$DW$104, DW_AT_name("SelectADCCompBInput")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   29

    1539                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("SelectADCCompBInput")
    1540                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1541                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1542                            .dwattr $C$DW$104, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1543                            .dwattr $C$DW$104, DW_AT_decl_line(0x87)
    1544                            .dwattr $C$DW$104, DW_AT_decl_column(0x25)
    1545                    
    1546                    $C$DW$105       .dwtag  DW_TAG_member
    1547                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$192)
    1548                            .dwattr $C$DW$105, DW_AT_name("SelectCompBRef")
    1549                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("SelectCompBRef")
    1550                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1551                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1552                            .dwattr $C$DW$105, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    1553                            .dwattr $C$DW$105, DW_AT_decl_line(0x88)
    1554                            .dwattr $C$DW$105, DW_AT_decl_column(0x25)
    1555                    
    1556                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    1557                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x75)
    1558                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x01)
    1559                            .dwendtag $C$DW$T$193
    1560                    
    1561                    $C$DW$T$815     .dwtag  DW_TAG_typedef
    1562                            .dwattr $C$DW$T$815, DW_AT_name("HARD_API_T")
    1563                            .dwattr $C$DW$T$815, DW_AT_type(*$C$DW$T$193)
    1564                            .dwattr $C$DW$T$815, DW_AT_language(DW_LANG_C)
    1565                            .dwattr $C$DW$T$815, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    1566                            .dwattr $C$DW$T$815, DW_AT_decl_line(0x89)
    1567                            .dwattr $C$DW$T$815, DW_AT_decl_column(0x03)
    1568                    
    1569                    
    1570                    $C$DW$T$196     .dwtag  DW_TAG_structure_type
    1571                            .dwattr $C$DW$T$196, DW_AT_byte_size(0x08)
    1572                    $C$DW$106       .dwtag  DW_TAG_member
    1573                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$10)
    1574                            .dwattr $C$DW$106, DW_AT_name("length")
    1575                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("length")
    1576                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1578                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1579                            .dwattr $C$DW$106, DW_AT_decl_line(0x165)
    1580                            .dwattr $C$DW$106, DW_AT_decl_column(0x16)
    1581                    
    1582                    $C$DW$107       .dwtag  DW_TAG_member
    1583                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$195)
    1584                            .dwattr $C$DW$107, DW_AT_name("elem")
    1585                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("elem")
    1586                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1587                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1588                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1589                            .dwattr $C$DW$107, DW_AT_decl_line(0x165)
    1590                            .dwattr $C$DW$107, DW_AT_decl_column(0x3a)
    1591                    
    1592                            .dwattr $C$DW$T$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1593                            .dwattr $C$DW$T$196, DW_AT_decl_line(0x165)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   30

    1594                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x10)
    1595                            .dwendtag $C$DW$T$196
    1596                    
    1597                    $C$DW$T$816     .dwtag  DW_TAG_typedef
    1598                            .dwattr $C$DW$T$816, DW_AT_name("ARRAY1_ti_sysbios_knl_Swi_hooks")
    1599                            .dwattr $C$DW$T$816, DW_AT_type(*$C$DW$T$196)
    1600                            .dwattr $C$DW$T$816, DW_AT_language(DW_LANG_C)
    1601                            .dwattr $C$DW$T$816, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1602                            .dwattr $C$DW$T$816, DW_AT_decl_line(0x165)
    1603                            .dwattr $C$DW$T$816, DW_AT_decl_column(0x42)
    1604                    
    1605                    
    1606                    $C$DW$T$199     .dwtag  DW_TAG_structure_type
    1607                            .dwattr $C$DW$T$199, DW_AT_byte_size(0x08)
    1608                    $C$DW$108       .dwtag  DW_TAG_member
    1609                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$10)
    1610                            .dwattr $C$DW$108, DW_AT_name("length")
    1611                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("length")
    1612                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1613                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1614                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1615                            .dwattr $C$DW$108, DW_AT_decl_line(0x166)
    1616                            .dwattr $C$DW$108, DW_AT_decl_column(0x16)
    1617                    
    1618                    $C$DW$109       .dwtag  DW_TAG_member
    1619                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$198)
    1620                            .dwattr $C$DW$109, DW_AT_name("elem")
    1621                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("elem")
    1622                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1623                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1624                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1625                            .dwattr $C$DW$109, DW_AT_decl_line(0x166)
    1626                            .dwattr $C$DW$109, DW_AT_decl_column(0x40)
    1627                    
    1628                            .dwattr $C$DW$T$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1629                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x166)
    1630                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x10)
    1631                            .dwendtag $C$DW$T$199
    1632                    
    1633                    $C$DW$T$817     .dwtag  DW_TAG_typedef
    1634                            .dwattr $C$DW$T$817, DW_AT_name("CARRAY1_ti_sysbios_knl_Swi_hooks")
    1635                            .dwattr $C$DW$T$817, DW_AT_type(*$C$DW$T$199)
    1636                            .dwattr $C$DW$T$817, DW_AT_language(DW_LANG_C)
    1637                            .dwattr $C$DW$T$817, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1638                            .dwattr $C$DW$T$817, DW_AT_decl_line(0x166)
    1639                            .dwattr $C$DW$T$817, DW_AT_decl_column(0x48)
    1640                    
    1641                    $C$DW$T$818     .dwtag  DW_TAG_typedef
    1642                            .dwattr $C$DW$T$818, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    1643                            .dwattr $C$DW$T$818, DW_AT_type(*$C$DW$T$817)
    1644                            .dwattr $C$DW$T$818, DW_AT_language(DW_LANG_C)
    1645                            .dwattr $C$DW$T$818, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1646                            .dwattr $C$DW$T$818, DW_AT_decl_line(0x168)
    1647                            .dwattr $C$DW$T$818, DW_AT_decl_column(0x2a)
    1648                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   31

    1649                    $C$DW$T$819     .dwtag  DW_TAG_typedef
    1650                            .dwattr $C$DW$T$819, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    1651                            .dwattr $C$DW$T$819, DW_AT_type(*$C$DW$T$817)
    1652                            .dwattr $C$DW$T$819, DW_AT_language(DW_LANG_C)
    1653                            .dwattr $C$DW$T$819, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1654                            .dwattr $C$DW$T$819, DW_AT_decl_line(0x167)
    1655                            .dwattr $C$DW$T$819, DW_AT_decl_column(0x2a)
    1656                    
    1657                    
    1658                    $C$DW$T$202     .dwtag  DW_TAG_structure_type
    1659                            .dwattr $C$DW$T$202, DW_AT_byte_size(0x08)
    1660                    $C$DW$110       .dwtag  DW_TAG_member
    1661                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$10)
    1662                            .dwattr $C$DW$110, DW_AT_name("length")
    1663                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("length")
    1664                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1665                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1666                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1667                            .dwattr $C$DW$110, DW_AT_decl_line(0x29b)
    1668                            .dwattr $C$DW$110, DW_AT_decl_column(0x16)
    1669                    
    1670                    $C$DW$111       .dwtag  DW_TAG_member
    1671                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$201)
    1672                            .dwattr $C$DW$111, DW_AT_name("elem")
    1673                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("elem")
    1674                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1675                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1676                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1677                            .dwattr $C$DW$111, DW_AT_decl_line(0x29b)
    1678                            .dwattr $C$DW$111, DW_AT_decl_column(0x3b)
    1679                    
    1680                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1681                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x29b)
    1682                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x10)
    1683                            .dwendtag $C$DW$T$202
    1684                    
    1685                    $C$DW$T$820     .dwtag  DW_TAG_typedef
    1686                            .dwattr $C$DW$T$820, DW_AT_name("ARRAY1_ti_sysbios_knl_Task_hooks")
    1687                            .dwattr $C$DW$T$820, DW_AT_type(*$C$DW$T$202)
    1688                            .dwattr $C$DW$T$820, DW_AT_language(DW_LANG_C)
    1689                            .dwattr $C$DW$T$820, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1690                            .dwattr $C$DW$T$820, DW_AT_decl_line(0x29b)
    1691                            .dwattr $C$DW$T$820, DW_AT_decl_column(0x43)
    1692                    
    1693                    
    1694                    $C$DW$T$205     .dwtag  DW_TAG_structure_type
    1695                            .dwattr $C$DW$T$205, DW_AT_byte_size(0x08)
    1696                    $C$DW$112       .dwtag  DW_TAG_member
    1697                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$10)
    1698                            .dwattr $C$DW$112, DW_AT_name("length")
    1699                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("length")
    1700                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1701                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1702                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1703                            .dwattr $C$DW$112, DW_AT_decl_line(0x29c)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   32

    1704                            .dwattr $C$DW$112, DW_AT_decl_column(0x16)
    1705                    
    1706                    $C$DW$113       .dwtag  DW_TAG_member
    1707                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$204)
    1708                            .dwattr $C$DW$113, DW_AT_name("elem")
    1709                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("elem")
    1710                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1711                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1712                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    1713                            .dwattr $C$DW$113, DW_AT_decl_line(0x29c)
    1714                            .dwattr $C$DW$113, DW_AT_decl_column(0x41)
    1715                    
    1716                            .dwattr $C$DW$T$205, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1717                            .dwattr $C$DW$T$205, DW_AT_decl_line(0x29c)
    1718                            .dwattr $C$DW$T$205, DW_AT_decl_column(0x10)
    1719                            .dwendtag $C$DW$T$205
    1720                    
    1721                    $C$DW$T$821     .dwtag  DW_TAG_typedef
    1722                            .dwattr $C$DW$T$821, DW_AT_name("CARRAY1_ti_sysbios_knl_Task_hooks")
    1723                            .dwattr $C$DW$T$821, DW_AT_type(*$C$DW$T$205)
    1724                            .dwattr $C$DW$T$821, DW_AT_language(DW_LANG_C)
    1725                            .dwattr $C$DW$T$821, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1726                            .dwattr $C$DW$T$821, DW_AT_decl_line(0x29c)
    1727                            .dwattr $C$DW$T$821, DW_AT_decl_column(0x49)
    1728                    
    1729                    $C$DW$T$822     .dwtag  DW_TAG_typedef
    1730                            .dwattr $C$DW$T$822, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
    1731                            .dwattr $C$DW$T$822, DW_AT_type(*$C$DW$T$821)
    1732                            .dwattr $C$DW$T$822, DW_AT_language(DW_LANG_C)
    1733                            .dwattr $C$DW$T$822, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1734                            .dwattr $C$DW$T$822, DW_AT_decl_line(0x29e)
    1735                            .dwattr $C$DW$T$822, DW_AT_decl_column(0x2b)
    1736                    
    1737                    $C$DW$T$823     .dwtag  DW_TAG_typedef
    1738                            .dwattr $C$DW$T$823, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
    1739                            .dwattr $C$DW$T$823, DW_AT_type(*$C$DW$T$821)
    1740                            .dwattr $C$DW$T$823, DW_AT_language(DW_LANG_C)
    1741                            .dwattr $C$DW$T$823, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    1742                            .dwattr $C$DW$T$823, DW_AT_decl_line(0x29d)
    1743                            .dwattr $C$DW$T$823, DW_AT_decl_column(0x2b)
    1744                    
    1745                    
    1746                    $C$DW$T$206     .dwtag  DW_TAG_structure_type
    1747                            .dwattr $C$DW$T$206, DW_AT_byte_size(0x08)
    1748                    $C$DW$114       .dwtag  DW_TAG_member
    1749                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$10)
    1750                            .dwattr $C$DW$114, DW_AT_name("quot")
    1751                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("quot")
    1752                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1753                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1754                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1755                            .dwattr $C$DW$114, DW_AT_decl_line(0x49)
    1756                            .dwattr $C$DW$114, DW_AT_decl_column(0x16)
    1757                    
    1758                    $C$DW$115       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   33

    1759                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$10)
    1760                            .dwattr $C$DW$115, DW_AT_name("rem")
    1761                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("rem")
    1762                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1763                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1764                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1765                            .dwattr $C$DW$115, DW_AT_decl_line(0x49)
    1766                            .dwattr $C$DW$115, DW_AT_decl_column(0x1c)
    1767                    
    1768                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1769                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x49)
    1770                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x10)
    1771                            .dwendtag $C$DW$T$206
    1772                    
    1773                    $C$DW$T$824     .dwtag  DW_TAG_typedef
    1774                            .dwattr $C$DW$T$824, DW_AT_name("div_t")
    1775                            .dwattr $C$DW$T$824, DW_AT_type(*$C$DW$T$206)
    1776                            .dwattr $C$DW$T$824, DW_AT_language(DW_LANG_C)
    1777                            .dwattr $C$DW$T$824, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1778                            .dwattr $C$DW$T$824, DW_AT_decl_line(0x49)
    1779                            .dwattr $C$DW$T$824, DW_AT_decl_column(0x23)
    1780                    
    1781                    
    1782                    $C$DW$T$207     .dwtag  DW_TAG_structure_type
    1783                            .dwattr $C$DW$T$207, DW_AT_byte_size(0x08)
    1784                    $C$DW$116       .dwtag  DW_TAG_member
    1785                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$10)
    1786                            .dwattr $C$DW$116, DW_AT_name("quot")
    1787                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("quot")
    1788                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1789                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1790                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1791                            .dwattr $C$DW$116, DW_AT_decl_line(0x4e)
    1792                            .dwattr $C$DW$116, DW_AT_decl_column(0x16)
    1793                    
    1794                    $C$DW$117       .dwtag  DW_TAG_member
    1795                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$10)
    1796                            .dwattr $C$DW$117, DW_AT_name("rem")
    1797                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("rem")
    1798                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1799                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1800                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1801                            .dwattr $C$DW$117, DW_AT_decl_line(0x4e)
    1802                            .dwattr $C$DW$117, DW_AT_decl_column(0x1c)
    1803                    
    1804                            .dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1805                            .dwattr $C$DW$T$207, DW_AT_decl_line(0x4e)
    1806                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x10)
    1807                            .dwendtag $C$DW$T$207
    1808                    
    1809                    $C$DW$T$825     .dwtag  DW_TAG_typedef
    1810                            .dwattr $C$DW$T$825, DW_AT_name("ldiv_t")
    1811                            .dwattr $C$DW$T$825, DW_AT_type(*$C$DW$T$207)
    1812                            .dwattr $C$DW$T$825, DW_AT_language(DW_LANG_C)
    1813                            .dwattr $C$DW$T$825, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   34

    1814                            .dwattr $C$DW$T$825, DW_AT_decl_line(0x4e)
    1815                            .dwattr $C$DW$T$825, DW_AT_decl_column(0x23)
    1816                    
    1817                    
    1818                    $C$DW$T$208     .dwtag  DW_TAG_structure_type
    1819                            .dwattr $C$DW$T$208, DW_AT_byte_size(0x10)
    1820                    $C$DW$118       .dwtag  DW_TAG_member
    1821                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$14)
    1822                            .dwattr $C$DW$118, DW_AT_name("quot")
    1823                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("quot")
    1824                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1825                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1826                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1827                            .dwattr $C$DW$118, DW_AT_decl_line(0x56)
    1828                            .dwattr $C$DW$118, DW_AT_decl_column(0x1c)
    1829                    
    1830                    $C$DW$119       .dwtag  DW_TAG_member
    1831                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$14)
    1832                            .dwattr $C$DW$119, DW_AT_name("rem")
    1833                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("rem")
    1834                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1835                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1836                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1837                            .dwattr $C$DW$119, DW_AT_decl_line(0x56)
    1838                            .dwattr $C$DW$119, DW_AT_decl_column(0x22)
    1839                    
    1840                            .dwattr $C$DW$T$208, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1841                            .dwattr $C$DW$T$208, DW_AT_decl_line(0x56)
    1842                            .dwattr $C$DW$T$208, DW_AT_decl_column(0x10)
    1843                            .dwendtag $C$DW$T$208
    1844                    
    1845                    $C$DW$T$826     .dwtag  DW_TAG_typedef
    1846                            .dwattr $C$DW$T$826, DW_AT_name("lldiv_t")
    1847                            .dwattr $C$DW$T$826, DW_AT_type(*$C$DW$T$208)
    1848                            .dwattr $C$DW$T$826, DW_AT_language(DW_LANG_C)
    1849                            .dwattr $C$DW$T$826, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1850                            .dwattr $C$DW$T$826, DW_AT_decl_line(0x56)
    1851                            .dwattr $C$DW$T$826, DW_AT_decl_column(0x29)
    1852                    
    1853                    
    1854                    $C$DW$T$213     .dwtag  DW_TAG_structure_type
    1855                            .dwattr $C$DW$T$213, DW_AT_byte_size(0x08)
    1856                    $C$DW$120       .dwtag  DW_TAG_member
    1857                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$211)
    1858                            .dwattr $C$DW$120, DW_AT_name("pointerStack")
    1859                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("pointerStack")
    1860                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1861                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1862                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1863                            .dwattr $C$DW$120, DW_AT_decl_line(0x3f5)
    1864                            .dwattr $C$DW$120, DW_AT_decl_column(0x16)
    1865                    
    1866                    $C$DW$121       .dwtag  DW_TAG_member
    1867                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$212)
    1868                            .dwattr $C$DW$121, DW_AT_name("directAPI")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   35

    1869                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("directAPI")
    1870                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1871                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1872                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1873                            .dwattr $C$DW$121, DW_AT_decl_line(0x3f6)
    1874                            .dwattr $C$DW$121, DW_AT_decl_column(0x15)
    1875                    
    1876                            .dwattr $C$DW$T$213, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1877                            .dwattr $C$DW$T$213, DW_AT_decl_line(0x3f4)
    1878                            .dwattr $C$DW$T$213, DW_AT_decl_column(0x01)
    1879                            .dwendtag $C$DW$T$213
    1880                    
    1881                    $C$DW$T$215     .dwtag  DW_TAG_typedef
    1882                            .dwattr $C$DW$T$215, DW_AT_name("icall_directAPIMsg_t")
    1883                            .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$213)
    1884                            .dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
    1885                            .dwattr $C$DW$T$215, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1886                            .dwattr $C$DW$T$215, DW_AT_decl_line(0x3f7)
    1887                            .dwattr $C$DW$T$215, DW_AT_decl_column(0x03)
    1888                    
    1889                    
    1890                    $C$DW$T$216     .dwtag  DW_TAG_structure_type
    1891                            .dwattr $C$DW$T$216, DW_AT_byte_size(0x14)
    1892                    $C$DW$122       .dwtag  DW_TAG_member
    1893                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$214)
    1894                            .dwattr $C$DW$122, DW_AT_name("hdr")
    1895                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("hdr")
    1896                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1897                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1898                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1899                            .dwattr $C$DW$122, DW_AT_decl_line(0x3fb)
    1900                            .dwattr $C$DW$122, DW_AT_decl_column(0x10)
    1901                    
    1902                    $C$DW$123       .dwtag  DW_TAG_member
    1903                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$215)
    1904                            .dwattr $C$DW$123, DW_AT_name("msg")
    1905                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("msg")
    1906                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1907                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1908                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1909                            .dwattr $C$DW$123, DW_AT_decl_line(0x3fc)
    1910                            .dwattr $C$DW$123, DW_AT_decl_column(0x1a)
    1911                    
    1912                            .dwattr $C$DW$T$216, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1913                            .dwattr $C$DW$T$216, DW_AT_decl_line(0x3fa)
    1914                            .dwattr $C$DW$T$216, DW_AT_decl_column(0x01)
    1915                            .dwendtag $C$DW$T$216
    1916                    
    1917                    $C$DW$T$827     .dwtag  DW_TAG_typedef
    1918                            .dwattr $C$DW$T$827, DW_AT_name("icallLiteMsg_t")
    1919                            .dwattr $C$DW$T$827, DW_AT_type(*$C$DW$T$216)
    1920                            .dwattr $C$DW$T$827, DW_AT_language(DW_LANG_C)
    1921                            .dwattr $C$DW$T$827, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1922                            .dwattr $C$DW$T$827, DW_AT_decl_line(0x3fd)
    1923                            .dwattr $C$DW$T$827, DW_AT_decl_column(0x03)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   36

    1924                    
    1925                    
    1926                    $C$DW$T$222     .dwtag  DW_TAG_union_type
    1927                            .dwattr $C$DW$T$222, DW_AT_byte_size(0x04)
    1928                    $C$DW$124       .dwtag  DW_TAG_member
    1929                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$217)
    1930                            .dwattr $C$DW$124, DW_AT_name("f")
    1931                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("f")
    1932                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1933                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1934                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    1935                            .dwattr $C$DW$124, DW_AT_decl_line(0xb7)
    1936                            .dwattr $C$DW$124, DW_AT_decl_column(0x0f)
    1937                    
    1938                    $C$DW$125       .dwtag  DW_TAG_member
    1939                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$221)
    1940                            .dwattr $C$DW$125, DW_AT_name("a")
    1941                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("a")
    1942                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1943                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1944                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    1945                            .dwattr $C$DW$125, DW_AT_decl_line(0xb8)
    1946                            .dwattr $C$DW$125, DW_AT_decl_column(0x0f)
    1947                    
    1948                            .dwattr $C$DW$T$222, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    1949                            .dwattr $C$DW$T$222, DW_AT_decl_line(0xb6)
    1950                            .dwattr $C$DW$T$222, DW_AT_decl_column(0x0f)
    1951                            .dwendtag $C$DW$T$222
    1952                    
    1953                    $C$DW$T$828     .dwtag  DW_TAG_typedef
    1954                            .dwattr $C$DW$T$828, DW_AT_name("xdc_FloatData")
    1955                            .dwattr $C$DW$T$828, DW_AT_type(*$C$DW$T$222)
    1956                            .dwattr $C$DW$T$828, DW_AT_language(DW_LANG_C)
    1957                            .dwattr $C$DW$T$828, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    1958                            .dwattr $C$DW$T$828, DW_AT_decl_line(0xb9)
    1959                            .dwattr $C$DW$T$828, DW_AT_decl_column(0x03)
    1960                    
    1961                    
    1962                    $C$DW$T$229     .dwtag  DW_TAG_union_type
    1963                            .dwattr $C$DW$T$229, DW_AT_byte_size(0x02)
    1964                    $C$DW$126       .dwtag  DW_TAG_member
    1965                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$225)
    1966                            .dwattr $C$DW$126, DW_AT_name("entityId")
    1967                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("entityId")
    1968                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1969                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1970                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1971                            .dwattr $C$DW$126, DW_AT_decl_line(0x1fe)
    1972                            .dwattr $C$DW$126, DW_AT_decl_column(0x14)
    1973                    
    1974                    $C$DW$127       .dwtag  DW_TAG_member
    1975                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$228)
    1976                            .dwattr $C$DW$127, DW_AT_name("servId")
    1977                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("servId")
    1978                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   37

    1979                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1980                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1981                            .dwattr $C$DW$127, DW_AT_decl_line(0x200)
    1982                            .dwattr $C$DW$127, DW_AT_decl_column(0x17)
    1983                    
    1984                            .dwattr $C$DW$T$229, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1985                            .dwattr $C$DW$T$229, DW_AT_decl_line(0x1fc)
    1986                            .dwattr $C$DW$T$229, DW_AT_decl_column(0x03)
    1987                            .dwendtag $C$DW$T$229
    1988                    
    1989                    
    1990                    $C$DW$T$230     .dwtag  DW_TAG_union_type
    1991                            .dwattr $C$DW$T$230, DW_AT_byte_size(0x02)
    1992                    $C$DW$128       .dwtag  DW_TAG_member
    1993                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$228)
    1994                            .dwattr $C$DW$128, DW_AT_name("servId")
    1995                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("servId")
    1996                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1997                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1998                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1999                            .dwattr $C$DW$128, DW_AT_decl_line(0x211)
    2000                            .dwattr $C$DW$128, DW_AT_decl_column(0x17)
    2001                    
    2002                    $C$DW$129       .dwtag  DW_TAG_member
    2003                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$225)
    2004                            .dwattr $C$DW$129, DW_AT_name("entityId")
    2005                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("entityId")
    2006                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2007                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2008                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2009                            .dwattr $C$DW$129, DW_AT_decl_line(0x213)
    2010                            .dwattr $C$DW$129, DW_AT_decl_column(0x14)
    2011                    
    2012                            .dwattr $C$DW$T$230, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2013                            .dwattr $C$DW$T$230, DW_AT_decl_line(0x20f)
    2014                            .dwattr $C$DW$T$230, DW_AT_decl_column(0x03)
    2015                            .dwendtag $C$DW$T$230
    2016                    
    2017                    
    2018                    $C$DW$T$235     .dwtag  DW_TAG_structure_type
    2019                            .dwattr $C$DW$T$235, DW_AT_name(".ggroup1")
    2020                            .dwattr $C$DW$T$235, DW_AT_byte_size(0x234)
    2021                    $C$DW$130       .dwtag  DW_TAG_member
    2022                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$9)
    2023                            .dwattr $C$DW$130, DW_AT_name("npiRxBufTail")
    2024                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("npiRxBufTail")
    2025                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2026                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2027                    
    2028                    $C$DW$131       .dwtag  DW_TAG_member
    2029                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$9)
    2030                            .dwattr $C$DW$131, DW_AT_name("npiRxBufHead")
    2031                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("npiRxBufHead")
    2032                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2033                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   38

    2034                    
    2035                    $C$DW$132       .dwtag  DW_TAG_member
    2036                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$9)
    2037                            .dwattr $C$DW$132, DW_AT_name("npiTxBufLen")
    2038                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("npiTxBufLen")
    2039                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2040                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2041                    
    2042                    $C$DW$133       .dwtag  DW_TAG_member
    2043                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$9)
    2044                            .dwattr $C$DW$133, DW_AT_name("msgFragLen")
    2045                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("msgFragLen")
    2046                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2047                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2048                    
    2049                    $C$DW$134       .dwtag  DW_TAG_member
    2050                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2051                            .dwattr $C$DW$134, DW_AT_name("txPktCount")
    2052                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("txPktCount")
    2053                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2054                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2055                    
    2056                    $C$DW$135       .dwtag  DW_TAG_member
    2057                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$232)
    2058                            .dwattr $C$DW$135, DW_AT_name("taskTxCB")
    2059                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("taskTxCB")
    2060                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2061                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2062                    
    2063                    $C$DW$136       .dwtag  DW_TAG_member
    2064                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$232)
    2065                            .dwattr $C$DW$136, DW_AT_name("taskRxCB")
    2066                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("taskRxCB")
    2067                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2068                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2069                    
    2070                    $C$DW$137       .dwtag  DW_TAG_member
    2071                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$233)
    2072                            .dwattr $C$DW$137, DW_AT_name("msgFrag")
    2073                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("msgFrag")
    2074                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2075                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2076                    
    2077                    $C$DW$138       .dwtag  DW_TAG_member
    2078                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$234)
    2079                            .dwattr $C$DW$138, DW_AT_name("npiRxBuf")
    2080                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("npiRxBuf")
    2081                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2082                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2083                    
    2084                    $C$DW$139       .dwtag  DW_TAG_member
    2085                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$234)
    2086                            .dwattr $C$DW$139, DW_AT_name("npiTxBuf")
    2087                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("npiTxBuf")
    2088                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x126]
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   39

    2089                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2090                    
    2091                            .dwendtag $C$DW$T$235
    2092                    
    2093                    
    2094                    $C$DW$T$830     .dwtag  DW_TAG_enumeration_type
    2095                            .dwattr $C$DW$T$830, DW_AT_name("CC1350_LAUNCHXL_ADCBuf0ChannelName")
    2096                            .dwattr $C$DW$T$830, DW_AT_byte_size(0x01)
    2097                    $C$DW$140       .dwtag  DW_TAG_enumerator
    2098                            .dwattr $C$DW$140, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL0")
    2099                            .dwattr $C$DW$140, DW_AT_const_value(0x00)
    2100                            .dwattr $C$DW$140, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2101                            .dwattr $C$DW$140, DW_AT_decl_line(0xba)
    2102                            .dwattr $C$DW$140, DW_AT_decl_column(0x05)
    2103                    
    2104                    $C$DW$141       .dwtag  DW_TAG_enumerator
    2105                            .dwattr $C$DW$141, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL1")
    2106                            .dwattr $C$DW$141, DW_AT_const_value(0x01)
    2107                            .dwattr $C$DW$141, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2108                            .dwattr $C$DW$141, DW_AT_decl_line(0xbb)
    2109                            .dwattr $C$DW$141, DW_AT_decl_column(0x05)
    2110                    
    2111                    $C$DW$142       .dwtag  DW_TAG_enumerator
    2112                            .dwattr $C$DW$142, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL2")
    2113                            .dwattr $C$DW$142, DW_AT_const_value(0x02)
    2114                            .dwattr $C$DW$142, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2115                            .dwattr $C$DW$142, DW_AT_decl_line(0xbc)
    2116                            .dwattr $C$DW$142, DW_AT_decl_column(0x05)
    2117                    
    2118                    $C$DW$143       .dwtag  DW_TAG_enumerator
    2119                            .dwattr $C$DW$143, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL3")
    2120                            .dwattr $C$DW$143, DW_AT_const_value(0x03)
    2121                            .dwattr $C$DW$143, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2122                            .dwattr $C$DW$143, DW_AT_decl_line(0xbd)
    2123                            .dwattr $C$DW$143, DW_AT_decl_column(0x05)
    2124                    
    2125                    $C$DW$144       .dwtag  DW_TAG_enumerator
    2126                            .dwattr $C$DW$144, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL4")
    2127                            .dwattr $C$DW$144, DW_AT_const_value(0x04)
    2128                            .dwattr $C$DW$144, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2129                            .dwattr $C$DW$144, DW_AT_decl_line(0xbe)
    2130                            .dwattr $C$DW$144, DW_AT_decl_column(0x05)
    2131                    
    2132                    $C$DW$145       .dwtag  DW_TAG_enumerator
    2133                            .dwattr $C$DW$145, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL5")
    2134                            .dwattr $C$DW$145, DW_AT_const_value(0x05)
    2135                            .dwattr $C$DW$145, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2136                            .dwattr $C$DW$145, DW_AT_decl_line(0xbf)
    2137                            .dwattr $C$DW$145, DW_AT_decl_column(0x05)
    2138                    
    2139                    $C$DW$146       .dwtag  DW_TAG_enumerator
    2140                            .dwattr $C$DW$146, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL6")
    2141                            .dwattr $C$DW$146, DW_AT_const_value(0x06)
    2142                            .dwattr $C$DW$146, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2143                            .dwattr $C$DW$146, DW_AT_decl_line(0xc0)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   40

    2144                            .dwattr $C$DW$146, DW_AT_decl_column(0x05)
    2145                    
    2146                    $C$DW$147       .dwtag  DW_TAG_enumerator
    2147                            .dwattr $C$DW$147, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL7")
    2148                            .dwattr $C$DW$147, DW_AT_const_value(0x07)
    2149                            .dwattr $C$DW$147, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2150                            .dwattr $C$DW$147, DW_AT_decl_line(0xc1)
    2151                            .dwattr $C$DW$147, DW_AT_decl_column(0x05)
    2152                    
    2153                    $C$DW$148       .dwtag  DW_TAG_enumerator
    2154                            .dwattr $C$DW$148, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELVDDS")
    2155                            .dwattr $C$DW$148, DW_AT_const_value(0x08)
    2156                            .dwattr $C$DW$148, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2157                            .dwattr $C$DW$148, DW_AT_decl_line(0xc2)
    2158                            .dwattr $C$DW$148, DW_AT_decl_column(0x05)
    2159                    
    2160                    $C$DW$149       .dwtag  DW_TAG_enumerator
    2161                            .dwattr $C$DW$149, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELDCOUPL")
    2162                            .dwattr $C$DW$149, DW_AT_const_value(0x09)
    2163                            .dwattr $C$DW$149, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2164                            .dwattr $C$DW$149, DW_AT_decl_line(0xc3)
    2165                            .dwattr $C$DW$149, DW_AT_decl_column(0x05)
    2166                    
    2167                    $C$DW$150       .dwtag  DW_TAG_enumerator
    2168                            .dwattr $C$DW$150, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELVSS")
    2169                            .dwattr $C$DW$150, DW_AT_const_value(0x0a)
    2170                            .dwattr $C$DW$150, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2171                            .dwattr $C$DW$150, DW_AT_decl_line(0xc4)
    2172                            .dwattr $C$DW$150, DW_AT_decl_column(0x05)
    2173                    
    2174                    $C$DW$151       .dwtag  DW_TAG_enumerator
    2175                            .dwattr $C$DW$151, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELCOUNT")
    2176                            .dwattr $C$DW$151, DW_AT_const_value(0x0b)
    2177                            .dwattr $C$DW$151, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2178                            .dwattr $C$DW$151, DW_AT_decl_line(0xc6)
    2179                            .dwattr $C$DW$151, DW_AT_decl_column(0x05)
    2180                    
    2181                            .dwattr $C$DW$T$830, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2182                            .dwattr $C$DW$T$830, DW_AT_decl_line(0xb9)
    2183                            .dwattr $C$DW$T$830, DW_AT_decl_column(0x0e)
    2184                            .dwendtag $C$DW$T$830
    2185                    
    2186                    $C$DW$T$831     .dwtag  DW_TAG_typedef
    2187                            .dwattr $C$DW$T$831, DW_AT_name("CC1350_LAUNCHXL_ADCBuf0ChannelName")
    2188                            .dwattr $C$DW$T$831, DW_AT_type(*$C$DW$T$830)
    2189                            .dwattr $C$DW$T$831, DW_AT_language(DW_LANG_C)
    2190                            .dwattr $C$DW$T$831, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2191                            .dwattr $C$DW$T$831, DW_AT_decl_line(0xc7)
    2192                            .dwattr $C$DW$T$831, DW_AT_decl_column(0x03)
    2193                    
    2194                    
    2195                    $C$DW$T$832     .dwtag  DW_TAG_enumeration_type
    2196                            .dwattr $C$DW$T$832, DW_AT_name("CC1350_LAUNCHXL_ADCBufName")
    2197                            .dwattr $C$DW$T$832, DW_AT_byte_size(0x01)
    2198                    $C$DW$152       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   41

    2199                            .dwattr $C$DW$152, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0")
    2200                            .dwattr $C$DW$152, DW_AT_const_value(0x00)
    2201                            .dwattr $C$DW$152, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2202                            .dwattr $C$DW$152, DW_AT_decl_line(0xb0)
    2203                            .dwattr $C$DW$152, DW_AT_decl_column(0x05)
    2204                    
    2205                    $C$DW$153       .dwtag  DW_TAG_enumerator
    2206                            .dwattr $C$DW$153, DW_AT_name("CC1350_LAUNCHXL_ADCBUFCOUNT")
    2207                            .dwattr $C$DW$153, DW_AT_const_value(0x01)
    2208                            .dwattr $C$DW$153, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2209                            .dwattr $C$DW$153, DW_AT_decl_line(0xb2)
    2210                            .dwattr $C$DW$153, DW_AT_decl_column(0x05)
    2211                    
    2212                            .dwattr $C$DW$T$832, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2213                            .dwattr $C$DW$T$832, DW_AT_decl_line(0xaf)
    2214                            .dwattr $C$DW$T$832, DW_AT_decl_column(0x0e)
    2215                            .dwendtag $C$DW$T$832
    2216                    
    2217                    $C$DW$T$833     .dwtag  DW_TAG_typedef
    2218                            .dwattr $C$DW$T$833, DW_AT_name("CC1350_LAUNCHXL_ADCBufName")
    2219                            .dwattr $C$DW$T$833, DW_AT_type(*$C$DW$T$832)
    2220                            .dwattr $C$DW$T$833, DW_AT_language(DW_LANG_C)
    2221                            .dwattr $C$DW$T$833, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2222                            .dwattr $C$DW$T$833, DW_AT_decl_line(0xb3)
    2223                            .dwattr $C$DW$T$833, DW_AT_decl_column(0x03)
    2224                    
    2225                    
    2226                    $C$DW$T$834     .dwtag  DW_TAG_enumeration_type
    2227                            .dwattr $C$DW$T$834, DW_AT_name("CC1350_LAUNCHXL_ADCName")
    2228                            .dwattr $C$DW$T$834, DW_AT_byte_size(0x01)
    2229                    $C$DW$154       .dwtag  DW_TAG_enumerator
    2230                            .dwattr $C$DW$154, DW_AT_name("CC1350_LAUNCHXL_ADC0")
    2231                            .dwattr $C$DW$154, DW_AT_const_value(0x00)
    2232                            .dwattr $C$DW$154, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2233                            .dwattr $C$DW$154, DW_AT_decl_line(0xce)
    2234                            .dwattr $C$DW$154, DW_AT_decl_column(0x05)
    2235                    
    2236                    $C$DW$155       .dwtag  DW_TAG_enumerator
    2237                            .dwattr $C$DW$155, DW_AT_name("CC1350_LAUNCHXL_ADC1")
    2238                            .dwattr $C$DW$155, DW_AT_const_value(0x01)
    2239                            .dwattr $C$DW$155, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2240                            .dwattr $C$DW$155, DW_AT_decl_line(0xcf)
    2241                            .dwattr $C$DW$155, DW_AT_decl_column(0x05)
    2242                    
    2243                    $C$DW$156       .dwtag  DW_TAG_enumerator
    2244                            .dwattr $C$DW$156, DW_AT_name("CC1350_LAUNCHXL_ADC2")
    2245                            .dwattr $C$DW$156, DW_AT_const_value(0x02)
    2246                            .dwattr $C$DW$156, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2247                            .dwattr $C$DW$156, DW_AT_decl_line(0xd0)
    2248                            .dwattr $C$DW$156, DW_AT_decl_column(0x05)
    2249                    
    2250                    $C$DW$157       .dwtag  DW_TAG_enumerator
    2251                            .dwattr $C$DW$157, DW_AT_name("CC1350_LAUNCHXL_ADC3")
    2252                            .dwattr $C$DW$157, DW_AT_const_value(0x03)
    2253                            .dwattr $C$DW$157, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   42

    2254                            .dwattr $C$DW$157, DW_AT_decl_line(0xd1)
    2255                            .dwattr $C$DW$157, DW_AT_decl_column(0x05)
    2256                    
    2257                    $C$DW$158       .dwtag  DW_TAG_enumerator
    2258                            .dwattr $C$DW$158, DW_AT_name("CC1350_LAUNCHXL_ADC4")
    2259                            .dwattr $C$DW$158, DW_AT_const_value(0x04)
    2260                            .dwattr $C$DW$158, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2261                            .dwattr $C$DW$158, DW_AT_decl_line(0xd2)
    2262                            .dwattr $C$DW$158, DW_AT_decl_column(0x05)
    2263                    
    2264                    $C$DW$159       .dwtag  DW_TAG_enumerator
    2265                            .dwattr $C$DW$159, DW_AT_name("CC1350_LAUNCHXL_ADC5")
    2266                            .dwattr $C$DW$159, DW_AT_const_value(0x05)
    2267                            .dwattr $C$DW$159, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2268                            .dwattr $C$DW$159, DW_AT_decl_line(0xd3)
    2269                            .dwattr $C$DW$159, DW_AT_decl_column(0x05)
    2270                    
    2271                    $C$DW$160       .dwtag  DW_TAG_enumerator
    2272                            .dwattr $C$DW$160, DW_AT_name("CC1350_LAUNCHXL_ADC6")
    2273                            .dwattr $C$DW$160, DW_AT_const_value(0x06)
    2274                            .dwattr $C$DW$160, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2275                            .dwattr $C$DW$160, DW_AT_decl_line(0xd4)
    2276                            .dwattr $C$DW$160, DW_AT_decl_column(0x05)
    2277                    
    2278                    $C$DW$161       .dwtag  DW_TAG_enumerator
    2279                            .dwattr $C$DW$161, DW_AT_name("CC1350_LAUNCHXL_ADC7")
    2280                            .dwattr $C$DW$161, DW_AT_const_value(0x07)
    2281                            .dwattr $C$DW$161, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2282                            .dwattr $C$DW$161, DW_AT_decl_line(0xd5)
    2283                            .dwattr $C$DW$161, DW_AT_decl_column(0x05)
    2284                    
    2285                    $C$DW$162       .dwtag  DW_TAG_enumerator
    2286                            .dwattr $C$DW$162, DW_AT_name("CC1350_LAUNCHXL_ADCDCOUPL")
    2287                            .dwattr $C$DW$162, DW_AT_const_value(0x08)
    2288                            .dwattr $C$DW$162, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2289                            .dwattr $C$DW$162, DW_AT_decl_line(0xd6)
    2290                            .dwattr $C$DW$162, DW_AT_decl_column(0x05)
    2291                    
    2292                    $C$DW$163       .dwtag  DW_TAG_enumerator
    2293                            .dwattr $C$DW$163, DW_AT_name("CC1350_LAUNCHXL_ADCVSS")
    2294                            .dwattr $C$DW$163, DW_AT_const_value(0x09)
    2295                            .dwattr $C$DW$163, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2296                            .dwattr $C$DW$163, DW_AT_decl_line(0xd7)
    2297                            .dwattr $C$DW$163, DW_AT_decl_column(0x05)
    2298                    
    2299                    $C$DW$164       .dwtag  DW_TAG_enumerator
    2300                            .dwattr $C$DW$164, DW_AT_name("CC1350_LAUNCHXL_ADCVDDS")
    2301                            .dwattr $C$DW$164, DW_AT_const_value(0x0a)
    2302                            .dwattr $C$DW$164, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2303                            .dwattr $C$DW$164, DW_AT_decl_line(0xd8)
    2304                            .dwattr $C$DW$164, DW_AT_decl_column(0x05)
    2305                    
    2306                    $C$DW$165       .dwtag  DW_TAG_enumerator
    2307                            .dwattr $C$DW$165, DW_AT_name("CC1350_LAUNCHXL_ADCCOUNT")
    2308                            .dwattr $C$DW$165, DW_AT_const_value(0x0b)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:41:41 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{E6501457-44D3-44CC-9454-CC1E83723EB0} PAGE   43

    2309                            .dwattr $C$DW$165, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2310                            .dwattr $C$DW$165, DW_AT_decl_line(0xda)
    2311                            .dwattr $C$DW$165, DW_AT_decl_column(0x05)
    2312                    
    2313                            .dwattr $C$DW$T$834, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2314                            .dwattr $C$DW$T$834, DW_AT_decl_line(0xcd)
    2315                            .dwattr $C$DW$T$834, DW_AT_decl_column(0x0e)
    2316                            .dwendtag $C$DW$T$834
    2317                    
    2318                    $C$DW$T$835     .dwtag  DW_TAG_typedef
    2319                            .dwattr $C$DW$T$835, DW_AT_name("CC1350_LAUNCHXL_ADCName")
    2320                            .dwattr $C$DW$T$835, DW_AT_type(*$C$DW$T$834)
    2321                            .dwattr $C$DW$T$835, DW_AT_language(DW_LANG_C)
    2322                            .dwattr $C$DW$T$835, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2323                            .dwattr $C$DW$T$835, DW_AT_decl_line(0xdb)
    2324                            .dwattr $C$DW$T$835, DW_AT_decl_column(0x03)
    2325                    
    2326                    
    2327                    $C$DW$T$836     .dwtag  DW_TAG_enumeration_type
    2328                            .dwattr $C$DW$T$836, DW_AT_name("CC1350_LAUNCHXL_CryptoName")
    2329                            .dwattr $C$DW$T$836, DW_AT_byte_size(0x01)
    2330                    $C$DW$166       .dwtag  DW_TAG_enumerator
    2331                            .dwattr $C$DW$166, DW_AT_name("CC1350_LAUNCHXL_CRYPTO0")
    2332                            .dwattr $C$DW$166, DW_AT_const_value(0x00)
    2333                            .dwattr $C$DW$166, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2334                            .dwattr $C$DW$166, DW_AT_decl_line(0xe2)
    2335                            .dwattr $C$DW$166, DW_AT_decl_column(0x05)
    2336                    
    2337                    $C$DW$167       .dwtag  DW_TAG_enumerator
    2338                            .dwattr $C$DW$167, DW_AT_name("CC1350_LAUNCHXL_CRYPTOCOUNT")
    2339                            .dwattr $C$DW$167, DW_AT_const_value(0x01)
    2340                            .dwattr $C$DW$167, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    2341                            .dwattr $C$DW$167, DW_AT_decl_line(0xe4)
    2342                            .dwattr $C$DW$167, DW_AT_decl_column(0x05)
    2343                    
    2344                            .dwattr $C$DW$T$836, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2345                            .dwattr $C$DW$T$836, DW_AT_decl_line(0xe1)
    2346                            .dwattr $C$DW$T$836, DW_AT_decl_column(0x0e)
    2347                            .dwendtag $C$DW$T$836
    2348                    
    2349                    $C$DW$T$837     .dwtag  DW_TAG_typedef
    2350                            .dwattr $C$DW$T$837, DW_AT_name("CC1350_LAUNCHXL_CryptoName")
    2351                            .dwattr $C$DW$T$837, DW_AT_type(*$C$DW$T$836)
    2352                            .dwattr $C$DW$T$837, DW_AT_language(DW_LANG_C)
    2353                            .dwattr $C$DW$T$837, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    2354                            .dwattr $C$DW$T$837, DW_AT_decl_line(0xe5)
    2355                            .dwattr $C$DW$T$837, DW_AT_decl_column(0x03)
