TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Dec 12 17:42:14 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/osaltasks.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\The_Wonderer\Google Drive\School\2018_3_Semester_Fa
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    4307                            .dwattr $C$DW$437, DW_AT_const_value(0x08)
    4308                            .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4309                            .dwattr $C$DW$437, DW_AT_decl_line(0xa8)
    4310                            .dwattr $C$DW$437, DW_AT_decl_column(0x05)
    4311                    
    4312                    $C$DW$438       .dwtag  DW_TAG_enumerator
    4313                            .dwattr $C$DW$438, DW_AT_name("FAPI_VALIDATE_SECTOR")
    4314                            .dwattr $C$DW$438, DW_AT_const_value(0x0e)
    4315                            .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4316                            .dwattr $C$DW$438, DW_AT_decl_line(0xa9)
    4317                            .dwattr $C$DW$438, DW_AT_decl_column(0x05)
    4318                    
    4319                    $C$DW$439       .dwtag  DW_TAG_enumerator
    4320                            .dwattr $C$DW$439, DW_AT_name("FAPI_CLEAR_STATUS")
    4321                            .dwattr $C$DW$439, DW_AT_const_value(0x10)
    4322                            .dwattr $C$DW$439, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4323                            .dwattr $C$DW$439, DW_AT_decl_line(0xaa)
    4324                            .dwattr $C$DW$439, DW_AT_decl_column(0x05)
    4325                    
    4326                    $C$DW$440       .dwtag  DW_TAG_enumerator
    4327                            .dwattr $C$DW$440, DW_AT_name("FAPI_PROGRAM_RESUME")
    4328                            .dwattr $C$DW$440, DW_AT_const_value(0x14)
    4329                            .dwattr $C$DW$440, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4330                            .dwattr $C$DW$440, DW_AT_decl_line(0xab)
    4331                            .dwattr $C$DW$440, DW_AT_decl_column(0x05)
    4332                    
    4333                    $C$DW$441       .dwtag  DW_TAG_enumerator
    4334                            .dwattr $C$DW$441, DW_AT_name("FAPI_ERASE_RESUME")
    4335                            .dwattr $C$DW$441, DW_AT_const_value(0x16)
    4336                            .dwattr $C$DW$441, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4337                            .dwattr $C$DW$441, DW_AT_decl_line(0xac)
    4338                            .dwattr $C$DW$441, DW_AT_decl_column(0x05)
    4339                    
    4340                    $C$DW$442       .dwtag  DW_TAG_enumerator
    4341                            .dwattr $C$DW$442, DW_AT_name("FAPI_CLEAR_MORE")
    4342                            .dwattr $C$DW$442, DW_AT_const_value(0x18)
    4343                            .dwattr $C$DW$442, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4344                            .dwattr $C$DW$442, DW_AT_decl_line(0xad)
    4345                            .dwattr $C$DW$442, DW_AT_decl_column(0x05)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   80

    4346                    
    4347                    $C$DW$443       .dwtag  DW_TAG_enumerator
    4348                            .dwattr $C$DW$443, DW_AT_name("FAPI_PROGRAM_SECTOR")
    4349                            .dwattr $C$DW$443, DW_AT_const_value(0x20)
    4350                            .dwattr $C$DW$443, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4351                            .dwattr $C$DW$443, DW_AT_decl_line(0xae)
    4352                            .dwattr $C$DW$443, DW_AT_decl_column(0x05)
    4353                    
    4354                    $C$DW$444       .dwtag  DW_TAG_enumerator
    4355                            .dwattr $C$DW$444, DW_AT_name("FAPI_ERASE_OTP")
    4356                            .dwattr $C$DW$444, DW_AT_const_value(0x30)
    4357                            .dwattr $C$DW$444, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4358                            .dwattr $C$DW$444, DW_AT_decl_line(0xaf)
    4359                            .dwattr $C$DW$444, DW_AT_decl_column(0x05)
    4360                    
    4361                            .dwattr $C$DW$T$1084, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/device
    4362                            .dwattr $C$DW$T$1084, DW_AT_decl_line(0xa5)
    4363                            .dwattr $C$DW$T$1084, DW_AT_decl_column(0x01)
    4364                            .dwendtag $C$DW$T$1084
    4365                    
    4366                    $C$DW$T$1085    .dwtag  DW_TAG_typedef
    4367                            .dwattr $C$DW$T$1085, DW_AT_name("tFlashStateCommandsType")
    4368                            .dwattr $C$DW$T$1085, DW_AT_type(*$C$DW$T$1084)
    4369                            .dwattr $C$DW$T$1085, DW_AT_language(DW_LANG_C)
    4370                            .dwattr $C$DW$T$1085, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/device
    4371                            .dwattr $C$DW$T$1085, DW_AT_decl_line(0xb0)
    4372                            .dwattr $C$DW$T$1085, DW_AT_decl_column(0x03)
    4373                    
    4374                    
    4375                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4376                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    4377                    $C$DW$445       .dwtag  DW_TAG_member
    4378                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$22)
    4379                            .dwattr $C$DW$445, DW_AT_name("rfMode")
    4380                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("rfMode")
    4381                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4382                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4383                            .dwattr $C$DW$445, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4384                            .dwattr $C$DW$445, DW_AT_decl_line(0x421)
    4385                            .dwattr $C$DW$445, DW_AT_decl_column(0x0d)
    4386                    
    4387                    $C$DW$446       .dwtag  DW_TAG_member
    4388                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$24)
    4389                            .dwattr $C$DW$446, DW_AT_name("cpePatchFxn")
    4390                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("cpePatchFxn")
    4391                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4392                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4393                            .dwattr $C$DW$446, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4394                            .dwattr $C$DW$446, DW_AT_decl_line(0x422)
    4395                            .dwattr $C$DW$446, DW_AT_decl_column(0x0c)
    4396                    
    4397                    $C$DW$447       .dwtag  DW_TAG_member
    4398                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$24)
    4399                            .dwattr $C$DW$447, DW_AT_name("mcePatchFxn")
    4400                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("mcePatchFxn")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   81

    4401                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4402                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4403                            .dwattr $C$DW$447, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4404                            .dwattr $C$DW$447, DW_AT_decl_line(0x423)
    4405                            .dwattr $C$DW$447, DW_AT_decl_column(0x0c)
    4406                    
    4407                    $C$DW$448       .dwtag  DW_TAG_member
    4408                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$24)
    4409                            .dwattr $C$DW$448, DW_AT_name("rfePatchFxn")
    4410                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("rfePatchFxn")
    4411                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4412                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4413                            .dwattr $C$DW$448, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4414                            .dwattr $C$DW$448, DW_AT_decl_line(0x424)
    4415                            .dwattr $C$DW$448, DW_AT_decl_column(0x0c)
    4416                    
    4417                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4418                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x420)
    4419                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4420                            .dwendtag $C$DW$T$25
    4421                    
    4422                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    4423                            .dwattr $C$DW$T$38, DW_AT_name("RF_Mode")
    4424                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$25)
    4425                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4426                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4427                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x425)
    4428                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    4429                    
    4430                    $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4431                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    4432                            .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    4433                    
    4434                    
    4435                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4436                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    4437                    $C$DW$449       .dwtag  DW_TAG_member
    4438                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$27)
    4439                            .dwattr $C$DW$449, DW_AT_name("rawValue")
    4440                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("rawValue")
    4441                            .dwattr $C$DW$449, DW_AT_bit_offset(0x0a)
    4442                            .dwattr $C$DW$449, DW_AT_bit_size(0x16)
    4443                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4444                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4445                            .dwattr $C$DW$449, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4446                            .dwattr $C$DW$449, DW_AT_decl_line(0x3d6)
    4447                            .dwattr $C$DW$449, DW_AT_decl_column(0x0e)
    4448                    
    4449                    $C$DW$450       .dwtag  DW_TAG_member
    4450                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$27)
    4451                            .dwattr $C$DW$450, DW_AT_name("__dummy")
    4452                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("__dummy")
    4453                            .dwattr $C$DW$450, DW_AT_bit_offset(0x01)
    4454                            .dwattr $C$DW$450, DW_AT_bit_size(0x09)
    4455                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   82

    4456                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4457                            .dwattr $C$DW$450, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4458                            .dwattr $C$DW$450, DW_AT_decl_line(0x3da)
    4459                            .dwattr $C$DW$450, DW_AT_decl_column(0x0e)
    4460                    
    4461                    $C$DW$451       .dwtag  DW_TAG_member
    4462                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$27)
    4463                            .dwattr $C$DW$451, DW_AT_name("paType")
    4464                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("paType")
    4465                            .dwattr $C$DW$451, DW_AT_bit_offset(0x00)
    4466                            .dwattr $C$DW$451, DW_AT_bit_size(0x01)
    4467                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4468                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4469                            .dwattr $C$DW$451, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4470                            .dwattr $C$DW$451, DW_AT_decl_line(0x3db)
    4471                            .dwattr $C$DW$451, DW_AT_decl_column(0x0e)
    4472                    
    4473                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4474                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3d5)
    4475                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4476                            .dwendtag $C$DW$T$28
    4477                    
    4478                    $C$DW$T$31      .dwtag  DW_TAG_typedef
    4479                            .dwattr $C$DW$T$31, DW_AT_name("RF_TxPowerTable_Value")
    4480                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    4481                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4482                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4483                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x3df)
    4484                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    4485                    
    4486                    
    4487                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4488                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x05)
    4489                    $C$DW$452       .dwtag  DW_TAG_member
    4490                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$30)
    4491                            .dwattr $C$DW$452, DW_AT_name("power")
    4492                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("power")
    4493                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4494                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4495                            .dwattr $C$DW$452, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4496                            .dwattr $C$DW$452, DW_AT_decl_line(0x3f5)
    4497                            .dwattr $C$DW$452, DW_AT_decl_column(0x0c)
    4498                    
    4499                    $C$DW$453       .dwtag  DW_TAG_member
    4500                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$31)
    4501                            .dwattr $C$DW$453, DW_AT_name("value")
    4502                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("value")
    4503                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4504                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4505                            .dwattr $C$DW$453, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4506                            .dwattr $C$DW$453, DW_AT_decl_line(0x3f8)
    4507                            .dwattr $C$DW$453, DW_AT_decl_column(0x1b)
    4508                    
    4509                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4510                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x3f4)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   83

    4511                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    4512                            .dwendtag $C$DW$T$32
    4513                    
    4514                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    4515                            .dwattr $C$DW$T$33, DW_AT_name("RF_TxPowerTable_Entry")
    4516                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4517                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4518                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4519                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x3f9)
    4520                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x1b)
    4521                    
    4522                    $C$DW$T$34      .dwtag  DW_TAG_const_type
    4523                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4524                    
    4525                    $C$DW$T$35      .dwtag  DW_TAG_typedef
    4526                            .dwattr $C$DW$T$35, DW_AT_name("macTxPwrVal_t")
    4527                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4528                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4529                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    4530                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x144)
    4531                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x25)
    4532                    
    4533                    $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    4534                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    4535                            .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    4536                    
    4537                    
    4538                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4539                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    4540                    $C$DW$454       .dwtag  DW_TAG_member
    4541                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$36)
    4542                            .dwattr $C$DW$454, DW_AT_name("pTxPwrVals")
    4543                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("pTxPwrVals")
    4544                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4545                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4546                            .dwattr $C$DW$454, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4547                            .dwattr $C$DW$454, DW_AT_decl_line(0x148)
    4548                            .dwattr $C$DW$454, DW_AT_decl_column(0x12)
    4549                    
    4550                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    4551                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x147)
    4552                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    4553                            .dwendtag $C$DW$T$37
    4554                    
    4555                    $C$DW$T$41      .dwtag  DW_TAG_const_type
    4556                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$37)
    4557                    
    4558                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    4559                            .dwattr $C$DW$T$42, DW_AT_name("macTxPwrTbl_t")
    4560                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4561                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4562                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    4563                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x149)
    4564                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    4565                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   84

    4566                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4567                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4568                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4569                    
    4570                    
    4571                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    4572                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x30)
    4573                    $C$DW$455       .dwtag  DW_TAG_member
    4574                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$27)
    4575                            .dwattr $C$DW$455, DW_AT_name("getHwRevision")
    4576                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("getHwRevision")
    4577                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4578                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4579                            .dwattr $C$DW$455, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4580                            .dwattr $C$DW$455, DW_AT_decl_line(0x155)
    4581                            .dwattr $C$DW$455, DW_AT_decl_column(0x1c)
    4582                    
    4583                    $C$DW$456       .dwtag  DW_TAG_member
    4584                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$39)
    4585                            .dwattr $C$DW$456, DW_AT_name("pRfPatchTable")
    4586                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("pRfPatchTable")
    4587                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4588                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4589                            .dwattr $C$DW$456, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4590                            .dwattr $C$DW$456, DW_AT_decl_line(0x156)
    4591                            .dwattr $C$DW$456, DW_AT_decl_column(0x1d)
    4592                    
    4593                    $C$DW$457       .dwtag  DW_TAG_member
    4594                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$40)
    4595                            .dwattr $C$DW$457, DW_AT_name("pRfDrvTblPtr")
    4596                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("pRfDrvTblPtr")
    4597                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4598                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4599                            .dwattr $C$DW$457, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4600                            .dwattr $C$DW$457, DW_AT_decl_line(0x157)
    4601                            .dwattr $C$DW$457, DW_AT_decl_column(0x1d)
    4602                    
    4603                    $C$DW$458       .dwtag  DW_TAG_member
    4604                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$40)
    4605                            .dwattr $C$DW$458, DW_AT_name("pCryptoDrvTblPtr")
    4606                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("pCryptoDrvTblPtr")
    4607                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4608                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4609                            .dwattr $C$DW$458, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4610                            .dwattr $C$DW$458, DW_AT_decl_line(0x158)
    4611                            .dwattr $C$DW$458, DW_AT_decl_column(0x1d)
    4612                    
    4613                    $C$DW$459       .dwtag  DW_TAG_member
    4614                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$43)
    4615                            .dwattr $C$DW$459, DW_AT_name("pTxPwrTbl")
    4616                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("pTxPwrTbl")
    4617                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4618                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4619                            .dwattr $C$DW$459, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4620                            .dwattr $C$DW$459, DW_AT_decl_line(0x159)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   85

    4621                            .dwattr $C$DW$459, DW_AT_decl_column(0x20)
    4622                    
    4623                    $C$DW$460       .dwtag  DW_TAG_member
    4624                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$44)
    4625                            .dwattr $C$DW$460, DW_AT_name("pOverrides")
    4626                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("pOverrides")
    4627                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4628                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4629                            .dwattr $C$DW$460, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4630                            .dwattr $C$DW$460, DW_AT_decl_line(0x15a)
    4631                            .dwattr $C$DW$460, DW_AT_decl_column(0x1e)
    4632                    
    4633                    $C$DW$461       .dwtag  DW_TAG_member
    4634                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$45)
    4635                            .dwattr $C$DW$461, DW_AT_name("pLoDivider")
    4636                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("pLoDivider")
    4637                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4638                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4639                            .dwattr $C$DW$461, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4640                            .dwattr $C$DW$461, DW_AT_decl_line(0x15b)
    4641                            .dwattr $C$DW$461, DW_AT_decl_column(0x1d)
    4642                    
    4643                    $C$DW$462       .dwtag  DW_TAG_member
    4644                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$22)
    4645                            .dwattr $C$DW$462, DW_AT_name("rfFeModeBias")
    4646                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("rfFeModeBias")
    4647                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4648                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4649                            .dwattr $C$DW$462, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4650                            .dwattr $C$DW$462, DW_AT_decl_line(0x15c)
    4651                            .dwattr $C$DW$462, DW_AT_decl_column(0x1c)
    4652                    
    4653                    $C$DW$463       .dwtag  DW_TAG_member
    4654                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$22)
    4655                            .dwattr $C$DW$463, DW_AT_name("phyId")
    4656                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("phyId")
    4657                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4658                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4659                            .dwattr $C$DW$463, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4660                            .dwattr $C$DW$463, DW_AT_decl_line(0x15d)
    4661                            .dwattr $C$DW$463, DW_AT_decl_column(0x1c)
    4662                    
    4663                    $C$DW$464       .dwtag  DW_TAG_member
    4664                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$22)
    4665                            .dwattr $C$DW$464, DW_AT_name("last")
    4666                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("last")
    4667                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4668                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4669                            .dwattr $C$DW$464, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4670                            .dwattr $C$DW$464, DW_AT_decl_line(0x15e)
    4671                            .dwattr $C$DW$464, DW_AT_decl_column(0x1c)
    4672                    
    4673                    $C$DW$465       .dwtag  DW_TAG_member
    4674                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$48)
    4675                            .dwattr $C$DW$465, DW_AT_name("pSetRE")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   86

    4676                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("pSetRE")
    4677                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4678                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4679                            .dwattr $C$DW$465, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4680                            .dwattr $C$DW$465, DW_AT_decl_line(0x15f)
    4681                            .dwattr $C$DW$465, DW_AT_decl_column(0x1c)
    4682                    
    4683                    $C$DW$466       .dwtag  DW_TAG_member
    4684                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$49)
    4685                            .dwattr $C$DW$466, DW_AT_name("pAssertFP")
    4686                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("pAssertFP")
    4687                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4688                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4689                            .dwattr $C$DW$466, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4690                            .dwattr $C$DW$466, DW_AT_decl_line(0x160)
    4691                            .dwattr $C$DW$466, DW_AT_decl_column(0x1c)
    4692                    
    4693                    $C$DW$467       .dwtag  DW_TAG_member
    4694                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$52)
    4695                            .dwattr $C$DW$467, DW_AT_name("pAntSwitchFP")
    4696                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("pAntSwitchFP")
    4697                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4698                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4699                            .dwattr $C$DW$467, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4700                            .dwattr $C$DW$467, DW_AT_decl_line(0x161)
    4701                            .dwattr $C$DW$467, DW_AT_decl_column(0x1c)
    4702                    
    4703                    $C$DW$468       .dwtag  DW_TAG_member
    4704                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$53)
    4705                            .dwattr $C$DW$468, DW_AT_name("pAntPwrFP")
    4706                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("pAntPwrFP")
    4707                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4708                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4709                            .dwattr $C$DW$468, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    4710                            .dwattr $C$DW$468, DW_AT_decl_line(0x162)
    4711                            .dwattr $C$DW$468, DW_AT_decl_column(0x1c)
    4712                    
    4713                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    4714                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x154)
    4715                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
    4716                            .dwendtag $C$DW$T$54
    4717                    
    4718                    $C$DW$T$1087    .dwtag  DW_TAG_typedef
    4719                            .dwattr $C$DW$T$1087, DW_AT_name("macUserCfg_t")
    4720                            .dwattr $C$DW$T$1087, DW_AT_type(*$C$DW$T$54)
    4721                            .dwattr $C$DW$T$1087, DW_AT_language(DW_LANG_C)
    4722                            .dwattr $C$DW$T$1087, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC
    4723                            .dwattr $C$DW$T$1087, DW_AT_decl_line(0x163)
    4724                            .dwattr $C$DW$T$1087, DW_AT_decl_column(0x03)
    4725                    
    4726                    $C$DW$T$1088    .dwtag  DW_TAG_pointer_type
    4727                            .dwattr $C$DW$T$1088, DW_AT_type(*$C$DW$T$1087)
    4728                            .dwattr $C$DW$T$1088, DW_AT_address_class(0x20)
    4729                    
    4730                    
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   87

    4731                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    4732                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
    4733                    $C$DW$469       .dwtag  DW_TAG_member
    4734                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$14)
    4735                            .dwattr $C$DW$469, DW_AT_name("__max_align1")
    4736                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("__max_align1")
    4737                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4738                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4739                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4740                            .dwattr $C$DW$469, DW_AT_decl_line(0x70)
    4741                            .dwattr $C$DW$469, DW_AT_decl_column(0x0c)
    4742                    
    4743                    $C$DW$470       .dwtag  DW_TAG_member
    4744                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$18)
    4745                            .dwattr $C$DW$470, DW_AT_name("__max_align2")
    4746                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("__max_align2")
    4747                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4748                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4749                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4750                            .dwattr $C$DW$470, DW_AT_decl_line(0x71)
    4751                            .dwattr $C$DW$470, DW_AT_decl_column(0x0e)
    4752                    
    4753                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    4754                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x6f)
    4755                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    4756                            .dwendtag $C$DW$T$55
    4757                    
    4758                    $C$DW$T$1089    .dwtag  DW_TAG_typedef
    4759                            .dwattr $C$DW$T$1089, DW_AT_name("__max_align_t")
    4760                            .dwattr $C$DW$T$1089, DW_AT_type(*$C$DW$T$55)
    4761                            .dwattr $C$DW$T$1089, DW_AT_language(DW_LANG_C)
    4762                            .dwattr $C$DW$T$1089, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    4763                            .dwattr $C$DW$T$1089, DW_AT_decl_line(0x72)
    4764                            .dwattr $C$DW$T$1089, DW_AT_decl_column(0x03)
    4765                    
    4766                    
    4767                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4768                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x08)
    4769                    $C$DW$471       .dwtag  DW_TAG_member
    4770                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$10)
    4771                            .dwattr $C$DW$471, DW_AT_name("quot")
    4772                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("quot")
    4773                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4774                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4775                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4776                            .dwattr $C$DW$471, DW_AT_decl_line(0x49)
    4777                            .dwattr $C$DW$471, DW_AT_decl_column(0x16)
    4778                    
    4779                    $C$DW$472       .dwtag  DW_TAG_member
    4780                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$10)
    4781                            .dwattr $C$DW$472, DW_AT_name("rem")
    4782                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("rem")
    4783                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4784                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4785                            .dwattr $C$DW$472, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   88

    4786                            .dwattr $C$DW$472, DW_AT_decl_line(0x49)
    4787                            .dwattr $C$DW$472, DW_AT_decl_column(0x1c)
    4788                    
    4789                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    4790                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x49)
    4791                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
    4792                            .dwendtag $C$DW$T$56
    4793                    
    4794                    $C$DW$T$1090    .dwtag  DW_TAG_typedef
    4795                            .dwattr $C$DW$T$1090, DW_AT_name("div_t")
    4796                            .dwattr $C$DW$T$1090, DW_AT_type(*$C$DW$T$56)
    4797                            .dwattr $C$DW$T$1090, DW_AT_language(DW_LANG_C)
    4798                            .dwattr $C$DW$T$1090, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    4799                            .dwattr $C$DW$T$1090, DW_AT_decl_line(0x49)
    4800                            .dwattr $C$DW$T$1090, DW_AT_decl_column(0x23)
    4801                    
    4802                    
    4803                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    4804                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x08)
    4805                    $C$DW$473       .dwtag  DW_TAG_member
    4806                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$10)
    4807                            .dwattr $C$DW$473, DW_AT_name("quot")
    4808                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("quot")
    4809                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4810                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4811                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4812                            .dwattr $C$DW$473, DW_AT_decl_line(0x4e)
    4813                            .dwattr $C$DW$473, DW_AT_decl_column(0x16)
    4814                    
    4815                    $C$DW$474       .dwtag  DW_TAG_member
    4816                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$10)
    4817                            .dwattr $C$DW$474, DW_AT_name("rem")
    4818                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("rem")
    4819                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4820                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4821                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4822                            .dwattr $C$DW$474, DW_AT_decl_line(0x4e)
    4823                            .dwattr $C$DW$474, DW_AT_decl_column(0x1c)
    4824                    
    4825                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    4826                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x4e)
    4827                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x10)
    4828                            .dwendtag $C$DW$T$57
    4829                    
    4830                    $C$DW$T$1091    .dwtag  DW_TAG_typedef
    4831                            .dwattr $C$DW$T$1091, DW_AT_name("ldiv_t")
    4832                            .dwattr $C$DW$T$1091, DW_AT_type(*$C$DW$T$57)
    4833                            .dwattr $C$DW$T$1091, DW_AT_language(DW_LANG_C)
    4834                            .dwattr $C$DW$T$1091, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    4835                            .dwattr $C$DW$T$1091, DW_AT_decl_line(0x4e)
    4836                            .dwattr $C$DW$T$1091, DW_AT_decl_column(0x23)
    4837                    
    4838                    
    4839                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    4840                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   89

    4841                    $C$DW$475       .dwtag  DW_TAG_member
    4842                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$14)
    4843                            .dwattr $C$DW$475, DW_AT_name("quot")
    4844                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("quot")
    4845                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4846                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4847                            .dwattr $C$DW$475, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4848                            .dwattr $C$DW$475, DW_AT_decl_line(0x56)
    4849                            .dwattr $C$DW$475, DW_AT_decl_column(0x1c)
    4850                    
    4851                    $C$DW$476       .dwtag  DW_TAG_member
    4852                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$14)
    4853                            .dwattr $C$DW$476, DW_AT_name("rem")
    4854                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("rem")
    4855                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4856                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4857                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4858                            .dwattr $C$DW$476, DW_AT_decl_line(0x56)
    4859                            .dwattr $C$DW$476, DW_AT_decl_column(0x22)
    4860                    
    4861                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    4862                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x56)
    4863                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
    4864                            .dwendtag $C$DW$T$58
    4865                    
    4866                    $C$DW$T$1092    .dwtag  DW_TAG_typedef
    4867                            .dwattr $C$DW$T$1092, DW_AT_name("lldiv_t")
    4868                            .dwattr $C$DW$T$1092, DW_AT_type(*$C$DW$T$58)
    4869                            .dwattr $C$DW$T$1092, DW_AT_language(DW_LANG_C)
    4870                            .dwattr $C$DW$T$1092, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    4871                            .dwattr $C$DW$T$1092, DW_AT_decl_line(0x56)
    4872                            .dwattr $C$DW$T$1092, DW_AT_decl_column(0x29)
    4873                    
    4874                    
    4875                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4876                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
    4877                    $C$DW$477       .dwtag  DW_TAG_member
    4878                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$61)
    4879                            .dwattr $C$DW$477, DW_AT_name("pointerStack")
    4880                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("pointerStack")
    4881                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4882                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4883                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4884                            .dwattr $C$DW$477, DW_AT_decl_line(0x3f5)
    4885                            .dwattr $C$DW$477, DW_AT_decl_column(0x16)
    4886                    
    4887                    $C$DW$478       .dwtag  DW_TAG_member
    4888                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$62)
    4889                            .dwattr $C$DW$478, DW_AT_name("directAPI")
    4890                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("directAPI")
    4891                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4892                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4893                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4894                            .dwattr $C$DW$478, DW_AT_decl_line(0x3f6)
    4895                            .dwattr $C$DW$478, DW_AT_decl_column(0x15)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   90

    4896                    
    4897                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4898                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x3f4)
    4899                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    4900                            .dwendtag $C$DW$T$63
    4901                    
    4902                    $C$DW$T$65      .dwtag  DW_TAG_typedef
    4903                            .dwattr $C$DW$T$65, DW_AT_name("icall_directAPIMsg_t")
    4904                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
    4905                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4906                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4907                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x3f7)
    4908                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    4909                    
    4910                    
    4911                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4912                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x14)
    4913                    $C$DW$479       .dwtag  DW_TAG_member
    4914                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$64)
    4915                            .dwattr $C$DW$479, DW_AT_name("hdr")
    4916                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("hdr")
    4917                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4918                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4919                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4920                            .dwattr $C$DW$479, DW_AT_decl_line(0x3fb)
    4921                            .dwattr $C$DW$479, DW_AT_decl_column(0x10)
    4922                    
    4923                    $C$DW$480       .dwtag  DW_TAG_member
    4924                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$65)
    4925                            .dwattr $C$DW$480, DW_AT_name("msg")
    4926                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("msg")
    4927                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4928                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4929                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4930                            .dwattr $C$DW$480, DW_AT_decl_line(0x3fc)
    4931                            .dwattr $C$DW$480, DW_AT_decl_column(0x1a)
    4932                    
    4933                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4934                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x3fa)
    4935                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
    4936                            .dwendtag $C$DW$T$66
    4937                    
    4938                    $C$DW$T$1093    .dwtag  DW_TAG_typedef
    4939                            .dwattr $C$DW$T$1093, DW_AT_name("icallLiteMsg_t")
    4940                            .dwattr $C$DW$T$1093, DW_AT_type(*$C$DW$T$66)
    4941                            .dwattr $C$DW$T$1093, DW_AT_language(DW_LANG_C)
    4942                            .dwattr $C$DW$T$1093, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    4943                            .dwattr $C$DW$T$1093, DW_AT_decl_line(0x3fd)
    4944                            .dwattr $C$DW$T$1093, DW_AT_decl_column(0x03)
    4945                    
    4946                    
    4947                    $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4948                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x0a)
    4949                    $C$DW$481       .dwtag  DW_TAG_member
    4950                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$494)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   91

    4951                            .dwattr $C$DW$481, DW_AT_name("addr")
    4952                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("addr")
    4953                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4954                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4955                            .dwattr $C$DW$481, DW_AT_decl_file("C:/Users/The_Wonderer/Google Drive/School/2018_3_Semester_
    4956                            .dwattr $C$DW$481, DW_AT_decl_line(0x55)
    4957                            .dwattr $C$DW$481, DW_AT_decl_column(0x05)
    4958                    
    4959                    $C$DW$482       .dwtag  DW_TAG_member
    4960                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$22)
    4961                            .dwattr $C$DW$482, DW_AT_name("addrMode")
    4962                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("addrMode")
    4963                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4964                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4965                            .dwattr $C$DW$482, DW_AT_decl_file("C:/Users/The_Wonderer/Google Drive/School/2018_3_Semester_
    4966                            .dwattr $C$DW$482, DW_AT_decl_line(0x56)
    4967                            .dwattr $C$DW$482, DW_AT_decl_column(0x13)
    4968                    
    4969                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/The_Wonderer/Google Drive/School/2018_3_Semester
    4970                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x50)
    4971                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
    4972                            .dwendtag $C$DW$T$67
    4973                    
    4974                    $C$DW$T$386     .dwtag  DW_TAG_typedef
    4975                            .dwattr $C$DW$T$386, DW_AT_name("sAddr_t")
    4976                            .dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$67)
    4977                            .dwattr $C$DW$T$386, DW_AT_language(DW_LANG_C)
    4978                            .dwattr $C$DW$T$386, DW_AT_decl_file("C:/Users/The_Wonderer/Google Drive/School/2018_3_Semeste
    4979                            .dwattr $C$DW$T$386, DW_AT_decl_line(0x57)
    4980                            .dwattr $C$DW$T$386, DW_AT_decl_column(0x03)
    4981                    
    4982                    $C$DW$T$442     .dwtag  DW_TAG_pointer_type
    4983                            .dwattr $C$DW$T$442, DW_AT_type(*$C$DW$T$386)
    4984                            .dwattr $C$DW$T$442, DW_AT_address_class(0x20)
    4985                    
    4986                    
    4987                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4988                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    4989                    $C$DW$483       .dwtag  DW_TAG_member
    4990                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$497)
    4991                            .dwattr $C$DW$483, DW_AT_name("addr")
    4992                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("addr")
    4993                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4994                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4995                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4996                            .dwattr $C$DW$483, DW_AT_decl_line(0x139)
    4997                            .dwattr $C$DW$483, DW_AT_decl_column(0x05)
    4998                    
    4999                    $C$DW$484       .dwtag  DW_TAG_member
    5000                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$69)
    5001                            .dwattr $C$DW$484, DW_AT_name("addrMode")
    5002                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("addrMode")
    5003                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5004                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5005                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   92

    5006                            .dwattr $C$DW$484, DW_AT_decl_line(0x13a)
    5007                            .dwattr $C$DW$484, DW_AT_decl_column(0x08)
    5008                    
    5009                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    5010                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x134)
    5011                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x01)
    5012                            .dwendtag $C$DW$T$70
    5013                    
    5014                    $C$DW$T$1094    .dwtag  DW_TAG_typedef
    5015                            .dwattr $C$DW$T$1094, DW_AT_name("zAddrType_t")
    5016                            .dwattr $C$DW$T$1094, DW_AT_type(*$C$DW$T$70)
    5017                            .dwattr $C$DW$T$1094, DW_AT_language(DW_LANG_C)
    5018                            .dwattr $C$DW$T$1094, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    5019                            .dwattr $C$DW$T$1094, DW_AT_decl_line(0x13b)
    5020                            .dwattr $C$DW$T$1094, DW_AT_decl_column(0x03)
    5021                    
    5022                    
    5023                    $C$DW$T$73      .dwtag  DW_TAG_structure_type
    5024                            .dwattr $C$DW$T$73, DW_AT_byte_size(0x0c)
    5025                    $C$DW$485       .dwtag  DW_TAG_member
    5026                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$68)
    5027                            .dwattr $C$DW$485, DW_AT_name("txCounter")
    5028                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("txCounter")
    5029                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5030                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5031                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5032                            .dwattr $C$DW$485, DW_AT_decl_line(0x198)
    5033                            .dwattr $C$DW$485, DW_AT_decl_column(0x0a)
    5034                    
    5035                    $C$DW$486       .dwtag  DW_TAG_member
    5036                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$68)
    5037                            .dwattr $C$DW$486, DW_AT_name("txCost")
    5038                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("txCost")
    5039                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5040                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5041                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5042                            .dwattr $C$DW$486, DW_AT_decl_line(0x199)
    5043                            .dwattr $C$DW$486, DW_AT_decl_column(0x0a)
    5044                    
    5045                    $C$DW$487       .dwtag  DW_TAG_member
    5046                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$68)
    5047                            .dwattr $C$DW$487, DW_AT_name("rxLqi")
    5048                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("rxLqi")
    5049                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5050                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5051                            .dwattr $C$DW$487, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5052                            .dwattr $C$DW$487, DW_AT_decl_line(0x19b)
    5053                            .dwattr $C$DW$487, DW_AT_decl_column(0x0a)
    5054                    
    5055                    $C$DW$488       .dwtag  DW_TAG_member
    5056                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$68)
    5057                            .dwattr $C$DW$488, DW_AT_name("inKeySeqNum")
    5058                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("inKeySeqNum")
    5059                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5060                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   93

    5061                            .dwattr $C$DW$488, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5062                            .dwattr $C$DW$488, DW_AT_decl_line(0x19d)
    5063                            .dwattr $C$DW$488, DW_AT_decl_column(0x0a)
    5064                    
    5065                    $C$DW$489       .dwtag  DW_TAG_member
    5066                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$71)
    5067                            .dwattr $C$DW$489, DW_AT_name("inFrmCntr")
    5068                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("inFrmCntr")
    5069                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5070                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5071                            .dwattr $C$DW$489, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5072                            .dwattr $C$DW$489, DW_AT_decl_line(0x19e)
    5073                            .dwattr $C$DW$489, DW_AT_decl_column(0x0a)
    5074                    
    5075                    $C$DW$490       .dwtag  DW_TAG_member
    5076                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$72)
    5077                            .dwattr $C$DW$490, DW_AT_name("txFailure")
    5078                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("txFailure")
    5079                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5080                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5081                            .dwattr $C$DW$490, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5082                            .dwattr $C$DW$490, DW_AT_decl_line(0x19f)
    5083                            .dwattr $C$DW$490, DW_AT_decl_column(0x0a)
    5084                    
    5085                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    5086                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x197)
    5087                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x01)
    5088                            .dwendtag $C$DW$T$73
    5089                    
    5090                    $C$DW$T$1095    .dwtag  DW_TAG_typedef
    5091                            .dwattr $C$DW$T$1095, DW_AT_name("linkInfo_t")
    5092                            .dwattr $C$DW$T$1095, DW_AT_type(*$C$DW$T$73)
    5093                            .dwattr $C$DW$T$1095, DW_AT_language(DW_LANG_C)
    5094                            .dwattr $C$DW$T$1095, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    5095                            .dwattr $C$DW$T$1095, DW_AT_decl_line(0x1a0)
    5096                            .dwattr $C$DW$T$1095, DW_AT_decl_column(0x03)
    5097                    
    5098                    
    5099                    $C$DW$T$74      .dwtag  DW_TAG_structure_type
    5100                            .dwattr $C$DW$T$74, DW_AT_byte_size(0x02)
    5101                    $C$DW$491       .dwtag  DW_TAG_member
    5102                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$68)
    5103                            .dwattr $C$DW$491, DW_AT_name("event")
    5104                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("event")
    5105                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5106                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5107                            .dwattr $C$DW$491, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5108                            .dwattr $C$DW$491, DW_AT_decl_line(0x79)
    5109                            .dwattr $C$DW$491, DW_AT_decl_column(0x0a)
    5110                    
    5111                    $C$DW$492       .dwtag  DW_TAG_member
    5112                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$68)
    5113                            .dwattr $C$DW$492, DW_AT_name("status")
    5114                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("status")
    5115                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   94

    5116                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5117                            .dwattr $C$DW$492, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5118                            .dwattr $C$DW$492, DW_AT_decl_line(0x7a)
    5119                            .dwattr $C$DW$492, DW_AT_decl_column(0x0a)
    5120                    
    5121                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    5122                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x78)
    5123                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x01)
    5124                            .dwendtag $C$DW$T$74
    5125                    
    5126                    $C$DW$T$1096    .dwtag  DW_TAG_typedef
    5127                            .dwattr $C$DW$T$1096, DW_AT_name("osal_event_hdr_t")
    5128                            .dwattr $C$DW$T$1096, DW_AT_type(*$C$DW$T$74)
    5129                            .dwattr $C$DW$T$1096, DW_AT_language(DW_LANG_C)
    5130                            .dwattr $C$DW$T$1096, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    5131                            .dwattr $C$DW$T$1096, DW_AT_decl_line(0x7b)
    5132                            .dwattr $C$DW$T$1096, DW_AT_decl_column(0x03)
    5133                    
    5134                    
    5135                    $C$DW$T$107     .dwtag  DW_TAG_structure_type
    5136                            .dwattr $C$DW$T$107, DW_AT_byte_size(0x4c)
    5137                    $C$DW$493       .dwtag  DW_TAG_member
    5138                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$77)
    5139                            .dwattr $C$DW$493, DW_AT_name("Crc32")
    5140                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("Crc32")
    5141                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5142                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5143                            .dwattr $C$DW$493, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5144                            .dwattr $C$DW$493, DW_AT_decl_line(0x76)
    5145                            .dwattr $C$DW$493, DW_AT_decl_column(0x25)
    5146                    
    5147                    $C$DW$494       .dwtag  DW_TAG_member
    5148                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$80)
    5149                            .dwattr $C$DW$494, DW_AT_name("FlashGetSize")
    5150                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("FlashGetSize")
    5151                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5152                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5153                            .dwattr $C$DW$494, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5154                            .dwattr $C$DW$494, DW_AT_decl_line(0x77)
    5155                            .dwattr $C$DW$494, DW_AT_decl_column(0x25)
    5156                    
    5157                    $C$DW$495       .dwtag  DW_TAG_member
    5158                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$81)
    5159                            .dwattr $C$DW$495, DW_AT_name("GetChipId")
    5160                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("GetChipId")
    5161                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5162                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5163                            .dwattr $C$DW$495, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5164                            .dwattr $C$DW$495, DW_AT_decl_line(0x78)
    5165                            .dwattr $C$DW$495, DW_AT_decl_column(0x25)
    5166                    
    5167                    $C$DW$496       .dwtag  DW_TAG_member
    5168                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$84)
    5169                            .dwattr $C$DW$496, DW_AT_name("ReservedLocation1")
    5170                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("ReservedLocation1")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   95

    5171                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5172                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5173                            .dwattr $C$DW$496, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5174                            .dwattr $C$DW$496, DW_AT_decl_line(0x79)
    5175                            .dwattr $C$DW$496, DW_AT_decl_column(0x25)
    5176                    
    5177                    $C$DW$497       .dwtag  DW_TAG_member
    5178                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$85)
    5179                            .dwattr $C$DW$497, DW_AT_name("ReservedLocation2")
    5180                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("ReservedLocation2")
    5181                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5182                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5183                            .dwattr $C$DW$497, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5184                            .dwattr $C$DW$497, DW_AT_decl_line(0x7a)
    5185                            .dwattr $C$DW$497, DW_AT_decl_column(0x25)
    5186                    
    5187                    $C$DW$498       .dwtag  DW_TAG_member
    5188                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$86)
    5189                            .dwattr $C$DW$498, DW_AT_name("ReservedLocation3")
    5190                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("ReservedLocation3")
    5191                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5192                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5193                            .dwattr $C$DW$498, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5194                            .dwattr $C$DW$498, DW_AT_decl_line(0x7b)
    5195                            .dwattr $C$DW$498, DW_AT_decl_column(0x25)
    5196                    
    5197                    $C$DW$499       .dwtag  DW_TAG_member
    5198                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$87)
    5199                            .dwattr $C$DW$499, DW_AT_name("ResetDevice")
    5200                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("ResetDevice")
    5201                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5202                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5203                            .dwattr $C$DW$499, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5204                            .dwattr $C$DW$499, DW_AT_decl_line(0x7c)
    5205                            .dwattr $C$DW$499, DW_AT_decl_column(0x25)
    5206                    
    5207                    $C$DW$500       .dwtag  DW_TAG_member
    5208                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$93)
    5209                            .dwattr $C$DW$500, DW_AT_name("Fletcher32")
    5210                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("Fletcher32")
    5211                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5212                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5213                            .dwattr $C$DW$500, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5214                            .dwattr $C$DW$500, DW_AT_decl_line(0x7d)
    5215                            .dwattr $C$DW$500, DW_AT_decl_column(0x25)
    5216                    
    5217                    $C$DW$501       .dwtag  DW_TAG_member
    5218                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$96)
    5219                            .dwattr $C$DW$501, DW_AT_name("MinValue")
    5220                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("MinValue")
    5221                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5222                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5223                            .dwattr $C$DW$501, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5224                            .dwattr $C$DW$501, DW_AT_decl_line(0x7e)
    5225                            .dwattr $C$DW$501, DW_AT_decl_column(0x25)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   96

    5226                    
    5227                    $C$DW$502       .dwtag  DW_TAG_member
    5228                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$97)
    5229                            .dwattr $C$DW$502, DW_AT_name("MaxValue")
    5230                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("MaxValue")
    5231                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5232                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5233                            .dwattr $C$DW$502, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5234                            .dwattr $C$DW$502, DW_AT_decl_line(0x7f)
    5235                            .dwattr $C$DW$502, DW_AT_decl_column(0x25)
    5236                    
    5237                    $C$DW$503       .dwtag  DW_TAG_member
    5238                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$98)
    5239                            .dwattr $C$DW$503, DW_AT_name("MeanValue")
    5240                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("MeanValue")
    5241                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5242                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5243                            .dwattr $C$DW$503, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5244                            .dwattr $C$DW$503, DW_AT_decl_line(0x80)
    5245                            .dwattr $C$DW$503, DW_AT_decl_column(0x25)
    5246                    
    5247                    $C$DW$504       .dwtag  DW_TAG_member
    5248                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$99)
    5249                            .dwattr $C$DW$504, DW_AT_name("StandDeviationValue")
    5250                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("StandDeviationValue")
    5251                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5252                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5253                            .dwattr $C$DW$504, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5254                            .dwattr $C$DW$504, DW_AT_decl_line(0x81)
    5255                            .dwattr $C$DW$504, DW_AT_decl_column(0x25)
    5256                    
    5257                    $C$DW$505       .dwtag  DW_TAG_member
    5258                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$100)
    5259                            .dwattr $C$DW$505, DW_AT_name("ReservedLocation4")
    5260                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("ReservedLocation4")
    5261                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5262                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5263                            .dwattr $C$DW$505, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5264                            .dwattr $C$DW$505, DW_AT_decl_line(0x82)
    5265                            .dwattr $C$DW$505, DW_AT_decl_column(0x25)
    5266                    
    5267                    $C$DW$506       .dwtag  DW_TAG_member
    5268                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$101)
    5269                            .dwattr $C$DW$506, DW_AT_name("ReservedLocation5")
    5270                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("ReservedLocation5")
    5271                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5272                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5273                            .dwattr $C$DW$506, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5274                            .dwattr $C$DW$506, DW_AT_decl_line(0x83)
    5275                            .dwattr $C$DW$506, DW_AT_decl_column(0x25)
    5276                    
    5277                    $C$DW$507       .dwtag  DW_TAG_member
    5278                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$102)
    5279                            .dwattr $C$DW$507, DW_AT_name("HFSourceSafeSwitch")
    5280                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   97

    5281                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5282                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5283                            .dwattr $C$DW$507, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5284                            .dwattr $C$DW$507, DW_AT_decl_line(0x84)
    5285                            .dwattr $C$DW$507, DW_AT_decl_column(0x25)
    5286                    
    5287                    $C$DW$508       .dwtag  DW_TAG_member
    5288                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$103)
    5289                            .dwattr $C$DW$508, DW_AT_name("SelectCompAInput")
    5290                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("SelectCompAInput")
    5291                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5292                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5293                            .dwattr $C$DW$508, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5294                            .dwattr $C$DW$508, DW_AT_decl_line(0x85)
    5295                            .dwattr $C$DW$508, DW_AT_decl_column(0x25)
    5296                    
    5297                    $C$DW$509       .dwtag  DW_TAG_member
    5298                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$104)
    5299                            .dwattr $C$DW$509, DW_AT_name("SelectCompARef")
    5300                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("SelectCompARef")
    5301                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5302                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5303                            .dwattr $C$DW$509, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5304                            .dwattr $C$DW$509, DW_AT_decl_line(0x86)
    5305                            .dwattr $C$DW$509, DW_AT_decl_column(0x25)
    5306                    
    5307                    $C$DW$510       .dwtag  DW_TAG_member
    5308                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$105)
    5309                            .dwattr $C$DW$510, DW_AT_name("SelectADCCompBInput")
    5310                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("SelectADCCompBInput")
    5311                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5312                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5313                            .dwattr $C$DW$510, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5314                            .dwattr $C$DW$510, DW_AT_decl_line(0x87)
    5315                            .dwattr $C$DW$510, DW_AT_decl_column(0x25)
    5316                    
    5317                    $C$DW$511       .dwtag  DW_TAG_member
    5318                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$106)
    5319                            .dwattr $C$DW$511, DW_AT_name("SelectCompBRef")
    5320                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("SelectCompBRef")
    5321                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5322                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5323                            .dwattr $C$DW$511, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5324                            .dwattr $C$DW$511, DW_AT_decl_line(0x88)
    5325                            .dwattr $C$DW$511, DW_AT_decl_column(0x25)
    5326                    
    5327                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    5328                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x75)
    5329                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x01)
    5330                            .dwendtag $C$DW$T$107
    5331                    
    5332                    $C$DW$T$1097    .dwtag  DW_TAG_typedef
    5333                            .dwattr $C$DW$T$1097, DW_AT_name("HARD_API_T")
    5334                            .dwattr $C$DW$T$1097, DW_AT_type(*$C$DW$T$107)
    5335                            .dwattr $C$DW$T$1097, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   98

    5336                            .dwattr $C$DW$T$1097, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\device
    5337                            .dwattr $C$DW$T$1097, DW_AT_decl_line(0x89)
    5338                            .dwattr $C$DW$T$1097, DW_AT_decl_column(0x03)
    5339                    
    5340                    
    5341                    $C$DW$T$108     .dwtag  DW_TAG_structure_type
    5342                            .dwattr $C$DW$T$108, DW_AT_byte_size(0x08)
    5343                    $C$DW$512       .dwtag  DW_TAG_member
    5344                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$45)
    5345                            .dwattr $C$DW$512, DW_AT_name("pCurrEntry")
    5346                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("pCurrEntry")
    5347                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5348                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5349                            .dwattr $C$DW$512, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5350                            .dwattr $C$DW$512, DW_AT_decl_line(0x41)
    5351                            .dwattr $C$DW$512, DW_AT_decl_column(0x0d)
    5352                    
    5353                    $C$DW$513       .dwtag  DW_TAG_member
    5354                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$45)
    5355                            .dwattr $C$DW$513, DW_AT_name("pLastEntry")
    5356                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("pLastEntry")
    5357                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5358                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    5359                            .dwattr $C$DW$513, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5360                            .dwattr $C$DW$513, DW_AT_decl_line(0x42)
    5361                            .dwattr $C$DW$513, DW_AT_decl_column(0x0d)
    5362                    
    5363                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    5364                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x40)
    5365                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x10)
    5366                            .dwendtag $C$DW$T$108
    5367                    
    5368                    $C$DW$T$903     .dwtag  DW_TAG_typedef
    5369                            .dwattr $C$DW$T$903, DW_AT_name("dataQueue_t")
    5370                            .dwattr $C$DW$T$903, DW_AT_type(*$C$DW$T$108)
    5371                            .dwattr $C$DW$T$903, DW_AT_language(DW_LANG_C)
    5372                            .dwattr $C$DW$T$903, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    5373                            .dwattr $C$DW$T$903, DW_AT_decl_line(0x43)
    5374                            .dwattr $C$DW$T$903, DW_AT_decl_column(0x03)
    5375                    
    5376                    $C$DW$T$904     .dwtag  DW_TAG_pointer_type
    5377                            .dwattr $C$DW$T$904, DW_AT_type(*$C$DW$T$903)
    5378                            .dwattr $C$DW$T$904, DW_AT_address_class(0x20)
    5379                    
    5380                    
    5381                    $C$DW$T$109     .dwtag  DW_TAG_structure_type
    5382                            .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
    5383                    $C$DW$514       .dwtag  DW_TAG_member
    5384                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$22)
    5385                            .dwattr $C$DW$514, DW_AT_name("triggerType")
    5386                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("triggerType")
    5387                            .dwattr $C$DW$514, DW_AT_bit_offset(0x04)
    5388                            .dwattr $C$DW$514, DW_AT_bit_size(0x04)
    5389                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5390                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE   99

    5391                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5392                            .dwattr $C$DW$514, DW_AT_decl_line(0x7d)
    5393                            .dwattr $C$DW$514, DW_AT_decl_column(0x0f)
    5394                    
    5395                    $C$DW$515       .dwtag  DW_TAG_member
    5396                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$22)
    5397                            .dwattr $C$DW$515, DW_AT_name("bEnaCmd")
    5398                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("bEnaCmd")
    5399                            .dwattr $C$DW$515, DW_AT_bit_offset(0x03)
    5400                            .dwattr $C$DW$515, DW_AT_bit_size(0x01)
    5401                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5402                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    5403                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5404                            .dwattr $C$DW$515, DW_AT_decl_line(0x7e)
    5405                            .dwattr $C$DW$515, DW_AT_decl_column(0x0f)
    5406                    
    5407                    $C$DW$516       .dwtag  DW_TAG_member
    5408                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$22)
    5409                            .dwattr $C$DW$516, DW_AT_name("triggerNo")
    5410                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("triggerNo")
    5411                            .dwattr $C$DW$516, DW_AT_bit_offset(0x01)
    5412                            .dwattr $C$DW$516, DW_AT_bit_size(0x02)
    5413                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5414                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    5415                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5416                            .dwattr $C$DW$516, DW_AT_decl_line(0x80)
    5417                            .dwattr $C$DW$516, DW_AT_decl_column(0x0f)
    5418                    
    5419                    $C$DW$517       .dwtag  DW_TAG_member
    5420                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$22)
    5421                            .dwattr $C$DW$517, DW_AT_name("pastTrig")
    5422                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("pastTrig")
    5423                            .dwattr $C$DW$517, DW_AT_bit_offset(0x00)
    5424                            .dwattr $C$DW$517, DW_AT_bit_size(0x01)
    5425                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5426                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    5427                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5428                            .dwattr $C$DW$517, DW_AT_decl_line(0x81)
    5429                            .dwattr $C$DW$517, DW_AT_decl_column(0x0f)
    5430                    
    5431                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    5432                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x7c)
    5433                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x0b)
    5434                            .dwendtag $C$DW$T$109
    5435                    
    5436                    
    5437                    $C$DW$T$110     .dwtag  DW_TAG_structure_type
    5438                            .dwattr $C$DW$T$110, DW_AT_byte_size(0x01)
    5439                    $C$DW$518       .dwtag  DW_TAG_member
    5440                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$22)
    5441                            .dwattr $C$DW$518, DW_AT_name("rule")
    5442                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("rule")
    5443                            .dwattr $C$DW$518, DW_AT_bit_offset(0x04)
    5444                            .dwattr $C$DW$518, DW_AT_bit_size(0x04)
    5445                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Dec 12 17:42:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\THE_WO~1\AppData\Local\Temp\{C0574ABD-1B2B-4B91-82C1-11E022F9B692} PAGE  100

    5446                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    5447                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5448                            .dwattr $C$DW$518, DW_AT_decl_line(0x85)
    5449                            .dwattr $C$DW$518, DW_AT_decl_column(0x0f)
    5450                    
    5451                    $C$DW$519       .dwtag  DW_TAG_member
    5452                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$22)
    5453                            .dwattr $C$DW$519, DW_AT_name("nSkip")
    5454                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("nSkip")
    5455                            .dwattr $C$DW$519, DW_AT_bit_offset(0x00)
    5456                            .dwattr $C$DW$519, DW_AT_bit_size(0x04)
    5457                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5458                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    5459                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5460                            .dwattr $C$DW$519, DW_AT_decl_line(0x86)
    5461                            .dwattr $C$DW$519, DW_AT_decl_column(0x0f)
    5462                    
    5463                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    5464                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x84)
    5465                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x0b)
    5466                            .dwendtag $C$DW$T$110
    5467                    
    5468                    
    5469                    $C$DW$T$111     .dwtag  DW_TAG_structure_type
    5470                            .dwattr $C$DW$T$111, DW_AT_byte_size(0x01)
    5471                    $C$DW$520       .dwtag  DW_TAG_member
    5472                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$22)
    5473                            .dwattr $C$DW$520, DW_AT_name("triggerType")
    5474                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("triggerType")
    5475                            .dwattr $C$DW$520, DW_AT_bit_offset(0x04)
    5476                            .dwattr $C$DW$520, DW_AT_bit_size(0x04)
    5477                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5478                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    5479                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5480                            .dwattr $C$DW$520, DW_AT_decl_line(0x98)
    5481                            .dwattr $C$DW$520, DW_AT_decl_column(0x0f)
    5482                    
    5483                    $C$DW$521       .dwtag  DW_TAG_member
    5484                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$22)
    5485                            .dwattr $C$DW$521, DW_AT_name("bEnaCmd")
